[
    {
        "parent": "Advanced JavaScript Interview Questions: Ace the JS Interview | Udemy",
        "children": [
            "A basic understanding of Javascript"
        ]
    },
    {
        "parent": "Accelerated ES6 JavaScript Training | Udemy",
        "children": [
            "Basic to advanced JavaScript knowledge or resources on ES5 JavaScript follow along, are required",
            "Basic Web Development Skills (HTML, CSS, JavaScript) are assumed",
            "Advanced JavaScript Knowledge is a Plus"
        ]
    },
    {
        "parent": "Learn JavaScript for Web Development | Udemy",
        "children": [
            "No coding experience is required. You will start learning from the basics.",
            "All you need to get started is a code editor &amp; internet browser.",
            "If you know basic html &amp; css that would be bonus otherwise no worries."
        ]
    },
    {
        "parent": "Learn Modern JavaScript & Object Oriented Programming Fast | Udemy",
        "children": [
            "At least 3 months experience with JavaScript"
        ]
    },
    {
        "parent": "JavaScript Design Patterns: 20 Patterns for Expert Code | Udemy",
        "children": [
            "This video course is for web developers who have a strong foundation in JavaScript with familiarity in Object-oriented JavaScript as well. It will help you create a strong foothold into the world of design patterns to integrate them into your workflow."
        ]
    },
    {
        "parent": "Dynamic JavaScript Master Class AJAX JSON Simple APIs | Udemy",
        "children": [
            "Basic HTML and CSS",
            "Basic JavaScript and understanding of the DOM",
            "Basic PHP and MySQL understanding",
            "Access to computer",
            "Solid foundation in coding"
        ]
    },
    {
        "parent": "Latest JavaScript Traning 2019 - JavaScript for Beginners | Udemy",
        "children": [
            "No Requirement"
        ]
    },
    {
        "parent": "JavaScript and React for Developers: Master the Essentials | Udemy",
        "children": [
            "Before taking this course you should know how to read HTML and CSS and be able to write very basic JavaScript (if statements, loops, and objects).",
            "In this course, I will help you install the necessary software, libraries, and tools on your computer. It will be helpful if you are comfortable with installing your own software and knowing a couple terminal commands (specifically mkdir and cd).",
            "The ideal student would be eager to learn the theory behind certain aspects of the browser, JavaScript, and React, in addition to hands-on applications."
        ]
    },
    {
        "parent": "ES6 JavaScript Reloaded | Udemy",
        "children": [
            "You should be able to understand basic JavaScript"
        ]
    },
    {
        "parent": "Learn Advanced JavaScript Topics through Projects and Exercises | Udemy",
        "children": [
            "This is an advanced course in JavaScript, so you should have taken the beginning course: Learn Modern JavaScript: Getting Started or you should have a good familiarity with the basics of JavaScript."
        ]
    },
    {
        "parent": "Javascript ES6! A Complete Reference Guide to Javascript ES6 | Udemy",
        "children": [
            "Working or Intermediate knowledge of Javascript.",
            "Want to improve your coding skills and take them to the next level",
            "Want to excel in frameworks like React JS, Angular JS, meteor JS or Vue JS - This course will definitely help you in that journey",
            "This isn't JavaScript from scratch, so if you are looking for a beginner course this probably isn't it. ",
            "You should have some knowledge of functions, variables, Objects, Arrays and other fundamentals."
        ]
    },
    {
        "parent": "A Beginners Guide to Advanced JavaScript & ES6 - ES2017 | Udemy",
        "children": [
            "Basic JavaScript Knowledge (arrays, objects, loops, and functions)"
        ]
    },
    {
        "parent": "Javascript Intermediate level 2 - All about functions | Udemy",
        "children": [
            "Basic JavaScript knowledge"
        ]
    },
    {
        "parent": "React for Beginners: A Complete Guide to Getting Started | Udemy",
        "children": [
            "An intermediate understanding of HTML, CSS and JavaScript are necessary for this course.",
            "Fluency in English",
            "Come self-driven and motivated to learn!"
        ]
    },
    {
        "parent": "Using Modern JavaScript Today | Udemy",
        "children": [
            "Experience building web applications or sites, using JavaScript and common libraries such as jQuery, is required",
            "Have a basic understanding of how to navigate your platform's terminal or command line"
        ]
    },
    {
        "parent": "Modern JavaScript: Building Real-World, Real-Time Apps | Udemy",
        "children": [
            "Experience building web applications or sites using JavaScript",
            "Have a basic understanding of how to navigate your platform's terminal or command line",
            "Understand the basics of using NPM and Node.js to write server-side JavaScript"
        ]
    },
    {
        "parent": "Node.js: The Complete Guide to Build RESTful APIs (2018) | Udemy",
        "children": [
            "Basic familiarity with JavaScript"
        ]
    },
    {
        "parent": "Node JS Advanced Training: Learn with Tests, Projects & Exercises | Udemy",
        "children": [
            "Basic knowledge of Node, Express, and MongoDB",
            "Strong knowledge of Javascript"
        ]
    },
    {
        "parent": "Node.js API Masterclass With Express & MongoDB | Udemy",
        "children": [
            "Modern JavaScript (ES6)",
            "Basic programming principles",
            "Basic knowledge of Node helps"
        ]
    },
    {
        "parent": "Docker for Node.js Projects From a Docker Captain | Udemy",
        "children": [
            "Know Docker 101: the Docker basics like images, containers, and docker networks",
            "Know NodeJS 101: Understand NodeJS language and frameworks basics",
            "Know the basics of command lines and shells, and packages managers like apt or yum",
            "Familiar with the basics of programming, cloud computing, and how to deploy apps to servers",
            "Use a modern Linux, Windows, or macOS computer that supports Docker"
        ]
    },
    {
        "parent": "Node.js Unit Testing In-Depth: Unit Testing from Theory to Practice | Udemy",
        "children": [
            "Basic knowledge of node is required."
        ]
    },
    {
        "parent": "Complete Modern Amazon clone: Angular 5 and Node.js | Udemy",
        "children": [
            "Should know basics of Javascript operations",
            "Students should know basics of HTML and CSS",
            "Students should be really passionate about building web application"
        ]
    },
    {
        "parent": "The Serverless Framework with Node.js & AWS | Udemy",
        "children": [
            "You should be comfortable using your computer's terminal, and have intermediate JavaScript skills. The course is recorded on a Mac, without instructions for Windows users."
        ]
    },
    {
        "parent": "Node Program: From 0 to Hero with Nodejs and MongoDB | Udemy",
        "children": [
            "Computer",
            "Heroku and AWS accounts",
            "Knowledge in web development (HTML, CSS, browser JS)",
            "Knowledge&amp;skills in programming"
        ]
    },
    {
        "parent": "Node.js Crash Course : For Backend Development 2020 | Udemy",
        "children": [
            "PC/Laptop &amp; internet connection",
            "Basics of Javascript would help but not necessary"
        ]
    },
    {
        "parent": "NodeJS 3 in 1: Basics of NodeJS & Express With Projects | Udemy",
        "children": [
            "Student should have basic knowledge of Javascript",
            "Student should have basic knowledge of HTML"
        ]
    },
    {
        "parent": "Beast Android Development:Integrating A Node.Js Server | Udemy",
        "children": [
            "You should understand android concepts such as the activity life cycle, recyler-views, fragments, and xml layouts",
            "You should understand the basics of rx-java some topics including what observers/observables, how to use subjects, and making background threads",
            "You should be able to utilize Googles Firebase inside an android project ",
            "You should have access to your SHA1 fingerprint",
            "You should understand how to install and use butter-knife for android view bindings",
            "You should already have android studios installed and have at least two devices for testing. You can use 2 emulators but it is recommended you use at least one phone.",
            "You do not need to have any node.js experience to take this course "
        ]
    },
    {
        "parent": "Node.js Design Patterns | Udemy",
        "children": [
            "The intended audience is expected to have basic knowledge of Node .js and the ecosystem, good command over JavaScript, and intermediate working skills on Linux/MacOS."
        ]
    },
    {
        "parent": "WordPress Development With NodeJS, Gulp, Composer & More | Udemy",
        "children": [
            "Experience with PHP",
            "Experience with WordPress development, either with themes and/or plugins"
        ]
    },
    {
        "parent": "Writing Clean Asynchronous Code In Node.js | Udemy",
        "children": [
            "Basic Knowledge of Javascript is Important",
            "Basic Knowledge of Nodejs is Important",
            "Basic Knowledge of Expressjs is Important"
        ]
    },
    {
        "parent": "Node.js & Hapi.js: Building Enterprise Web Apps | Udemy",
        "children": [
            "A computer on which you can install software (Windows, MacOS, or Linux)",
            "A basic understanding of JavaScript (variables, functions, objects, arrays, if statements)",
            "Your favorite text editor or IDE"
        ]
    },
    {
        "parent": "Introduction to Node.js Development | Udemy",
        "children": [
            "Introduction to HTML",
            "Introduction to JavaScript Development",
            "Intermediate JavaScript Development"
        ]
    },
    {
        "parent": "*NEW* DOM 2020 Build Dynamic Websites with JavaScript Part 2 | Udemy",
        "children": [
            "Ideally, completed Part 1 of this course",
            "Desire to become a full stack web developer",
            "A need to take your web development skills to the next level",
            "Desire to create dynamic, interesting and acclaimed websites",
            "Desire to have unique features and actions to engage visitors to your website",
            "Basic HTML, CSS and JavaScript will be helpful, but not absolutely necessary",
            "Desire to KNOW what DOM events are, how to listen to them and how to master front end website development",
            "Desire to KNOW how user interaction (like clicking a button, or submitting a form) can cause jazzy things to happen on your page (like displaying a message, or changing a button color, etc.)",
            "A computer is required as you need to code alongside me to learn effectively"
        ]
    },
    {
        "parent": "Build A Complete CMS App Using Angular 5 | Udemy",
        "children": [
            "Basic Knolwedge of JavaScript is essential to complete the course"
        ]
    },
    {
        "parent": "Getting started with Angular and Nrwl Nx | Udemy",
        "children": [
            "Angular Fundamentals",
            "Typescipt Fundamentals",
            "Redux Fundamentals"
        ]
    },
    {
        "parent": "Make Two Websites From Scratch: Javascript and HTML | Udemy",
        "children": [
            "A computer is needed",
            "Basic HTML, CSS and JQuery knowledge"
        ]
    },
    {
        "parent": "JavaScript & front-end (not only) for back-end developers | Udemy",
        "children": [
            "Object-Oriented Programming",
            "Practical knowledge about a modern IDE (e.g. IntelliJ)",
            "Practical knowledge about at least one programming language (e.g. Java)"
        ]
    },
    {
        "parent": "Stylish Dynamic Web Forms with jQuery validation | Udemy",
        "children": [
            "Basic HTML, CSS and jQuery but templates can be used out of the box. For Wordpress integration basic knowledge of setting up a Wordpress site."
        ]
    },
    {
        "parent": "Front End Component Architecture (React and Angular) | Udemy",
        "children": [
            "Yes, the student will need to have access to concept-draw diagram, concept-draw mind-map, visual studio, and visual studio code."
        ]
    },
    {
        "parent": "Email Development for Email Marketing and Enthusiasts | Udemy",
        "children": [
            "You can answer the question of why do you need quality emails",
            "You have experience using PC",
            "Basic understanding of HTML &amp; CSS will be a plus"
        ]
    },
    {
        "parent": "Website Speed Optimization - Front-end + WordPress | Udemy",
        "children": [
            "At least basic knowledge of HTML, CSS and JavaScript",
            "Some experience with web development will help you better understand the course objective",
            "Internet connection, web browser and text editor are all the tools you will need",
            "Graphics editor will be needed to optimize image files"
        ]
    },
    {
        "parent": "Front-End Web Development using Go | Udemy",
        "children": [
            "This video course provides a pragmatic approach to learning front-end web development using Go. Each video provides in-depth knowledge on a topic with a number of hands-on examples. As you progress through the course, we continue to elevate your skills to the next level."
        ]
    },
    {
        "parent": "Free Front End Web Development Tutorial - Typescript with modern React (i.e. hooks, context, suspense) | Udemy",
        "children": []
    },
    {
        "parent": "Free Front End Web Development Tutorial - Build your first React JS Application | Udemy",
        "children": []
    },
    {
        "parent": "Free Front End Web Development Tutorial - The Front End with 7 Quick Projects | Udemy",
        "children": []
    },
    {
        "parent": "HTML IN ONE HOUR | Udemy",
        "children": [
            "No requirements"
        ]
    },
    {
        "parent": "GIMP/HTML: Wordpress Website Development with HTML and GIMP | Udemy",
        "children": [
            "A PC or a Mac",
            "A standards based web browser",
            "A glancing familiarity with the GIMP and HTML."
        ]
    },
    {
        "parent": "HTML AND CSS COURSE - With a full complete Project | Udemy",
        "children": [
            "The most important requirement is positive attitude towards programming and being passionate about learning programming.",
            "I don't have to remind you that you need a computer. Desktop or laptop. The operating system doesn't matter"
        ]
    },
    {
        "parent": "Create Mobile-Friendly Web Apps With HTML | Udemy",
        "children": [
            "You'll find this course easier to digest if you have some exposure to HTML5 and CSS3 - on the level of a Dummies book, for example"
        ]
    },
    {
        "parent": "Basic to Advanced Website Designing Course HTML,CSS, JS / JQ | Udemy",
        "children": [
            "No prior design or coding knowledge required!",
            "Any operating system: Mac, PC, Linux",
            "You Should Be able to Use a PC/Laptop"
        ]
    },
    {
        "parent": "Beginning Responsive Web Development with HTML and CSS | Udemy",
        "children": [
            "To gain maximum from this course, you should have prior exposure and understanding of basic HTML and the CSS syntax."
        ]
    },
    {
        "parent": "Introduction to Responsive Websites : HTML, CSS, Bootstrap 4 | Udemy",
        "children": [
            "Installing software as we will install all tools required in this course",
            "Creating folders , files and moving them",
            "Browser : Firefox, Chrome etc",
            "File editor : Sublime text",
            "Web service : Xampp"
        ]
    },
    {
        "parent": "HTML Advanced MCQ Test | Udemy",
        "children": []
    },
    {
        "parent": "Spark and Python for Big Data with PySpark | Udemy",
        "children": [
            "General Programming Skills in any Language (Preferrably Python)",
            "20 GB of free space on your local computer (or alternatively a strong internet connection for AWS)"
        ]
    },
    {
        "parent": "Build REST APIs with Flask and Python (The Complete Course) | Udemy",
        "children": [
            "Some prior programming experience in any programming language will help. The course includes a full Python refresher course.",
            "All software used in the course is provided, and completely free",
            "Complete beginners may wish to take a beginner Python course first, and then transition to this course afterwards"
        ]
    },
    {
        "parent": "Learn Python for Data Structures, Algorithms & Interviews | Udemy",
        "children": [
            "Basic to Intermediate Python skills. "
        ]
    },
    {
        "parent": "Artificial Intelligence: Reinforcement Learning in Python | Udemy",
        "children": [
            "Calculus (derivatives)",
            "Probability / Markov Models",
            "Numpy, Matplotlib",
            "Beneficial ave experience with at least a few supervised machine learning methods",
            "Gradient descent",
            "Good object-oriented programming skills"
        ]
    },
    {
        "parent": "Data Science: Deep Learning in Python | Udemy",
        "children": [
            "Basic math (calculus derivatives, matrix arithmetic, probability)",
            "Install Numpy and Python",
            "Don't worry about installing TensorFlow, we will do that in the lectures.",
            "Being familiar with the content of my logistic regression course (cross-entropy cost, gradient descent, neurons, XOR, donut) will give you the proper context for this course"
        ]
    },
    {
        "parent": "Natural Language Processing (NLP): Deep Learning in Python | Udemy",
        "children": [
            "Install Numpy, Matplotlib, Sci-Kit Learn, and Theano or TensorFlow (should be extremely easy by now)",
            "Understand backpropagation and gradient descent, be able to derive and code the equations on your own",
            "Code a recurrent neural network from basic primitives in Theano (or Tensorflow), especially the scan function",
            "Code a feedforward neural network in Theano (or Tensorflow)",
            "Helpful to have experience with tree algorithms"
        ]
    },
    {
        "parent": "Interactive Course: Use Python Dashboards with Plotly & Dash | Udemy",
        "children": [
            "Knowledge of Basic Python",
            "Computer with Internet Access"
        ]
    },
    {
        "parent": "Python 3: Deep Dive (Part 1 - Functional) | Udemy",
        "children": [
            "Basic introductory knowledge of Python programming (variables, conditional statements, loops, functions, lists, tuples, dictionaries, classes).",
            "You will need Python 3.6 or above, and a development environment of your choice (command line, PyCharm, Jupyter, etc.)"
        ]
    },
    {
        "parent": "Advanced AI: Deep Reinforcement Learning with Python | Udemy",
        "children": [
            "Know reinforcement learning basics, MDPs, Dynamic Programming, Monte Carlo, TD Learning",
            "College-level math is helpful",
            "Experience building machine learning models in Python and Numpy",
            "Know how to build ANNs and CNNs using Theano or Tensorflow"
        ]
    },
    {
        "parent": "Build a Backend REST API with Python & Django - Advanced | Udemy",
        "children": [
            "Basic knowledge of programming and building simple applications",
            "Familiar with Django",
            "Comfortable using command line tools (Terminal/Command Prompt)",
            "macOS, Linux or Windows machine capable of running Docker (This excludes Windows 10 Home)",
            "Positive attitude and willingness to learn!"
        ]
    },
    {
        "parent": "Learn Automation Software Testing with Python | Udemy",
        "children": [
            "We'll give you a complete Python refresher, but some previous knowledge of programming will be helpful",
            "Some knowledge of how web applications work",
            "Understanding of REST APIs will be helpful, but not required"
        ]
    },
    {
        "parent": "Deep Learning with Python and Keras | Udemy",
        "children": [
            "Knowledge of Python, familiarity with control flow (if/else, for loops) and pythonic constructs (functions, classes, iterables, generators)",
            "Use of bash shell (or equivalent command prompt) and basic commands to copy and move files",
            "Basic knowledge of linear algebra (what is a vector, what is a matrix, how to calculate dot product)",
            "Use of ssh to connect to a cloud computer"
        ]
    },
    {
        "parent": "Python Beyond the Basics - Object-Oriented Programming | Udemy",
        "children": [
            "This course is designed for users that already have a basic working knowledge of Python"
        ]
    },
    {
        "parent": "Unsupervised Deep Learning in Python | Udemy",
        "children": [
            "Knowledge of calculus and linear algebra",
            "Python coding skills",
            "Some experience with Numpy, Theano, and Tensorflow",
            "Know how gradient descent is used to train machine learning models",
            "Install Python, Numpy, and Theano",
            "Some probability and statistics knowledge",
            "Code a feedforward neural network in Theano or Tensorflow"
        ]
    },
    {
        "parent": "Python for Offensive PenTesting: A Complete Practical Course | Udemy",
        "children": [
            "Basic knowledge in Python or ANY other programming/scripting languages",
            "Intermediate knowledge in penetration testing and ethical hacking"
        ]
    },
    {
        "parent": "Elegant Automation Frameworks with Python and Pytest | Udemy",
        "children": [
            "You should have a basic understanding of the Python programming language"
        ]
    },
    {
        "parent": "Advanced CSS and Sass: Flexbox, Grid, Animations and More | Udemy",
        "children": [
            "This not a beginner course — You should be confident in coding HTML and CSS before taking the course",
            "Any computer and OS will work — Windows, macOS or Linux",
            "There is no need for any paid software — The text editor you already have works just fine"
        ]
    },
    {
        "parent": "Phonegap & Ludei - Build HTML5 CSS & JS Apps | Udemy",
        "children": [
            "Have a good understanding of HTML, CSS and especially Javascript"
        ]
    },
    {
        "parent": "Introduction to Sass for CSS | Udemy",
        "children": [
            "Sass installed (free)"
        ]
    },
    {
        "parent": "Learning Path: CSS: Mastering Web Design with CSS3 Selectors | Udemy",
        "children": [
            "A basic understanding of the HTML syntax is required to take this Video Learning Path.",
            "Atom editor is recommended for editing the code. "
        ]
    },
    {
        "parent": "HTML5 for web design build your first project with html5 | Udemy",
        "children": [
            "•\tNo coding or design experience necessary",
            "•\tAny computer will do — Windows, OSX or Linux",
            "•\tYou don’t need to buy any software — we will use the best free web development editor in the world"
        ]
    },
    {
        "parent": "HTML, CSS tricks with famous sites - Only for fun! | Udemy",
        "children": [
            "Basic level of the HTML/CSS is required"
        ]
    },
    {
        "parent": "CSS 3D | Udemy",
        "children": [
            "HTML",
            "CSS 2 &amp; 3",
            "Jquery",
            "SCSS"
        ]
    },
    {
        "parent": "Make Four Projects From Scratch: CSS And HTML | Udemy",
        "children": [
            "A basic understanding of HTML and CSS"
        ]
    },
    {
        "parent": "Advanced CSS Development | Udemy",
        "children": [
            "Recommended Courses:",
            "Introduction to CSS Development",
            "Introduction to HTML",
            "Getting Started as a Web Developer"
        ]
    },
    {
        "parent": "CSS Floating Layouts | Udemy",
        "children": [
            "Basic computer skills"
        ]
    },
    {
        "parent": "CSS | Udemy",
        "children": [
            "HTML"
        ]
    },
    {
        "parent": "JavaScript Shopping Cart Tutorial | Udemy",
        "children": [
            "JavaScript Basics",
            "JavaScript Objects",
            "JavaScript Functions"
        ]
    },
    {
        "parent": "Create An Online Poll Maker From Scratch: PHP and MySQLI | Udemy",
        "children": [
            "Familiarity With Basic HTML",
            "Familiarity With Basic CSS",
            "Familiarity With Basic Javascript",
            "Familiarity With Basic PHP",
            "Familiarity With Basic MySQLI"
        ]
    },
    {
        "parent": "Free CSS Tutorial - Mastering CSS 3.0 Selectors | Udemy",
        "children": []
    },
    {
        "parent": "Free CSS Tutorial - CSS Advanced Tutorial | Udemy",
        "children": []
    },
    {
        "parent": "Working with MongoDB | Udemy",
        "children": [
            "Introduction to JavaScript Development",
            "Intermediate JavaScript Development",
            "Introduction to Node.JS Development"
        ]
    },
    {
        "parent": "MongoDB Administration | Udemy",
        "children": [
            "Basic understanding of MongoDB"
        ]
    },
    {
        "parent": "MongoDB: Learn Administration and Security in MongoDB | Udemy",
        "children": [
            "Basic knowledge of database is required.",
            "Prior knowledge of mongodb would be an added advantage",
            "Basics of SQL will be helpul But if don't know then we'll provide links where you can refer"
        ]
    },
    {
        "parent": "Relay Modern + GraphQL + React + MongoDb | Udemy",
        "children": [
            "Intermediate level of JavaScript",
            "Very basic knowledge of HTML and CSS"
        ]
    },
    {
        "parent": "MongoDB: Initiating the Next Step | Udemy",
        "children": [
            "PC or MAC",
            "Fundamentals of NoSQL Databases",
            "Basics of MongoDB"
        ]
    },
    {
        "parent": "Learning Path: MongoDB: Backend Programming with MongoDB | Udemy",
        "children": [
            "Basic knowledge of SQL programming",
            "Basic knowledge of Python programming"
        ]
    },
    {
        "parent": "Certified MongoDB - DBA Associate Practice Exams | Udemy",
        "children": []
    },
    {
        "parent": "Certified MongoDB Developer Associate Practice Exams | Udemy",
        "children": []
    },
    {
        "parent": "Learning MongoDB Schema, Indexes and Queries | Udemy",
        "children": [
            "Prior knowledge of relational database systems will be very helpful as we often compare and contrast MongoDB features with traditional databases."
        ]
    },
    {
        "parent": "Developing with MongoDB | Udemy",
        "children": [
            "Basic understanding of the features of MongoDB."
        ]
    },
    {
        "parent": "MongoDB Tools and Services | Udemy",
        "children": [
            "This video is a comprehensive tutorial to help you master MongoDB, with advanced examples and use-cases wherever required. Each concept is explained in a very easy to understand manner, coupled with tips, tricks and best practices."
        ]
    },
    {
        "parent": "Free MongoDB Tutorial - Mongoose: MongoDB Object-Document Mapper for NodeJS Apps | Udemy",
        "children": []
    },
    {
        "parent": "PHP MVC Step-by-Step Tutorial: Object Oriented PHP and MVC | Udemy",
        "children": [
            "You should know basic PHP &amp; programming concepts"
        ]
    },
    {
        "parent": "PHP Unit Testing with PHPUnit: Find Bugs and Improve Code Quality | Udemy",
        "children": [
            "You must know PHP, including object-oriented code",
            "Be happy running commands in the terminal / command line on your computer",
            "Ideally have PHP and Composer installed, but a brief overview of installing these will be covered"
        ]
    },
    {
        "parent": "Android Development Working With Databases Using Mysql & PHP | Udemy",
        "children": [
            "Basics of android application development",
            "Basics of android studio tool to develop android apps",
            "Basic knowledge of databases",
            "Basic knowledge of PHP"
        ]
    },
    {
        "parent": "Getting Started with PHP 7 | Udemy",
        "children": [
            " No grounding in PHP required.",
            "The video will get you to speed in everything from basic programming practices to high end techniques."
        ]
    },
    {
        "parent": "PHP CodeIgniter - Learn CodeIgniter | Udemy",
        "children": [
            "PHP Knowledge",
            "PHP 5.3+ (5.4 Preferred)",
            "MySQL",
            "Apache (enabled mod_rewrite)",
            "Or one of these setup: WAMP / XXAMP / MAMP / or LAMP"
        ]
    },
    {
        "parent": "Complete php mysql course - Learn php mysql and php oop | Udemy",
        "children": [
            "The basic knowledge of HTML &amp; CSS (Optional)",
            "No other requirement we will cover everything from zero- hundred"
        ]
    },
    {
        "parent": "Complete PHP OOP Concepts for Absolute Beginners + Projects | Udemy",
        "children": [
            "You should know PHP Basics.",
            "Windows or Mac Machine with PHP Installed.",
            "Able to Understand English Language."
        ]
    },
    {
        "parent": "Learn Advanced PHP Programming | Udemy",
        "children": [
            "A text editor and a passion for learning.",
            "Existing knowledge of PHP"
        ]
    },
    {
        "parent": "Login and Registration from Scratch with PHP and MySQL | Udemy",
        "children": [
            "You should be familiar with using PHP and MySQL to create a database driven web page",
            "Basic knowledge of how to use PHP classes"
        ]
    },
    {
        "parent": "Certified Secure Coder- PHP (CSC- PHP) | Udemy",
        "children": [
            "basic programming in PHP",
            "web based programming language"
        ]
    },
    {
        "parent": "PHP registration, login and content management system | Udemy",
        "children": [
            "Basic knowledge of HTML, CSS, JavaScript",
            "Basic knowledge of PHP",
            "Basic knowledge of SQL and databases",
            "All of the above can be had in my course Introduction to web programming for GIS"
        ]
    },
    {
        "parent": "Object Oriented PHP & TDD with PHPUnit from Scratch | Udemy",
        "children": [
            "Basic knowledge of PHP",
            "Basis Knowledge of PDO or MySQLi",
            "PHP 7 or Higher"
        ]
    },
    {
        "parent": "Create a Subscription Service with Stripe and PHP | Udemy",
        "children": [
            "PHP: Beginner to intermediate skills.",
            "Javascript: Beginner to intermediate skills",
            "HTML: Beginner to intermediate skills",
            "CSS: Beginner skill with some experience.",
            "PHP Web server: Need to have access to a running web server with PHP 5.3.3 or later.",
            "SQL: Beginner to intermediate skills. We use SQLite in the course.",
            "Stripe Account: You need a Stripe testing account. How to set one up is covered in the course.",
            "Web Developer Tools: You should know how to open web developer tools in a web browser and navigate. We use Chrome web developer tools in the course materials. You can use others if you prefer.",
            "Code editor of your choice.",
            "Stripe Stripe Checkout Form: We use the Stripe Checkout Form with AJAX and Javascript. You will be able to follow along and understand if you have no experience with the Stripe Checkout Form. However we do not go into depth about the code behind it. If you want a more in-depth learning experience on the Stripe Checkout Form we recommend our companion course offered here on Udemy:  Learn Stripe PHP: Make Checkout Webpages"
        ]
    },
    {
        "parent": "Learn PHP To Create Basic Student Roll Attendance System | Udemy",
        "children": [
            "Basic PHP Function.",
            "Basic Bootstrap Class",
            "A Desire to Learn PHP",
            "PC of-Course :)"
        ]
    },
    {
        "parent": "SOLID Principles in PHP : Learn how to write better code | Udemy",
        "children": [
            "You should have a fair understanding of PHP",
            "Working knowledge of MVC framework will help"
        ]
    },
    {
        "parent": "Building PHP RESTful Web Services | Udemy",
        "children": [
            "This course is designed for PHP developers who are keen to master RESTful web services in simple and easy steps with the seventh edition of PHP and its frameworks."
        ]
    },
    {
        "parent": "Advanced React and Redux Tutorial: 2019 Edition | Udemy",
        "children": [
            "Solid understanding of React",
            "Intermediate understanding of Redux; you should have knowledge of reducers, actions, and action creators"
        ]
    },
    {
        "parent": "GraphQL with React Course: The Complete Developers Guide | Udemy",
        "children": [
            "Familiarity with React"
        ]
    },
    {
        "parent": "Server Side Rendering with React and Redux | Udemy",
        "children": [
            "This is not a beginner course. You must be familiar with React, Redux, React Router, and Express"
        ]
    },
    {
        "parent": "React Testing with Jest and Enzyme | Udemy",
        "children": [
            "Be familiar with JavaScript and React / Redux (Redux is optional and used only in the second half of the course)"
        ]
    },
    {
        "parent": "React - Mastering Test Driven Development | Udemy",
        "children": [
            "Some JavaScript experience would be ideal.",
            "While not necessary, some React experience would help."
        ]
    },
    {
        "parent": "Build a Slack Chat App with React, Redux, and Firebase | Udemy",
        "children": [
            "Some experience with React (i.e. having built a couple of projects with React Create App)",
            "Prior knowledge of ES6 features will help (spread operators, destructuring, object shorthand syntax)"
        ]
    },
    {
        "parent": "The Complete Guide to Advanced React Component Patterns | Udemy",
        "children": [
            "You are NOT an absolute React beginner",
            "You already know how to build simple React component",
            "You have a basic understanding of how hooks work at least useState &amp; useEffect"
        ]
    },
    {
        "parent": "Build an Online Store with React and GraphQL in 90 Minutes | Udemy",
        "children": [
            "Some experience with React (i.e. having built a couple of projects with React Create App)",
            "Prior knowledge of ES6 features will help (spread operators, destructuring, object shorthand syntax)"
        ]
    },
    {
        "parent": "React Pizza Shop - Ordering Food with Hooks and Firebase | Udemy",
        "children": [
            "This course is at a professional level, basic familiarity with React and web development are recommended, however the entire project is created from scratch so beginners are encouraged to try it out."
        ]
    },
    {
        "parent": "Redux JS - Learn to use Redux JS with your React JS apps! | Udemy",
        "children": [
            "Good understanding of React JS - There is a bonus section on getting started with React JS",
            "Basic knowledge of HTML, CSS, Javascript and Web Development",
            "Understanding of \"state\" and \"props\" in React",
            "Understanding Components management in React"
        ]
    },
    {
        "parent": "Learn ReactJS: Code Like A Facebook Developer | Udemy",
        "children": [
            "Solid understanding of Javascript",
            "HTML &amp; CSS experience"
        ]
    },
    {
        "parent": "React and Redux - Building a Production E-Commerce | Udemy",
        "children": [
            "A computer on which you can install software (Windows, MacOS, or Linux)",
            "Some knowledge about React and Redux"
        ]
    },
    {
        "parent": "React, TypeScript, Redux, StyledComponents: Build Sudoku App | Udemy",
        "children": [
            "Familiarity with ReactJS",
            "Computer (Window, Mac or Linux)",
            "Internet Connection"
        ]
    },
    {
        "parent": "Advanced React (Render Performance Best Practices Patterns) | Udemy",
        "children": [
            "JavaScript basic knowledge",
            "Reactjs basic knowledge",
            "Nodejs Installed",
            "npm v5.2+ installed",
            "Git installed"
        ]
    },
    {
        "parent": "The Complete Web Development Tutorial Using React and Redux | Udemy",
        "children": [
            "Students should have good understanding of JavaScript before starting the course"
        ]
    },
    {
        "parent": "Learn Full-Stack Vue, .NET Core, PostgreSQL Web Development | Udemy",
        "children": [
            "Beginner to intermediate familiarity with web development",
            "An interest in hands-on learning by building software"
        ]
    },
    {
        "parent": "Python/Django App- Create & Deploy a Computer Vision Model | Udemy",
        "children": [
            "Python (I did included some python basics as a refresher)",
            "Knowledge of Deep learning good to have but not a must. I did included detailed lectures explaining CNN architecture and transfer learning, along with code.",
            "Zeal to learn."
        ]
    },
    {
        "parent": "Build PHP Hospital System Using CodeIgniter Framework (2020) | Udemy",
        "children": [
            "PHP version 7+ is a must",
            "Little knowledge of PHP, though not neccessary becase I'll teach you everything you need to know",
            "Little knowledge of CSS will be an advantage",
            "Zeal to learn codeigniter framework",
            "Computer system - windows/mac",
            "I'll walk you through, step-by-step how to setup codeigniter"
        ]
    },
    {
        "parent": "Go Essentials for Full Stack Web Development | Udemy",
        "children": [
            "Filled with hands-on examples, this course will help you learn how to perform real-time web development using GO. You will learn to build various applications and enhance them."
        ]
    },
    {
        "parent": "Full Stack App Development with Spring 5 and Angular: 3-in-1 | Udemy",
        "children": [
            "Basic knowledge of Java and JavaScript is required."
        ]
    },
    {
        "parent": "Full-stack Deno with GraphQL, NextJS, and PostgreSQL | Udemy",
        "children": [
            "A computer: macOS, Windows, or Linux",
            "Know/Understand Javascript",
            "Basic knowledge of Node and React",
            "Basic understanding of Typescript will help, but not required as you can use Javascript",
            "You do not need to have GraphQL knowledge"
        ]
    },
    {
        "parent": "Full Stack Web Development with Spring 5 | Udemy",
        "children": [
            "This course is for Java developers who want to master the Spring framework modules with Hibernate quickly to build powerful and secure applications."
        ]
    },
    {
        "parent": "Workflow of Modern Web Design from Wireframes to Style Guide | Udemy",
        "children": [
            "Good knowledge of Adobe Photoshop CC"
        ]
    },
    {
        "parent": "Web Design in Affinity Designer Masterclass | Udemy",
        "children": [
            "I will need Affinity Designer installed on my computer."
        ]
    },
    {
        "parent": "Demystifying Parallax: Learn to Create Interactive Web Pages | Udemy",
        "children": [
            "A basic knowledge of HTML, CSS &amp; JavaScript",
            "A code editor like Sublime Text or Visual Studio Code"
        ]
    },
    {
        "parent": "WYSIWYG Web Builder Layout Grid Essential Training | Udemy",
        "children": [
            "A Computer/Laptop",
            "A working Internet Connection",
            "A little bit knowledge about using WYSIWYG web Builder",
            "WYSIWYG Web Builder version 12+ or 14+",
            "A localhost server that supports php(WAMP, XAMPP, MAMP)"
        ]
    },
    {
        "parent": "Top Web Design Courses Online - Updated [November 2020] | Udemy",
        "children": []
    },
    {
        "parent": "Parallax Slider Design | Udemy",
        "children": [
            "Basic Photoshop skills",
            "Basic understanding of WordPress or Joomla",
            "Necessary to purchase slider plug-in with parallax feature for WordPress or Joomla site to finish course"
        ]
    },
    {
        "parent": "Web Design | Udemy",
        "children": [
            "Students must have DSL Connection",
            "Desktop, Laptop or Mobile Device"
        ]
    },
    {
        "parent": "SketchApp Animation Prototype - Intermediate | Udemy",
        "children": [
            "SketchApp, Anima Sketch Plugin, Intermediate or Practicing Designers."
        ]
    },
    {
        "parent": "CIW Web Foundations Associate certification practice exams | Udemy",
        "children": []
    },
    {
        "parent": "Scrollytelling 2020 - Web Design for Storytelling | Udemy",
        "children": [
            "Knowledge of basic HTML and JavaScript"
        ]
    },
    {
        "parent": "Preparation for Web Design Interview Test and Tips | Udemy",
        "children": []
    },
    {
        "parent": "WordPress Theme Development with Bootstrap | Udemy",
        "children": [
            "Have a basic understanding of HTML, CSS and PHP (all courses I offer)",
            "Have access to a code editor, free or otherwise. I suggest Coda 2, as that's the editor I use exclusively.",
            "An Internet connection is required.",
            "A fresh copy of Bootstrap and WordPress (we will go over this in the beginning of the course).",
            "Download &amp; Install MAMP (or alternatives — we cover this in the course)",
            "Your favourite drink."
        ]
    },
    {
        "parent": "SEO For WordPress [Expert]: #1 Step-by-Step SEO Blueprint | Udemy",
        "children": [
            "You should already be familiar with WordPress, basic on-page SEO strategies, and/or taken our beginners SEO course first."
        ]
    },
    {
        "parent": "Complete WordPress Theme Development Course for Developers | Udemy",
        "children": [
            "WordPress",
            "HTML",
            "CSS",
            "FTP Software e.g Filezilla, Notepad ++"
        ]
    },
    {
        "parent": "WordPress Intermediate Skills: WordPress for Web Developers | Udemy",
        "children": [
            "You should be able to use WordPress to build a website, and want to learn more."
        ]
    },
    {
        "parent": "Advanced WordPress Gutenberg Blocks, Post Types & Taxonomies | Udemy",
        "children": [
            "Have a Local WordPress installation i will be using MAMP, but you can use WAMP, XAMPP, Vagrant or Bitnami, you will be fine :)",
            "A Text Editor, i will be using Atom, but sublime text, brackets, or any other also works! Visual Studio Code is also free and available for Windows, Mac or Linux",
            "Basic WordPress Development experience, if you know how to write a WP_Query and what's the loop you will be fine!"
        ]
    },
    {
        "parent": "How To Make a Wordpress WooCommerce Amazon Affiliate Store | Udemy",
        "children": [
            "A good understanding of Wordpress CMS",
            "Registering a domain and getting it hosted",
            "Be able to apply to become an Amazon Affiliate (Some States do not allow this)",
            "Google Drive",
            "Evernote "
        ]
    },
    {
        "parent": "WordPress REST API Complete Beginners Guide | Udemy",
        "children": [
            "Basic HTML - Know how to build a simple HTML page and work with HTML forms.",
            "Basic CSS - Know how to responsively style HTML pages with CSS.",
            "Basic JS - Know basic syntax, DOM and events.",
            "Basics WordPress Development (Check Out  My Other Course)"
        ]
    },
    {
        "parent": "Building WordPress Themes: The Step-by-Step Guide | Udemy",
        "children": [
            "Basic knowledge of HTML &amp; CSS. If you know that HTML provides the structure and CSS is for adding design, you are ready to learn WordPress Theming.",
            "Some fundamental PHP: variables, data types, functions and scope. Bonus if you know about classes and objects.",
            "How to use WordPress. Perhaps you've never created your own theme or plugin, but you definitely know your way around the admin. You know how to add content and widgets, install themes and plugins, and modify menus."
        ]
    },
    {
        "parent": "Wordpress for Web Development | Udemy",
        "children": [
            "No web development or design knowledge is required",
            "Windows, Mac, or Linux Machine"
        ]
    },
    {
        "parent": "Optimizing Wordpress for More Speed and Revenue | Udemy",
        "children": [
            "Basic WordPress and CMS knowledge"
        ]
    },
    {
        "parent": "Blogging & Affiliate Mastery in 2020 [ HINDI ] | Udemy",
        "children": [
            "Internet , Laptop/computer to practice"
        ]
    },
    {
        "parent": "Create MLM Website - Multi Level Marketing Website WordPress | Udemy",
        "children": [
            "Basic Computer Knowledge"
        ]
    },
    {
        "parent": "Git for WordPress Developers | Udemy",
        "children": [
            "A basic understanding of WordPress development",
            "A development enviroment with a functioning WordPress installation"
        ]
    },
    {
        "parent": "How to Safely Copy and Move Your WordPress Website | Udemy",
        "children": [
            "A website built using the latest stable release of WordPress, hosted on a webserver or on your own local machine (NOT wordpress.com)",
            "Any FTP client (e.g. Cyberduck, FileZilla)",
            "Some basic computer skills (cutting and pasting text, saving files into folders)",
            "Familiarity with the WordPress interface",
            "A desire to learn!"
        ]
    },
    {
        "parent": "WordPress Web Design and Advanced Theme Development | Udemy",
        "children": [
            "You should have good command of English language",
            "You should know basic HTML and CSS",
            "You need the below listed Software'",
            "Adobe Photoshop CS3 | CS5 | CC  (Any of these version will do )",
            "Adobe Fireworks  (Optional as you can use Adobe Photoshop to do all the designing work )",
            "Adobe Brackets",
            "XAMPP Web Server",
            "WordPress Software"
        ]
    },
    {
        "parent": "Design Patterns in Java for Engineers, Designers, and Architects | Udemy",
        "children": [
            "Good understanding of Java",
            "Familiarity with latest Java features",
            "Good understanding of object-oriented design principles",
            "A computer with the latest JDK and (hopefully) an IDE"
        ]
    },
    {
        "parent": "Full Stack Development Using Spring Boot Angular and React | Udemy",
        "children": [
            "Knowledge of Spring Framework and Spring Boot",
            "Or Should have completed my Spring Framework in easy steps course"
        ]
    },
    {
        "parent": "Java for complete beginners | Learn core java using IntelliJ | Udemy",
        "children": [
            "A computer with internet connection to install java and Intellij",
            "Prepare yourself to do hands on programming"
        ]
    },
    {
        "parent": "Advanced Java Programming | Udemy",
        "children": [
            "The desire to be an \"A Level\" programmer"
        ]
    },
    {
        "parent": "Learn TDD in Java | Udemy",
        "children": [
            "A good basic understanding of Java",
            "IntelliJ IDE (available free from http://cjiq.co/intellij)"
        ]
    },
    {
        "parent": "What's New in Java 9 - Modules and More! | Udemy",
        "children": [
            "It's desirable to have some knowledge of Java, or another object oriented language"
        ]
    },
    {
        "parent": "Java Spring Security | Udemy",
        "children": [
            "You should already be familiar with the Java programming language... a minimum of an intermediate level of core Java is ideal",
            "It would also be beneficial to understand the MVC design pattern before attempting this course",
            "Working knowledge of the Spring Framework",
            "Knowledge of Maven is also a nice to have, but not mandatory",
            "An understanding of web applications, including deployment of web apps and server is required"
        ]
    },
    {
        "parent": "Java Web Development Under The Hood | Udemy",
        "children": [
            "You should have some basic experience in programming with the Java programming language.",
            "You should have installed and working a Java Development Kit (JDK) and a suitable IDE, such as Eclipse or IntelliJ",
            "No prior knowledge of web development is needed."
        ]
    },
    {
        "parent": "Java/Apache Maven: The Truth About Building Java Programs | Udemy",
        "children": [
            "Some previous experience of Maven is needed; either through my course 'Maven :101 Stop Building Java Programs the Hard Way!' or hands on experience",
            "Some knowledge of the Eclipse IDE is required, as Eclipse integration with Maven is used",
            "Some knowledge of the Java development language is required",
            "All software needed for the source is available Free online for download, so internet connection is required",
            "All Source code for the course is available for download in the 'Resources area'"
        ]
    },
    {
        "parent": "Spring Professional Certification Exam Tutorial - Module 01 | Udemy",
        "children": [
            "Java",
            "Maven",
            "IDE of your choice"
        ]
    },
    {
        "parent": "Advanced Java programming with JavaFx: Write an email client | Udemy",
        "children": [
            "Knowledge of the Java programming language",
            "Familiar with an IDE",
            "Basic knowledge of HTML(desired, not required)",
            "Time and patience"
        ]
    },
    {
        "parent": "Java 8 - Beyond the Basics | Udemy",
        "children": [
            "a fundamental understanding of Java syntax and data operations",
            "Java 8 and Eclipse 4.4 or later"
        ]
    },
    {
        "parent": "Learn Java by building 17 projects step by step | Udemy",
        "children": [
            "You should be able to use a PC at a beginner level"
        ]
    },
    {
        "parent": "Get your Java dream job! Middle level Interview preparation | Udemy",
        "children": [
            "Basic knowledge in Java",
            "Basic knowledge in Eclipse IDE"
        ]
    },
    {
        "parent": "Lambda with Functional Programming in Java8 | Udemy",
        "children": [
            "You should have basic knowledge about core java and generics[Collection]"
        ]
    },
    {
        "parent": "Professional Web Scraping with Java | Udemy",
        "children": [
            "You should already be familiar with Java and Maven at a basic to medium level (the course will not show you how to setup Java, Maven or an IDE)",
            "You should be familiar with HTML/CSS and know how to use your browser's developer tools",
            "You should know about CSS selectors, though we use them for scraping static web pages",
            "Prior knowledge of jQuery helps you getting started faster with Jsoup, though this is not required",
            "You should know what a web API and AJAX is (basic level is enough)"
        ]
    },
    {
        "parent": "Python Django Dev To Deployment | Udemy",
        "children": [
            "Basic web development (HTML, Basic Programming fundamentals)"
        ]
    },
    {
        "parent": "Django Core | A Reference Guide to Core Django Concepts | Udemy",
        "children": [
            "Try Django 1.8 &amp; Up (suggested course is Try Django 1.9 as it has Try Django 1.8 too)",
            "Python knowledge is a plus (30 Days of Python is a suggested course)"
        ]
    },
    {
        "parent": "Tweetme | Build a Twitter-like app step by step with Django | Udemy",
        "children": [
            "Try Django 1.8 &amp; Up (our courses)",
            "30 Days of Python (not required but highly recommended)"
        ]
    },
    {
        "parent": "Django by Example | Udemy",
        "children": [
            "Some basic knowledge of Python, HTML, and JavaScript is recommended.",
            "This is an easy-to-follow video to help you build four different production-ready Django projects. Each project focuses on a particular area of the framework and each topic within the projects is explained with practical examples and includes best practice recommendations."
        ]
    },
    {
        "parent": "Django + AngularJS for a Powerful Web Application | Udemy",
        "children": [
            "Try Django 1.9 (our course;  see Requirements video)",
            "Advancing the Blog  (optional;  see Requirements video)",
            "Blog API with Django Rest Framework  (our course;  see Requirements video)",
            "Try AngularJS 1.5  (our course;  see Requirements video)"
        ]
    },
    {
        "parent": "Projects in Django: Learn Django Building Projects | Udemy",
        "children": [
            "Basic Knowledge of Python is required for the course",
            "Basic Knowledge of HTML, CSS and JavaScript is assumed by the author"
        ]
    },
    {
        "parent": "Building Movies Site With Python & Django - IMDB Clone | Udemy",
        "children": [
            "A computer with an internet connection"
        ]
    },
    {
        "parent": "How To Push Django Python Apps To Heroku for Web Hosting | Udemy",
        "children": [
            "No programming skills or special tools are necessary to take this course but intro knowledge of Django and Python would be helpful",
            "You just need a computer with Internet access and a Web Browser"
        ]
    },
    {
        "parent": "Learning Path: Django: Modern Web Development with Django | Udemy",
        "children": [
            "Familiarity with HTML, CSS, and JavaScript is needed",
            "Working knowledge on Python is a must. Basic knowledge on RESTful APIs would be useful."
        ]
    },
    {
        "parent": "Django | Create a Complete Website | Udemy",
        "children": [
            "Intermediate understanding of Python",
            "Basic MVC concept",
            "Basic understanding of Object Oriented Programming",
            "Basic Html &amp; templates"
        ]
    },
    {
        "parent": "Serverless Django with Docker & Google Cloud Run | Udemy",
        "children": [
            "Django Experience (At least our Try Django series)",
            "Python Experience (At least the first 15 days of 30 Days of Python)",
            "Google Account (ie, Gmail)"
        ]
    },
    {
        "parent": "Mastering Django Web Development | Udemy",
        "children": [
            "Fine-tune your knowledge of Django with the help of these bite-size videos that will take you through the advanced concepts of this technology coupled with a practical implementation. "
        ]
    },
    {
        "parent": "Advanced Web Development with Django | Udemy",
        "children": [
            "Intermediate knowledge of Python and Django is preferred."
        ]
    },
    {
        "parent": "Complete Python Django Single-Page App [The FUTURE] | Udemy",
        "children": [
            "Developer must have experience with Building Python DJANGO  application",
            "Developer should have basic knowledge: How django application works",
            "Developer should have experience in Python",
            "Good Experience with jQuery is preferable"
        ]
    },
    {
        "parent": "Web Software Development with Django | Game Store App | Udemy",
        "children": [
            "Be able to write and understand basic object oriented Python code",
            "Be familiar with very basics of HTML and CSS.",
            "Be familiar with the basics of how HTTP protocol and Web work",
            "Be comfortable working with text editor and command line tools",
            "Familiarity with the basics of relational database concepts like SQL is beneficial",
            "Some basic understanding of what a version control is. Knowing how to use it is not necessary for this course."
        ]
    },
    {
        "parent": "Bootstrap Real-time Project in Just 3 hr - From Scratch | Udemy",
        "children": [
            "Bootstrap 3 knowledge is not required",
            "Having basic knowledge of HTML and CSS"
        ]
    },
    {
        "parent": "Create a Responsive Website with Bootstrap 3 | Udemy",
        "children": [
            "Prerequisites include a foundation of creating basic websites, an understanding of HTML/CSS familiarity, and basic web concepts."
        ]
    },
    {
        "parent": "Building a Responsive Application with Bootstrap | Udemy",
        "children": [
            "This course is also for developers looking to upgrade their existing application to Bootstrap 4."
        ]
    },
    {
        "parent": "PSD to WordPress: Create Responsive Website Using Bootstrap4 | Udemy",
        "children": [
            "Wordpress and CSS basic knowledge."
        ]
    },
    {
        "parent": "Learning Path: Bootstrap 4 Application Development | Udemy",
        "children": [
            "Familiarity with HTML, CSS, as well as creating and editing files is required."
        ]
    },
    {
        "parent": "Learning Path: Frontend Web Development with Bootstrap 4 | Udemy",
        "children": [
            "Basic HTML and CSS knowledge is required. Having basic knowledge of Bootstrap will be beneficial."
        ]
    },
    {
        "parent": "Mastering Bootstrap 4 | Udemy",
        "children": [
            "This video course is for intermediate-level front-end web developers with a firm grasp on the basics of Bootstrap, as well as HTML, JavaScript, and CSS. The course dives deep into the various components of Bootstrap, and will teach you to harness its power to build engaging and beautiful websites."
        ]
    },
    {
        "parent": "LEARNING PATH: Real-World Apps with Angular 2 & Bootstrap 4 | Udemy",
        "children": [
            "Working knowledge of HTML, CSS, and JavaScript is needed",
            "Prior experience in building web apps is essential."
        ]
    },
    {
        "parent": "Build a Penpals web application with Django 3 | Udemy",
        "children": [
            "Basic concepts of python and Django",
            "Familiarity with Bootstrap 4, CSS , HTML is preferable but not required"
        ]
    },
    {
        "parent": "HTML5 Essentials for Beginners | Udemy",
        "children": [
            "A text editor and a passion for learning."
        ]
    },
    {
        "parent": "Projects in HTML5 | Udemy",
        "children": [
            "Student must have knowledge of HTML and JavaScript"
        ]
    },
    {
        "parent": "Master HTML:5 from very beginner to Pro | Udemy",
        "children": [
            "There is no prerequisites for this course. We just need your enthusiasm."
        ]
    },
    {
        "parent": "HTML5 Game Development : Beginner to Pro | Udemy",
        "children": [
            "Basic knowledge of setting up a website.",
            "A text editor, Brackets (free) is recommended.",
            "A basic knowledge of HTML and javascript is assumed."
        ]
    },
    {
        "parent": "Creating Interactive HTML5 Video | Udemy",
        "children": [
            "Basic understanding of HTML",
            "Basic understanding of CSS",
            "Basic understanding of JavaScript",
            "Basic understanding of jQuery"
        ]
    },
    {
        "parent": "HTML5 for Mobile Devices | Udemy",
        "children": [
            "Successful students should know some fundamental HTML"
        ]
    },
    {
        "parent": "Mastering HTML5 Canvas | Udemy",
        "children": [
            "The video course does not assume any previous know how in graphic design or HTML5 Canvas."
        ]
    },
    {
        "parent": "Track Any HTML5 Content with Custom SCORM | Udemy",
        "children": [
            "Basic JavaScript",
            "Familiar with Learning Management Systems (LMS)"
        ]
    },
    {
        "parent": "MTA 98-375 HTML5 Application Development Fundamentals | Udemy",
        "children": []
    },
    {
        "parent": "Advanced HTML5 in Action: Build 5 Advanced HTML5 Web Apps | Udemy",
        "children": [
            "Basic knowledge of HTML, CSS, JavaScript and jQuery"
        ]
    },
    {
        "parent": "HTML5 Networking with GameMaker Studio | Udemy",
        "children": [
            "You will need to know basic coding for GameMaker Studio",
            "You will need to have a copy of GameMaker Studio",
            "You must have the HTML5 module for GameMaker Studio or GameMaker Studio Master Collection"
        ]
    },
    {
        "parent": "HTML5 Canvas Projects | Udemy",
        "children": [
            "HTML and JavaScript familiarity.",
            "Understand DOM events."
        ]
    },
    {
        "parent": "Redux in Angular (2 and 4+) | Udemy",
        "children": [
            "At least 3 months experience with Angular 2 or higher"
        ]
    },
    {
        "parent": "Learn basics of Redux in React Native in 2 hours! | Udemy",
        "children": [
            "You should be able to use vanilla React Native at beginner level"
        ]
    },
    {
        "parent": "Mastering Redux with React | Udemy",
        "children": [
            "You should have a solid knowledge of React",
            "You should be familiar with create-react-app"
        ]
    },
    {
        "parent": "Redux with React JS: Learn Redux with Modern React JS | Udemy",
        "children": [
            "This course is ideal for people who have a basic knowledge of HTML, CSS, JavaScript and React JS",
            "Desire to learn Redux",
            "Computer with access to the internet",
            "Nothing else! It’s just you, your computer and your ambition to get started today",
            "LIFETIME ACCESS, course updates, new content, anytime, anywhere, on any device"
        ]
    },
    {
        "parent": "Build an e-learning website using React and Redux | Udemy",
        "children": [
            "knowledge of React and Redux",
            "knowledge of Javascript ES6",
            "knowledge of Jquery and Bootstrap",
            "knowledge of Mongo DB and Mongoose"
        ]
    },
    {
        "parent": "Redux – End to End | Udemy",
        "children": [
            "Working knowledge of JavaScript is a must. Familiarity with data binding on the front end and object relational management on the back end are strongly recommended. Our project starts from scratch, but it moves along quickly and does not dwell on the basics."
        ]
    },
    {
        "parent": "Intermediate Coders: Use JavaScript to Make Web Apps and Art | Udemy",
        "children": [
            "Basic understanding of HTML, CSS and JavaScript is highly helpful. To get a fast introduction, enroll in our \"Kids Coding -Introduction to HTML, CSS and JavaScript\" course.",
            "An Internet connection to follow along in the free text editor JS Bin.",
            "No SVG knowledge is required.",
            "Illustrator CC or another graphic editing software",
            "Modern web browser",
            "This course was recorded on a Mac computer, but you can use a PC."
        ]
    },
    {
        "parent": "Universal JavaScript with React, Node, and Redux | Udemy",
        "children": [
            "This course has the following software requirements:",
            "An editor like Atom, Sublime Text or Visual Studio Code",
            "NodeJS - Version 6_10 XX LTS",
            "React - Version 15.4",
            "Redux - Version 3.6"
        ]
    },
    {
        "parent": "Learning Path: High-Performance React With Redux | Udemy",
        "children": [
            "Requires basic knowledge of JS and experience with React."
        ]
    },
    {
        "parent": "Build a Real-world App with ASP.NET Core and Angular 2 (4+) | Udemy",
        "children": [
            "At least 3 months experience with ASP.NET MVC 5, Entity Framework 6 and Angular 2"
        ]
    },
    {
        "parent": "Testing Angular 4 (previously Angular 2) Apps with Jasmine | Udemy",
        "children": [
            "Familiarity with the fundamentals of Angular (Angular 2+)"
        ]
    },
    {
        "parent": "Angular Styling & Animations (for Angular 2+) | Udemy",
        "children": [
            "Basic Angular (2 or 4) knowledge is required",
            "Basic CSS knowledge is required",
            "Basic CSS Transitions &amp; Animations knowledge is a plus",
            "No Angular Animations knowledge is required"
        ]
    },
    {
        "parent": "Angular 2 + Rails 5 Bootcamp | Udemy",
        "children": [
            "A basic knowledge of Ruby on Rails",
            "Access to a Mac or Linux computer (or online IDE such as C9)"
        ]
    },
    {
        "parent": "Angular Advanced MasterClass & FREE E-Book | Udemy",
        "children": [
            "Basic knowledge of Angular",
            "Typescript"
        ]
    },
    {
        "parent": "Angular and Node.js Integration | Udemy",
        "children": [
            "Angular &amp; NodeJS"
        ]
    },
    {
        "parent": "Angular - Concepts, Code and Collective Wisdom | Udemy",
        "children": [
            "You should have some JavaScript experience",
            "Typescript, ES2015, and AngularJS knowledge is not required"
        ]
    },
    {
        "parent": "Angular 8 hands on for Java Developers | Udemy",
        "children": [
            "At least basic experience in programming in Java is essential for this course",
            "Angular is taught with reference to basic knowledge of Java syntax, programming structures and libraries",
            "Some experience of developing websites or rest APIs in Spring Boot is helpful but not critical"
        ]
    },
    {
        "parent": "Angular Components - like a Pro! (Angular 2/4/5/6/7+) | Udemy",
        "children": [
            "Basic knowledge of Angular (angular 2 or 4): have been playing with a couple tutorials",
            "Basic knowledge of TypeScript (what you'll have learned with Angular)",
            "Basic knowledge of Javascript ES6 (classes and arrow functions)",
            "Basic knowledge of HTML",
            "Basic knowledge of CSS",
            "Very basic knowledge of GIT"
        ]
    },
    {
        "parent": "Angular 7, 8 and 9 Drag N Drop Feature With Highcharts | Udemy",
        "children": [
            "Developers/Students must know Angular 5/6 along with Typescript. They should have basic knowledge of Bootstrap Framework 3/4. They should have an introductory knowledge of Webpack bundling system.",
            "From Angular they should know Single Page Application, Component Development, HttpClient Services, Lazy Loading, Routing etc."
        ]
    },
    {
        "parent": "Angular + TypeScript from Basic to Advanced + Live Project | Udemy",
        "children": [
            "Basic Knowledge on JavaScript is essential. Visual Studio Code or any other IDE of your choice.",
            "You don't need to familiar with Angular 1"
        ]
    },
    {
        "parent": "Build Angular apps with Firebase and Angular Material | Udemy",
        "children": [
            "Knowledge of HTML, CSS and JavaScript is required",
            "Previous experience with Angular 2+  and/or JavaScript frameworks"
        ]
    },
    {
        "parent": "Angular 8 Real World WebApp Development w/ Node.js & MariaDB | Udemy",
        "children": [
            "Basic experience with Angular and NodeJs is preferable",
            "Familiarity with HTML, CSS and JavaScript basics is also recommended",
            "To publish your web application with IISNode you need a Windows Server with IIS"
        ]
    },
    {
        "parent": "The Advanced Web Developer Bootcamp | Udemy",
        "children": [
            "Have a basic understanding of HTML and CSS",
            "Have a fundamental understanding of JavaScript - how to create variables, use conditional logic, looping, objects, arrays and functions",
            "Prepare to build real web apps with the latest JavaScript technologies!"
        ]
    },
    {
        "parent": "Junior to Senior Web Developer Roadmap: Development Training | Udemy",
        "children": [
            "Basic understanding of HTML, CSS, and Javascript",
            "Prepare to learn real life skills and build real web apps that will get you hired",
            "Completion of \"The Complete Web Developer in 2021: Zero to Mastery\" is a bonus but not necessary"
        ]
    },
    {
        "parent": "Responsive Web & Mobile Development in HTML,CSS & Javascript | Udemy",
        "children": [
            "Individuals with passion to learn web development"
        ]
    },
    {
        "parent": "Full stack Universal React with Redux, Node js and MongoDB | Udemy",
        "children": [
            "Basic knowledge of NodeJs-Express",
            "Basic knowledge of HTML",
            "Basic knowledge of Javascript",
            "Understanding of \"state\" and \"props\" in React"
        ]
    },
    {
        "parent": "Customizing AppGini web applications | Udemy",
        "children": [
            "Install AppGini Professional Edition. There are other programs and utilities needed (all are free or opensource), but we'll cover them in the course."
        ]
    },
    {
        "parent": "2019 Calendar App: Let's Build It! | Udemy",
        "children": [
            "Know Basic HTML, CSS &amp; Javascript"
        ]
    },
    {
        "parent": "2-Second Website Speed Optimization In 1 Day - Technical SEO | Udemy",
        "children": [
            "Be able to yourself or have your developer or website hosting tech support make edits to your site",
            "Be ready for more user engagement and sales"
        ]
    },
    {
        "parent": "Build Online Dating Website from scratch till deployment | Udemy",
        "children": [
            "Laptop or computer",
            "Wifi",
            "Internet connection"
        ]
    },
    {
        "parent": "Make A Responsive Website From Scratch: Javascript and HTML | Udemy",
        "children": [
            "A solid foundation in HTML(e.g. recognize what &lt;section&gt;&lt;/section&gt; means)",
            "A solid foundation in CSS(e.g. know the difference between position: relative and position: absolute)",
            "Some prior exposure to Javascript and JQuery",
            "You will be required to download JQuery and Google Maps for this course. Both of these are available free. Although I have included these files in the source code, I suggest you also learn to download them yourself so you will know where to get the correct files for future projects"
        ]
    },
    {
        "parent": "Create a Drag & Drop File Uploader For Websites | Udemy",
        "children": [
            "A free code editor",
            "Access to a server"
        ]
    },
    {
        "parent": "Advance Chat System using PHP | Udemy",
        "children": [
            "Student should have knowledge in PHP, MySQL, CSS, HTML, Jquery, Javascript, and Ajax"
        ]
    },
    {
        "parent": "Make A Responsive Website Project #1: CSS, HTML & Javascript | Udemy",
        "children": [
            "A solid foundation in HTML(e.g. recognize what &lt;section&gt;&lt;/section&gt; means)",
            "A solid foundation in CSS(e.g. know the difference between position: relative and position: absolute)",
            "Some prior exposure to Javascript and JQuery",
            "You will be required to download JQuery, Bootstrap and Animate(dot)css. All of of these are available free and no sign ups are required. Although I have included all of those files in the source code, I suggest you also to learn where to download them yourself as well."
        ]
    },
    {
        "parent": "Advanced Backend Web Development | Udemy",
        "children": [
            "Introduction to JavaScript Development",
            "Intermediate JavaScript Development",
            "Introduction to Node.js Development",
            "Advanced JavaScript Development",
            "Advanced Node.js Development"
        ]
    },
    {
        "parent": "Build a Website / Blog in 3 Days With No Tech Training | Udemy",
        "children": [
            "A comfortable level of browsing the internet and using social media",
            "A web browser",
            "A knowledge of wordpress will help but not essential"
        ]
    },
    {
        "parent": "Nuxt.js - Vue.js for Server-Side Rendering and Folder Based Config | Udemy",
        "children": [
            "Vuejs knowledge is required, though you don't need to be an expert at all",
            "That's actually all, you'll learn the rest in the course :)"
        ]
    },
    {
        "parent": "Laravel API Development & Vue JS SPA from Scratch | Udemy",
        "children": [
            "Working Knowledge of PHP, Laravel, JavaScript &amp; Vue",
            "Local Development Environment"
        ]
    },
    {
        "parent": "Learn by Doing: Vue JS 2.0 the Right Way | Udemy",
        "children": [
            "HTML/CSS (Bootstrap Framework)",
            "Some knowledge of JavaScript (the more you know the easier this will be for you!)",
            "Recommended (NOT required): Basic Understanding of Client-Server Communication (HTTP protocol)"
        ]
    },
    {
        "parent": "Real Time Single Page Forum App with Pusher Laravel & vuejs | Udemy",
        "children": [
            "You should have knowledge of Laravel and Vuejs Basics, that will make you understand things more easily."
        ]
    },
    {
        "parent": "The Ultimate Advanced Laravel Pro course (incl Vuejs) | Udemy",
        "children": [
            "You should have the basics of php object oriented programming",
            "You should have the basics of the laravel framework",
            "You should have the very basics of the Vuejs framework"
        ]
    },
    {
        "parent": "Vue JS and Firebase:Build an iOS and Android chat app (2020) | Udemy",
        "children": [
            "Basic VueJS knowledge is required",
            "ES6 knowledge is an advantage",
            "A basic understanding of HTML, CSS &amp; JavaScript"
        ]
    },
    {
        "parent": "2019 build a translate online app with vue js | Udemy",
        "children": [
            "You need to know basic knowledge of Vue"
        ]
    },
    {
        "parent": "Reactive web applications with Vert.x and Vue.js | Udemy",
        "children": [
            "Basic Java 8 Knowlege",
            "Know how to read Lambdas"
        ]
    },
    {
        "parent": "2019 build a Todo app with vue js | Udemy",
        "children": [
            "You need to know the basic knowledge of Vue"
        ]
    },
    {
        "parent": "Build 7 Real World Applications with Vue.js | Udemy",
        "children": [
            "Basic prior knowledge of JavaScript programming, Vue .js is required &amp; web development is required."
        ]
    },
    {
        "parent": "2020 Build an app like tiktok using vue js | Udemy",
        "children": [
            "You need some basic knowledge about vuejs"
        ]
    },
    {
        "parent": "Vue JS 3: The Composition API | Udemy",
        "children": [
            "Modern JavaScript",
            "Some Vue 2 experience will be a plus!"
        ]
    },
    {
        "parent": "Real World Projects with Vue.js | Udemy",
        "children": [
            "Should have some knowledge of JavaScript programming; a working knowledge of Vue .js is required. Also need to have a basic knowledge of Web development."
        ]
    },
    {
        "parent": "Advanced Form Component with VueJs | Udemy",
        "children": [
            "Good understanding of JavaScript",
            "Basic understanding of what VueJs components are",
            "Working knowledge of Css / Sass / Html"
        ]
    },
    {
        "parent": "Practical Vue.js from Scratch to Troubleshoot | Udemy",
        "children": [
            "A basic understanding of HTML, CSS, and JavaScript is required.",
            "Some experience with Angular. js or React is a bonus, but not required."
        ]
    },
    {
        "parent": "Beginning Fortran for Science and Engineering Students | Udemy",
        "children": [
            "Must have access to a computer.  DOS or Linux command line processing abilities would be useful but not absolutely necessary.",
            "Previous experience with a programming language is also helpful but not necessary."
        ]
    },
    {
        "parent": "Building an Interpreter from scratch | Udemy",
        "children": [
            "Basic data structures and algorithms",
            "Graphs, trees, traversal"
        ]
    },
    {
        "parent": "Core SAP ABAP Programming | Udemy",
        "children": [
            "passion to develop Programming Skills, not just ABAP",
            "Access to an SAP system is required for hands on practice"
        ]
    },
    {
        "parent": "Learn Visual Basic dot net for advanced | Udemy",
        "children": [
            "You should use PC at all levels + complete of level 2 of the course."
        ]
    },
    {
        "parent": "Text Programming for VEX IQ (RobotC) | Udemy",
        "children": [
            "A PC and a VEX IQ robotics kit"
        ]
    },
    {
        "parent": "Coding in Quarantine B: Building a Community | Udemy",
        "children": [
            "Be able to connect to the internet",
            "Have a keyboard to type with"
        ]
    },
    {
        "parent": "Learn Python & Data Analysis From Scratch | Udemy",
        "children": [
            "NO prior knowledge"
        ]
    },
    {
        "parent": "Secure Coding Bootcamp - Part 2 | Udemy",
        "children": [
            "Basic coding experience"
        ]
    },
    {
        "parent": "Coding in Quarantine B: Sandboxes and Design | Udemy",
        "children": [
            "Be able to connect to the internet",
            "Have a keyboard to type with"
        ]
    },
    {
        "parent": "C Programming FromZero To Hero | Udemy",
        "children": [
            "NO , YOU ONLY NEED IS EAGER TO LEARN  PROGRAMMING"
        ]
    },
    {
        "parent": "Master coding by doing with JS, HTML & CSS. | Udemy",
        "children": [
            "No prerequisites for this course it starts from a beginner level."
        ]
    },
    {
        "parent": "Free Programming Fundamentals Tutorial - Spring Boot Tricks | Udemy",
        "children": []
    },
    {
        "parent": "Free Job Search Tutorial - Orientation to learning Programming Online And Getting Job | Udemy",
        "children": []
    },
    {
        "parent": "Free Programming Fundamentals Tutorial - Secure Coding Bootcamp - Part 1 | Udemy",
        "children": []
    },
    {
        "parent": "Just Express (with a bunch of node and http). In detail. | Udemy",
        "children": [
            "You have a working knowledge of JavaScript  (Not a ninja, but you should not be brand new).",
            "You have at least run a Nodejs program before. I will cover some basics, but this is NOT an intro to node class.",
            "You have basic command line knowledge (at least capable of navigating and running a program)",
            "You have a computer capable of running Nodejs."
        ]
    },
    {
        "parent": "Code with Node JS - 2020 | Udemy",
        "children": [
            "Recommended prerequisite: Colt Steele's, The Web Developer Bootcamp (or similar, e.g. freeCodeCamp)",
            "Understand the fundamentals of JavaScript (or similar programming language)",
            "Understand the fundamentals of HTML and CSS",
            "Understand the fundamentals of the Bootstrap design framework",
            "Understand the basics of Express JS"
        ]
    },
    {
        "parent": "Learn Express | Udemy",
        "children": [
            "A text editor installed on your workstation (Brackets, Sublime Text or IntelliJ are suggested)",
            "You need sufficient administration priveleges on your computer to install Node.js. If you can't, have your administrator install Node and let you install NPM modules before starting"
        ]
    },
    {
        "parent": "Complete Node.js REST API Masterclass | Udemy",
        "children": [
            "Having a Terminal and a Text Editor installed on your machine",
            "Having Postman installed on your machine",
            "Basics in NodeJS",
            "Basic - Intermediate understanding of ES6",
            "No experience with Express, MongoDB or other database required",
            "No experience with REST APIs required"
        ]
    },
    {
        "parent": "Learn NodeJS Typescript server with multiple deployment type | Udemy",
        "children": [
            "basic nodejs",
            "basic OOP concepts",
            "Typescript",
            "server architectures",
            "REST api concepts"
        ]
    },
    {
        "parent": "Learn Swagger and the Open API Specification | Udemy",
        "children": [
            "You should understand how REST APIs work",
            "You should be able to read and understand JSON",
            "If you need these skills, take my courses on JSON/XML and REST"
        ]
    },
    {
        "parent": "The Art of API Documentation | Udemy",
        "children": [
            "You should be familiar with APIs and how to document requests and responses (for web APIs) and classes and members (for platform APIs).",
            "Google Chrome is required for one of the exercises."
        ]
    },
    {
        "parent": "Complete Backend (API) Development with Python A-Z™ | Udemy",
        "children": [
            "You need to have basic programming skill",
            "You should be heard of what is cloud, backend and API"
        ]
    },
    {
        "parent": "Google Sheet Data API JSON AJAX | Udemy",
        "children": [
            "JavaScript HTML and CSS",
            "Web development skills",
            "Desire to Learn"
        ]
    },
    {
        "parent": "Building a RESTful API Application using Spring and Angular | Udemy",
        "children": [
            "Familiarity with Java, Spring Framework",
            "Familiarity with Angular",
            "Familiarity with web technologies (HTML, CSS, JavaScript)",
            "Familiarity with MySQL",
            "Knowledge of HTTP"
        ]
    },
    {
        "parent": "Learn real world API design in PHP using Apigility | Udemy",
        "children": [
            "PHP Syntax",
            "PHP Object Oriented programming",
            "Exception handling",
            "Web server technologies using PHP",
            "A general knowledge of continuous integration"
        ]
    },
    {
        "parent": "Rest API Testing using SoapUI | Real time Application | Udemy",
        "children": [
            "Windows machine with SoapUI free version"
        ]
    },
    {
        "parent": "Advanced Google Apps Script and API Calls | Udemy",
        "children": [
            "Gmail ID",
            "Familiar with basic working of Google Spreadsheet",
            "Has completed the course, or has knowledge of basic Google Apps Script"
        ]
    },
    {
        "parent": "Azure Platform as a Service–Web & APIApplication Deployment | Udemy",
        "children": [
            "A basic understanding of Microsoft Azure will be an added advantage."
        ]
    },
    {
        "parent": "API Blueprint - Design API Specs & Create Docs in Seconds | Udemy",
        "children": [
            "Basics of APIs "
        ]
    },
    {
        "parent": "How to Build Successful API Products? | Udemy",
        "children": [
            "Basic understanding of Digital Products",
            "How internet works"
        ]
    },
    {
        "parent": "API Blueprint Advanced - Creating Complex API Specs & Docs | Udemy",
        "children": [
            "Basics of RESTful APIs ",
            "Basics of API Blueprint"
        ]
    },
    {
        "parent": "REST API, Design, Test, Scale and Deploy | Udemy",
        "children": [
            "This course requires some basic programming experience in Java/Python. To do the exercises one requires Eclipse, Java or Python runtime environment.",
            "Requires an Amazon Web Services account if you want to practice Lambda and Deployment to Elastic Bean Stalk."
        ]
    },
    {
        "parent": "API Testing with Postman | Udemy",
        "children": [
            "We’ll discover the various aspects of APIs and how to think effectively about them from a quality viewpoint, then we’ll give you specific examples and challenges that will help you apply, learn, and fully understand the content. You’ll learn about APIs to actively immerse yourself in a learning experience that helps you take what you’ve learned and start to immediately benefit from it in your day-to-day work."
        ]
    },
    {
        "parent": "Deep Dive into API Gateway & Building Serverless Application | Udemy",
        "children": [
            "Previous Knowledge of Lambda required"
        ]
    },
    {
        "parent": "MERN Stack Front To Back: Full Stack React, Redux & Node.js | Udemy",
        "children": [
            "A good understanding of JavaScript &amp; ES6 Fundamentals",
            "React &amp; Node Basics"
        ]
    },
    {
        "parent": "Projects in MERN : Build Real World Apps Using MERN | Udemy",
        "children": [
            "Basic knolwedge of JavaScript is essential to complete this course",
            "Working knolwedge of Express React and Mongo DB is also important to understand the concepts"
        ]
    },
    {
        "parent": "MERN stack in action: How to set up | Udemy",
        "children": [
            "Basic knowledge about HTML, CSS, JS, ReactJS, NODEJS, EXPRESSJS, MONGODB"
        ]
    },
    {
        "parent": "Learn Typescript with React to Build Real-World Reactive Projects | Udemy",
        "children": [
            "Knowledge of JavaScript",
            "Experience with React",
            "Some experience with NextJS"
        ]
    },
    {
        "parent": "The Complete TypeScript Programming Guide for Web Developers | Udemy",
        "children": [
            "Student should have basic knowledge of HTML and JavaScript before taking this course"
        ]
    },
    {
        "parent": "Getting really good at JavaScript and TypeScript | Udemy",
        "children": [
            "Basic knowledge of JavaScript is required"
        ]
    },
    {
        "parent": "Isomorphic JavaScript with MEVN Stack | Udemy",
        "children": [
            "Basic Knowledge of JavaScript required."
        ]
    },
    {
        "parent": "Advanced Typescript programming with NodeJs and Webpack | Udemy",
        "children": [
            "Good programming level, either in JavaScript, or in Python, Java or C#",
            "Time and patience",
            "Basic HTML"
        ]
    },
    {
        "parent": "Mastering TypeScript - Second Edition | Udemy",
        "children": [
            "JavaScript developer aiming to learn TypeScript"
        ]
    },
    {
        "parent": "Mastering TypeScript Programming Techniques | Udemy",
        "children": [
            "It assumes that you have some programming experience in either JavaScript or a classical object-oriented language such as Java or C#. Junior programmers will be also able to use this course to take their career to the next level."
        ]
    },
    {
        "parent": "30+ Reasons Why Typescript? | Udemy",
        "children": [
            "Must have a good knowledge of ES5 [ECMA Script 5] and familiarity of ES5 Object Oriented features.",
            "Tools - Visual Studio Code or Sublime Text or Microsoft Visual Studio 2013 and above or your favourite tool."
        ]
    },
    {
        "parent": "Angular Fundamentals with TypeScript | Udemy",
        "children": [
            "Basic JavaScript knowledge is needed."
        ]
    },
    {
        "parent": "Building Web Applications with TypeScript, Angular & React | Udemy",
        "children": [
            "To easily grasp concepts that are explained in this course, you should know the basics of JavaScript."
        ]
    },
    {
        "parent": "TypeScript for JavaScript Developers | Udemy",
        "children": [
            "Pre-existing skills in JavaScript, and for anyone keen to add TypeScript to their skillset and get hands-on with both TypeScript and JavaScript."
        ]
    },
    {
        "parent": "Custom NodeJS package in Typescript with TDD | Udemy",
        "children": [
            "Basic knowledge of JavaScript",
            "Basic knowledge of NodeJS",
            "Basic knowledge of TDD - Test Driven Development"
        ]
    },
    {
        "parent": "Web Development with Angular, TypeScript, and React | Udemy",
        "children": [
            "This Learning Path is designed for web developers, who are well-versed in JavaScript and want to take their web development knowledge to the next level."
        ]
    },
    {
        "parent": "Real-World Projects with TypeScript 3 | Udemy",
        "children": [
            "Familiarity with TypeScript and want to maximize their skills and capabilities by creating real-world effective applications."
        ]
    },
    {
        "parent": "Free Typescript Tutorial - Typescript Tutorial - Learn TypeScript for Free | Udemy",
        "children": []
    },
    {
        "parent": "Create Interactive Web Applications with the R Shiny Package | Udemy",
        "children": [
            "Students should have some knowledge and use of R and RStudio"
        ]
    },
    {
        "parent": "Facebook Clone with Laravel, TDD, Vue & Tailwind CSS | Udemy",
        "children": [
            "Working Knowledge of PHP, Laravel, JavaScript &amp; Vue",
            "Have a Local Development Environment",
            "Know The Basics of Test-Driven Development",
            "Basic Project Deployment for a Modern PHP Application"
        ]
    },
    {
        "parent": "Create a MEAN App by Example - Full Stack Course | Udemy",
        "children": [
            "Understand HTML",
            "Understand CSS",
            "Basic understanding of Javascript",
            "Basic understanding of Angular"
        ]
    },
    {
        "parent": "VBA WEB - Connect Excel to the WEB with VBA | Udemy",
        "children": [
            "Basic knowledge of Microsoft Excel",
            "Basic knowledge of Excel VBA",
            "Basic knowledge of Web and HTML"
        ]
    },
    {
        "parent": "Building a Solid Web App Foundation with Vaadin 8 | Udemy",
        "children": [
            "You will require a Windows, Mac or Linux computer with access to the Code Editor like Atom or Sublime. If you wish to run programming examples, they are in Vaadin 8 Framework.",
            "Should use Vaadin 8  of software.  No special hardware needed.",
            "All instruction to install anything that we will need to install (Can be websites, other videos, written instructions)  Included in the setup video",
            "Make sure you have working internet access.",
            "How are the Exercise Files laid out? Code Samples/ Starting State of the Examples/ Finished State of the Examples/ Finished State per video/ Finished State per Chapter/ Finished State per course  The course focuses on teaching the basic concepts of component- and event-driven web application development. Practical demos of the concepts of layouting and navigation will give the viewers ability to support various end user device resolutions and types while building an application along the way.",
            "What level user would be best served by this course? For example: \"Beginner Django User but Advanced Web Designer\"  This course is intended for developers striving for efficiency and high-quality UI’s with Vaadin Framework. Full-stack developers working with Java on both frontend and backend systems and who want to efficiently utilize Java in their User Interfaces.",
            "Architects responsible for the overall system structure, need to understand the app foundation on which the server-driven User Interface will function and Backend Integration, as well as Developers looking to provide the best backend integration compatibility for their new User Interface, in order to connect UIs seamlessly with their backend solution, will greatly benefit from this tutorial."
        ]
    },
    {
        "parent": "ML Web Apps to Change the World - Predicting Life Expectancy | Udemy",
        "children": [
            "You should know some Python and HTML and have an interest in building web applications"
        ]
    },
    {
        "parent": "Web App Optimization with JavaScript | Udemy",
        "children": [
            "MAC or PC"
        ]
    },
    {
        "parent": "Creating a Web App for iPad | Udemy",
        "children": [
            "Text Editor",
            "Web-kit Browser"
        ]
    },
    {
        "parent": "Progressive Web Application Development | Udemy",
        "children": [
            "A basic knowledge of HTML and CSS will be useful, but is not mandatory"
        ]
    },
    {
        "parent": "OpenUI5 from the beginning to the complex app | Udemy",
        "children": [
            "js, html, json, ajax"
        ]
    },
    {
        "parent": "Building Web Applications using Django Framework | Udemy",
        "children": [
            "Knowledge of Python Language",
            "Basics of HTML, CSS and JavaScript",
            "Elementary knowledge of Database System and SQL"
        ]
    },
    {
        "parent": "Building an end-to-end Single Page Web Application | Udemy",
        "children": [
            "Should be able to write Java classes, Servlets, JavaScript, HTML, CSS and SQL",
            "Download and install Eclipse, Tomcat and MySQL to practice the course"
        ]
    },
    {
        "parent": "The Complete Guide to Django REST Framework and Vue JS | Udemy",
        "children": [
            "Familiarity with Python 3 and Django",
            "Basic knowledge of JavaScript, HTML, CSS"
        ]
    },
    {
        "parent": "Build a Python REST API with Django Rest Framework Course | Udemy",
        "children": [
            "Some Python Experience",
            "Some Django Experience"
        ]
    },
    {
        "parent": "Advanced REST APIs with Flask and Python | Udemy",
        "children": [
            "Have programming experience with Python (preferable) or another Object-Oriented Programming language",
            "Some knowledge of how the web works (requests and responses) will be helpful!",
            "PyCharm (free) or another code editor"
        ]
    },
    {
        "parent": "Creating powerful API's with Django Rest Framework on Heroku | Udemy",
        "children": [
            "Basic knowledge about Django"
        ]
    },
    {
        "parent": "Node.Js: REST APIs Development with Loopback | Udemy",
        "children": [
            "Basic knowledge of Javascript is Important",
            "Basic knowledge of NodeJs is Important"
        ]
    },
    {
        "parent": "Node.Js: Building REST APIs with Sails.js(v1.0) | Udemy",
        "children": [
            "Basic knowledge of Javascript is Important",
            "Basic knowledge of NodeJs is Important"
        ]
    },
    {
        "parent": "Test automation of REST services | Udemy",
        "children": [
            "Installed Java (JDK)",
            "Know Java basics (desired but not required)"
        ]
    },
    {
        "parent": "API Testing using Postman [Functional] & Jmeter[Performance] | Udemy",
        "children": [
            "User should have basic understanding of performance testing",
            "You should have basic understanding of manual testing  &amp; jmeter"
        ]
    },
    {
        "parent": "REST API Automation with RestSharp & HTTP Client | Udemy",
        "children": [
            "Basic understanding of C# language and OOPS concept such as Class, Object, Interface etc.",
            "Basic understanding of Visual Studio IDE",
            "Basic understanding of Post Man Client",
            "Basic understanding of Windows OS",
            "Basic understanding of Tomcat will be an additional advantage"
        ]
    },
    {
        "parent": "Spring Professional Certification Exam Tutorial - Module 07 | Udemy",
        "children": [
            "Java",
            "Maven",
            "IDE of your choice"
        ]
    },
    {
        "parent": "Rest api testing using Postman tool | Udemy",
        "children": [
            "Basic understanding of Web Application/ Web Services",
            "Basic knowledge of Internet/ Browser"
        ]
    },
    {
        "parent": "Learn To Use APIs With Visual Studio, C#, ASP.Net | Udemy",
        "children": [
            "Have a working knowledge of HTML",
            "Understand C# methods and objects",
            "A desire to learn",
            "Visual Studio 2017 - Free!",
            "Postman - Free!"
        ]
    },
    {
        "parent": "NodeJs: Building REST APIS With HapiJs | Udemy",
        "children": [
            "Basic knowledge of Javascript required",
            "Students must be familar with Nodejs",
            "Knowledge of ExpressJs will be beneficial for you!"
        ]
    },
    {
        "parent": "REST API: Data Extraction with Python - without Web Scraping | Udemy",
        "children": [
            "Some prior programming experience in Python (e.g. Data Structures and File Handling) will help.",
            "This course adopts a step-by-step approach and requires you to open a Python editor, download available *.py code files, and start applying the provided examples and exercises.",
            "Python 3: Codes of this course are tested on Python 3. It is up to you to adapt them if you want to run them in Python 2."
        ]
    },
    {
        "parent": "Build REST API using Laravel 5 and TDD tests | Udemy",
        "children": [
            "Basic knowledge of Laravel 5 (Routes/Models/Migrations/Controllers)"
        ]
    },
    {
        "parent": "Learn GraphQL through Examples: Write Full Stack Java Applications | Udemy",
        "children": [
            "Good knowledge of modern JavaScript, including ES6+ and NodeJS",
            "Some knowledge of Express and React preferable but not strictly required"
        ]
    },
    {
        "parent": "Basics of GraphQL with Ruby on Rails | Udemy",
        "children": [
            "You should have already created at least one Ruby on Rails application.",
            "You should have some familiarity with what API applications are."
        ]
    },
    {
        "parent": "Build Full-Stack Apps with GraphQL, Prisma, Node and React | Udemy",
        "children": [
            "Javascript Basics are required",
            "NodeJs basics are required"
        ]
    },
    {
        "parent": "Learning GraphQL with Prisma and NodeJs | Udemy",
        "children": [
            "Basic knowledge of Javascript is required",
            "Basic knowledge of NodeJs is required",
            "Basic knowledge of GraphQL is required"
        ]
    },
    {
        "parent": "Practical GraphQL - Become a GraphQL Ninja | Udemy",
        "children": [
            "JavaScript (including ES2015) knowledge",
            "NodeJS knowledge",
            "Some React knowledge is also preferred"
        ]
    },
    {
        "parent": "Hands-On Full-Stack Web Development with GraphQL and React | Udemy",
        "children": [
            "No prior knowledge of GraphQL is needed. However, a basic knowledge of React and JavaScript is required."
        ]
    },
    {
        "parent": "Django 3 - Build a GraphQL API with Django and Graphene | Udemy",
        "children": [
            "A great willingness to enhance your Web Development skills and do it in a 100% hands-on fashion.",
            "You are going to download and install everything you need as we go through the course.",
            "You need to have an intermediate understanding of Python 3 and Django 3 before attending this course.",
            "The course is taught in a Windows 10 environment, so it's best that you also work on Windows for consistency."
        ]
    },
    {
        "parent": "GraphQL Projects | Udemy",
        "children": [
            "Knowledge of Redux/Mobx or similar state management libraries is not required but is helpful to gain a better understanding of the course."
        ]
    },
    {
        "parent": "Free GraphQL Tutorial - GraphQL with Django and Python | Udemy",
        "children": []
    },
    {
        "parent": "Master the MEAN Stack - Learn By Example | Udemy",
        "children": [
            "Have Node.js Installed",
            "Knowledge of JavaScript fundamentals",
            "Understand Basics of Angular 1.x"
        ]
    },
    {
        "parent": "MEAN Stack Registration and Login App | Udemy",
        "children": [
            "Basic Angular 5+ / Basic NodeJs Express",
            "Basics of  Core web technologies ( Html, css, Javascript )"
        ]
    },
    {
        "parent": "Hands-On MEAN Stack Web Development | Udemy",
        "children": [
            "A basic knowledge of Angular will be helpful."
        ]
    },
    {
        "parent": "Building Applications with Mean Stack | Udemy",
        "children": [
            "You will need a basic knowledge of Angular-Js; however you do not need a detailed knowledge of other stack components such as Node.js, Express.js, and MongoDB. This is for enthusiasts of scalable, secure, cloud-based systems."
        ]
    },
    {
        "parent": "RESTful Web services with ASP.NET Core | Udemy",
        "children": [
            "To make the best use of the code samples included in the video, you should have a basic knowledge of C# and .NET Core."
        ]
    },
    {
        "parent": "Loopback 4: Modern ways to Build APIs in Typescript & NodeJs | Udemy",
        "children": [
            "Knowledge of Javascript is important",
            "Basic Knowledge of Typescript is requried",
            "Knowledge of NodeJs is required"
        ]
    },
    {
        "parent": "Professional RESTful API Design using Python Flask | Udemy",
        "children": [
            "A computer with internet access and administrative access to install packages",
            "Good understanding of how to use the command line interface, internet and code editors",
            "Good knowledge of the Flask web framework"
        ]
    },
    {
        "parent": "Android Advanced Guide to Create A RESTFul API Client App | Udemy",
        "children": [
            "You should have basic Android app development knowledge",
            "You should have Android Studio installed in your computer with Internet connection",
            "You need to create a free Dark Sky Developer account"
        ]
    },
    {
        "parent": "Building RESTful APIs with Go | Udemy",
        "children": [
            "The course assumes some experience with the Go programming language, as well as some knowledge of HTTP. RESTful web service concepts, JSON, and some Go language features will be introduced in enough detail so viewers can use them to build RESTful services with Go."
        ]
    },
    {
        "parent": "RESTful Web API Design with Node.js - Second Edition | Udemy",
        "children": [
            "Knowledge of REST or HTTP is not essential as this course provides all the background information required to get you started."
        ]
    },
    {
        "parent": "The Complete C# ASP.NET Web API Course | Udemy",
        "children": [
            "A Mac or PC"
        ]
    },
    {
        "parent": "RESTful APIs with Lumen | Udemy",
        "children": [
            "basic of php"
        ]
    },
    {
        "parent": "Build a Realtime App with React Hooks and GraphQL | Udemy",
        "children": [
            "Basic understanding of React / React Hooks (i.e. having taken my React Hooks course)",
            "Familiarity with GraphQL"
        ]
    },
    {
        "parent": "React Hooks Tutorial - Master React Hooks Development | Udemy",
        "children": [
            "Some experience with React will help. This course dives into React hooks right away, and might feel fast-paced for newcomers to React.",
            "Familiarity with JavaScript.",
            "Command line experience."
        ]
    },
    {
        "parent": "Learn React Hooks in a Better Way | Udemy",
        "children": [
            "Basic knowledge in HTML , CSS, JavaScript , React , ES6, ES7",
            "IDE - VS code is recommended",
            "Computer and internet"
        ]
    },
    {
        "parent": "Hands-On React Applications with React Hooks | Udemy",
        "children": [
            "Knowledge of JavaScript and React is assumed."
        ]
    },
    {
        "parent": "Make A Responsive Website Project #2: HTML, CSS & Javascript | Udemy",
        "children": [
            "A solid foundation in HTML(e.g. recognize what &lt;section&gt;&lt;/section&gt; means)",
            "A solid foundation in CSS(e.g. know the difference between position: relative and position: absolute)",
            "Some prior exposure to Javascript and JQuery",
            "You will be required to download JQuery, Bootstrap, Animate(dot)css and Snowstorm. All of of these are available free and no sign ups are required. Although I have included all of those files in the source code, I suggest you also to learn where to download them yourself as well."
        ]
    },
    {
        "parent": "HTML5 + CSS3 Responsive Web Design | Udemy",
        "children": [
            "Adobe Illustrator and Adobe Photoshop (recommended)"
        ]
    },
    {
        "parent": "Free Responsive Design Tutorial - Responsive Web Design with HTML5 and CSS3 - Intermediate | Udemy",
        "children": []
    },
    {
        "parent": "Free Responsive Design Tutorial - Responsive Web Design with HTML5 and CSS3 - Advanced | Udemy",
        "children": []
    },
    {
        "parent": "Practice advanced SQL queries with MySQL 5.7+ | Udemy",
        "children": [
            "Your genuine interest in SQL is required. If you’re passionate about the data analysis, optimisation, advanced queries, it will be so much easier for me to get you to a next level!",
            "Access to a MySQL database",
            "Basic or intermediate SQL knowledge such as:",
            "...already can query data: SELECT COUNT, DISTINCT, LIMIT, ORDER BY, WHERE",
            "... already know conditions: BETWEEN, LIKE, IS NULL, IN, NOT IN",
            "... already know aggregation: GROUP BY, HAVING, MAX, MIN, AVG, SUM",
            "... already know joins: INNER JOIN, OUTER JOIN, CROSS JOIN",
            "... already know views: CREATE VIEW AS",
            "... already know data management: CREATE TABLE, INERT INTO, UPDATE, DELETE",
            "... already know sub-queries"
        ]
    },
    {
        "parent": "MySQL Database Training for Beginners | Udemy",
        "children": [
            "A computer"
        ]
    },
    {
        "parent": "MySQL Database Management System using MySQL. MySQL for ALL! | Udemy",
        "children": [
            "There are no prerequisites to this class, other than a pc/mac, and a healthy appetite for learning new things"
        ]
    },
    {
        "parent": "JSON AJAX data transfer to MySQL database using PHP | Udemy",
        "children": [
            "basic javascript",
            "basic HTML CSS and PHP",
            "desire to learn",
            "computer access"
        ]
    },
    {
        "parent": "Unity 5 Interact with the database like a pro - php mysql | Udemy",
        "children": [
            "basic use of Unity is recommended but not required",
            "All software is free to use",
            "have a windows PC, MAC, or Linux"
        ]
    },
    {
        "parent": "Mysql on Docker : On-Premise & AWS Cloud | Udemy",
        "children": [
            "Knowledge of Databases (Mysql / Oracle)"
        ]
    },
    {
        "parent": "Byte-Sized-Chunks: SQL Joins in MySQL | Udemy",
        "children": [
            "We will write join queries in MySQL, and the course will explain how MySQL ought to be installed and set up"
        ]
    },
    {
        "parent": "The Fast Track Introduction to MySQL on RDS | Udemy",
        "children": [
            "You will need an AWS account. ",
            "You'll need MySQL. In the course I'll be showing you how to install MySQL on a windows box. "
        ]
    },
    {
        "parent": "Multiple Dropdown Lists Using jQuery, Ajax, MySQL and PHP | Udemy",
        "children": [
            "You should be familiar with HTML, CSS, PHP, and MySQL",
            "You will need a PHP code editor and access to a MySQL database. I use Visual Studio Code and MAMP in the course. Any equivalent for your computer setup should be OK. Feel free to ask if unsure."
        ]
    },
    {
        "parent": "PHP 7 and MySQL From Scratch | Udemy",
        "children": [
            "Internet Connection",
            "PC/Laptop",
            "Windows/MacOS/Linux"
        ]
    },
    {
        "parent": "C# Windows Forms | Udemy",
        "children": [
            "\"C# For Beginners. Learn Development Fundamentals of C#\" by Olga Karpushin",
            "\"C# Advanced Programming OOP \" by Olga Karpushin"
        ]
    },
    {
        "parent": "MySQL 8 Recipes | Udemy",
        "children": [
            "This friendly course takes you through MySQL 8. It is packed with step-by-step instructions and working examples. This comprehensive course is divided into clear bite-size chunks so you can learn at your own pace and focus on the areas of most interest to you."
        ]
    },
    {
        "parent": "Adobe Photoshop CC – Advanced Training Course | Udemy",
        "children": [
            "Any version of Adobe Photoshop, preferably the CC (Creative Cloud) version.",
            "Basic knowledge of Photoshop is required. I recommend watching my Photoshop Essentials course before this course.",
            "If you already know how to use layers &amp; make simple selections then you are perfect for this course."
        ]
    },
    {
        "parent": "Painting Faces with the Power of Photoshop | Udemy",
        "children": [
            "You should have a decent grasp of Photoshop and Art Fundamentals. We offer FREE courses on both!",
            "You should have Adobe Photoshop and a pressure sensitive pen tablet"
        ]
    },
    {
        "parent": "Painting Figures with the Power of Photoshop | Udemy",
        "children": [
            "You should have a decent grasp of Photoshop and Art Fundamentals. We offer FREE courses on both!",
            "You should have Adobe Photoshop and a pressure sensitive pen tablet"
        ]
    },
    {
        "parent": "The Ultimate 2D/3D Photoshop & Graphic Design Course ! 2020 | Udemy",
        "children": [
            "You only need adobe photoshop"
        ]
    },
    {
        "parent": "Digital Pet Paintings Using Photoshop | Udemy",
        "children": [
            "Photoshop CS5 or a newer version",
            "Recommended but not required - a drawing tablet. eg. Bamboo, Wacom, etc.."
        ]
    },
    {
        "parent": "Photoshop for Arch Viz: Project Based Post-Processing Course | Udemy",
        "children": [
            "You will need to come with a basic knowledge of Photoshop, although you might be able catch up, even with no experience.",
            "You will need to come with a working knowledge of 3d software and rendering, because this course is about processing those images.  You could also use the techniques to process the renderings of others, or even photographs, if you want to do that instead."
        ]
    },
    {
        "parent": "How To Use Photoshop To Make Digital Design Paper Fast, Easy | Udemy",
        "children": [
            "Must know the basics of Adobe Photoshop",
            "Must have an internet connection",
            "Have access to Photoshop cs5 or higher."
        ]
    },
    {
        "parent": "Photoshop 2019 : Creating awesome designs and manipulations | Udemy",
        "children": [
            "Know the basics of Photoshop",
            "Adobe Photoshop CC 2019"
        ]
    },
    {
        "parent": "Photo Manipulation With Adobe Photoshop : Amazing Designs | Udemy",
        "children": [
            "Be familiar with the basics of Adobe Photoshop"
        ]
    },
    {
        "parent": "Photoshop CC: 20 Common Productivity and Design Mistakes | Udemy",
        "children": [
            "Working knowledge of Photoshop CC 2018",
            "An understanding of all the file formats used with Photoshop",
            "A working knowledge of bitmap and vector images"
        ]
    },
    {
        "parent": "2D Composition in Photoshop & Animation in After Effects | Udemy",
        "children": [
            "This course is assuming you have intermediate experience in photoshop and after effects , however we take a step by step approach so you can follow along. If you have never used photoshop or After Effects I strongly recommend that take a beginner course to get more familiar with photoshop and after effects tools first then would be a time to watch this course."
        ]
    },
    {
        "parent": "Photoshop For T-shirt Design: Advanced | Udemy",
        "children": [
            "Students will need a moderate knowledge of Photoshop",
            "Students will need to knw that this is lke no other course on Photoshop"
        ]
    },
    {
        "parent": "28 Time Saving Tips & Tricks In Adobe Photoshop | Udemy",
        "children": [
            "Students need a copy of Adobe Photoshop, preferably CC (Creative Cloud). The free trial would work as well.",
            "You should be able to use PC at a beginner level"
        ]
    },
    {
        "parent": "Transform Your Photos with Adobe Lightroom & Photoshop | Udemy",
        "children": [
            "You should be familiar with Adobe Photoshop",
            "You should be familiar with Adobe Lightroom",
            "You should be familiar with the Pen Tool",
            "You should be familiar with Masks"
        ]
    },
    {
        "parent": "Monster course: Design magical T-shirts | Udemy",
        "children": [
            "Adobe Photoshop CC",
            "Be familiar with the Adobe Photoshop basics",
            "Be familiar with the Pen tool"
        ]
    },
    {
        "parent": "Mastering Photoshop: From Beginner to Industry Professional | Udemy",
        "children": [
            "Needs to have any version of the following Photoshop CS4, CS5, CS6, CC, CC any year",
            "Download Photoshop from adobe's website (Trial version works too)",
            "Take notes"
        ]
    },
    {
        "parent": "Single-Page Application with ASP.NET & jQuery Hands-On | Udemy",
        "children": [
            "Visual Studio 2017 Community Edition (free!)",
            "SQL Server Express Edition (also free!)",
            "Other versions of Visual Studio also work, but might be slightly different",
            "You should have a little experience in building web applications in .NET",
            "You should have a little experience in C#, HTML and CSS",
            "Experience with JavaScript and jQuery might help but is not absolutely necessary",
            "If you want to publish your single-page application, you need a Windows Server system (a virtual machine is sufficient)"
        ]
    },
    {
        "parent": "Learn jQuery for beginners web development | Udemy",
        "children": [
            "JavaScript experience",
            "CSS and HTML experience",
            "Desire to learn jQuery"
        ]
    },
    {
        "parent": "Learn jQuery AJAX in 1 hour | Udemy",
        "children": [
            "JavaScript basics and basic jQuery",
            "Desire to learn",
            "Computer Access"
        ]
    },
    {
        "parent": "Essential JavaScript, jQuery and AngularJS Training | Udemy",
        "children": [
            "Prerequisites include a foundation of creating basic websites, an understanding of HTML/CSS familiarity, and basic web concepts.",
            "A browser and a text editor"
        ]
    },
    {
        "parent": "Projects in jQuery Mobile: Learn by building Real World Apps | Udemy",
        "children": [
            "Basic knowledge of JavaScript and HTML is required to complete this course",
            "Basic knowledge of jQuery will help but not necessary to complete this course"
        ]
    },
    {
        "parent": "Complete jquery for beginners, learn jquery ui, jquery ajax | Udemy",
        "children": [
            "You will need an internet connection at least once for downloading Jquery.",
            "You'll need a text editor of your choice to write the code, we'll go through the installation process for one such editor.",
            "Basic understanding of HTML, CSS and Javascript",
            "No more requirement"
        ]
    },
    {
        "parent": "Introduction to jQuery | Udemy",
        "children": [
            "Introduction to HTML",
            "Introduction to Javascript",
            "Intermediate Javascript"
        ]
    },
    {
        "parent": "Build Courier Tracking System in PHP OOP -- 2019 | Udemy",
        "children": [
            "Must have basic knowledge of PHP",
            "Must have basic knowledge of Jquery",
            "Must have basic knowledge of Javascript",
            "Must have basic knowledge of Mysqli"
        ]
    },
    {
        "parent": "Moving from jQuery to AngularJS | Udemy",
        "children": [
            "Working files are included, allowing you to follow along with the author throughout the lessons.",
            "For PC or MAC users"
        ]
    },
    {
        "parent": "LEARNING PATH: jQuery: Master Web Development with jQuery 3 | Udemy",
        "children": [
            "Basic knowledge on HTML, CSS, and JavaScript programming is required."
        ]
    },
    {
        "parent": "Free AJAX Tutorial - Learn AJAX with jQuery | Udemy",
        "children": []
    },
    {
        "parent": "R Programming: Advanced Analytics In R For Data Science | Udemy",
        "children": [
            "Basic knowledge of R",
            "Knowledge of the GGPlot2 package is recommended",
            "Knowledge of dataframes",
            "Knowledge of vectors and vectorized operations"
        ]
    },
    {
        "parent": "Deploy Machine Learning & NLP Models with Dockers (DevOps) | Udemy",
        "children": [
            "Basic programming in any language",
            "Basic Mathematics",
            "Some exposure to Python (but not mandatory)"
        ]
    },
    {
        "parent": "Data Science for Business | 6 Real-world Case Studies | Udemy",
        "children": [
            "Basic knowledge of programming is recommended. However, these topics will be extensively covered during early course lectures; therefore, the course has no prerequisites, and is open to anyone with basic programming knowledge. Students who enroll in this course will master data science fundamentals and directly apply these skills to solve real world challenging business problems."
        ]
    },
    {
        "parent": "Statistics for Data Science | Udemy",
        "children": [
            "No prior experience is required. We will start from the very basics"
        ]
    },
    {
        "parent": "Introduction To Data Science | Udemy",
        "children": [
            "You should be familiar with basic scripting or programming, and basic statistics.",
            "Familiarity with R is a plus. Familiarity with RStudio is a plus. We will teach you how to start with R and RStudio, but you want to install them on your computer prior to starting this course."
        ]
    },
    {
        "parent": "How to Become A Data Scientist Using Azure Machine Learning | Udemy",
        "children": [
            "Basic data skills and statistics would be helpful but this is an entry level course. "
        ]
    },
    {
        "parent": "Python Data Science with Pandas: Master 12 Advanced Projects | Udemy",
        "children": [
            "You should be familiar with Python (Standard Library, Numpy, Matplotlib)",
            "You should have worked with Pandas before (at least you should know the basics)",
            "A desktop computer (Windows, Mac, or Linux) capable of storing and running Anaconda. The course will walk you through installing the necessary free software.",
            "An internet connection capable of streaming HD videos.",
            "Some high school level math skills would be great (not mandatory, but it helps)"
        ]
    },
    {
        "parent": "SQL for Data Analysis: Core Data Scientist’s Skills | Udemy",
        "children": [
            "Basic knowledge of Windows",
            "Understanding programming notions (like 'variable' and 'function')"
        ]
    },
    {
        "parent": "Advanced Data Science Techniques in SPSS | Udemy",
        "children": [
            "SPSS program installed (version 21+)",
            "Basic SPSS knowledge",
            "Basic or intermediate statistics knowledge"
        ]
    },
    {
        "parent": "Statistics & Probability for Data Science | Udemy",
        "children": [
            "No prior experience is required. We will start from the very basics. You will benefit by going through our part 1 course which lays the foundation"
        ]
    },
    {
        "parent": "Binomial, Normal Distribution, Matrices for Data Science | Udemy",
        "children": [
            "No prior experience is required. We will start from the very basics. You will benefit by going through our part 2 course which lays the foundation"
        ]
    },
    {
        "parent": "Data Science: Machine Learning algorithms in Matlab | Udemy",
        "children": [
            "High School maths level.",
            "Basic Computer programming experience"
        ]
    },
    {
        "parent": "Real data science problems with Python | Udemy",
        "children": [
            "Some experience with Python",
            "General knowledge on Machine Learning, Statistics"
        ]
    },
    {
        "parent": "Data Science : Plotly, NumPy, Matplotlib, and Pandas | Udemy",
        "children": [
            "Windows PC/ Raspberry Pi with Internet Connection",
            "Zeal and enthusiasm to learn new things",
            "a burning desire to take your career to the next level",
            "Basic Programming and Python Programming Basics",
            "basic mathematics knowledge will be greatly appreciated"
        ]
    },
    {
        "parent": "Deep Learning with Google Colab | Udemy",
        "children": [
            "Familiarity with Python programming (including classes, functions, context managers)",
            "Basic linear algebra and calculus (briefly used during the discussions on various deep learning models and techniques)"
        ]
    },
    {
        "parent": "Deployment of Machine Learning Models | Udemy",
        "children": [
            "A Python installation",
            "A Jupyter notebook installation",
            "Python coding skills including pandas and scikit-learn",
            "Familiarity with Python environments, OOP and git",
            "Familiarity with Machine Learning algorithms",
            "This is an intermediate level course (see description)"
        ]
    },
    {
        "parent": "Machine Learning Practical: 6 Real-World Applications | Udemy",
        "children": [
            "You need to know Python (Machine Learning A-Z level is enough) in order to complete this course.",
            "You need to know how to set up your working environment (Anaconda, Jupyter Notebook, Spyder)",
            "This should not be your first Machine Learning course. You need to understand main concepts."
        ]
    },
    {
        "parent": "Feature Engineering for Machine Learning | Udemy",
        "children": [
            "A Python installation",
            "Jupyter notebook installation",
            "Python coding skills",
            "Some experience with Numpy and Pandas",
            "Familiarity with Machine Learning algorithms",
            "Familiarity with Scikit-Learn"
        ]
    },
    {
        "parent": "A Beginner's Guide To Machine Learning with Unity Tutorial | Udemy",
        "children": [
            "You should be familiar with the Unity Game Engine.",
            "You should have a working knowledge of C#.",
            "You should have a healthy appreciation for mathematics and statistics."
        ]
    },
    {
        "parent": "Feature Selection for Machine Learning | Udemy",
        "children": [
            "A Python installation",
            "Jupyter notebook installation",
            "Python coding skills",
            "Some experience with Numpy and Pandas",
            "Familiarity with Machine Learning algorithms",
            "Familiarity with scikit-learn"
        ]
    },
    {
        "parent": "Machine Learning and AI: Support Vector Machines in Python | Udemy",
        "children": [
            "Calculus, Matrix Arithmetic / Geometry, Basic Probability",
            "Python and Numpy coding",
            "Logistic Regression"
        ]
    },
    {
        "parent": "Machine Learning Classification Bootcamp in Python | Udemy",
        "children": [
            "Basic knowledge of Python Programming",
            "Experienced computer user"
        ]
    },
    {
        "parent": "All-in-One:Machine Learning,DL,NLP,AWS Deply [Hindi][Python] | Udemy",
        "children": [
            "For Machine Learning Concept no prerequisite. Anyone can do this course.",
            "Prior Understanding of Python is required."
        ]
    },
    {
        "parent": "Machine Learning Optimization Using Genetic Algorithm | Udemy",
        "children": [
            "Basic knowledge in Machine Learning",
            "Basic knowledge in Operations Research and Optimization - (not a must, but helpful)",
            "Basic programming skills in Python - (not a must, but helpful)"
        ]
    },
    {
        "parent": "Data Visualization in Python for Machine Learning Engineers | Udemy",
        "children": [
            "You've completed the first two courses in the series.",
            "A desire to learn Python.",
            "A basic understanding of machine learning would be beneficial."
        ]
    },
    {
        "parent": "Machine Learning and Statistical Modeling with R Examples | Udemy",
        "children": [
            "You need a solid foundation in R",
            "You need a good understanding of general statistics",
            "You should be interested in machine learning and modeling"
        ]
    },
    {
        "parent": "Learning Path: R: Complete Machine Learning & Deep Learning | Udemy",
        "children": [
            "Basic knowledge of R would be beneficial",
            "Knowledge of linear algebra and statistics is required"
        ]
    },
    {
        "parent": "Machine Learning using Python | Udemy",
        "children": [
            "No prior knowledge of machine learning required",
            "Basic knowledge of Python"
        ]
    },
    {
        "parent": "A to Z (NLP) Machine Learning Model building and Deployment. | Udemy",
        "children": [
            "Basic programming in any language",
            "Some exposure to Python (but not mandatory)"
        ]
    },
    {
        "parent": "Fundamentals of Machine Learning with Python Implementation. | Udemy",
        "children": [
            "Basics of python programming",
            "Linear algebra (understanding of matrices)",
            "Differential calculus (optional)"
        ]
    },
    {
        "parent": "Testing and Monitoring Machine Learning Model Deployments | Udemy",
        "children": [
            "Comfortable with Python",
            "Familiar with Scikit-Learn, Pandas, Numpy",
            "Comfortable with Data Science Fundamentals",
            "Can use Git version control",
            "Basic knowledge of Docker",
            "This is an advanced course"
        ]
    },
    {
        "parent": "Become a Python Data Analyst | Udemy",
        "children": [
            "This course introduces the viewer to the main libraries of Python’s Data Science stack. Taking an applied approach, it provides many examples using real-world datasets to show how to effectively use Python’s tools to process, visualize and analyze data. It contains all you need to start analyzing data with Python and provides the foundation for more advanced topics like Predictive Analytics."
        ]
    },
    {
        "parent": "Excel Data Analysis with Excel Pivot Tables, Excel Dashboard | Udemy",
        "children": [
            "This Course is created on Excel 2016, You can also use Excel 2010 and above",
            "Basic Excel Knowledge",
            "Interest to Learn and Upgrade Your Skillset",
            "A Windows or a MAC PC where Microsoft Excel is Installed"
        ]
    },
    {
        "parent": "PostgreSQL: Advanced SQL Queries and Data Analysis | Udemy",
        "children": [
            "You should understand basic database concepts",
            "You should have a basic understanding of SQL",
            "You should have a basic understanding of PostgreSQL"
        ]
    },
    {
        "parent": "Audit & Forensic Data Analysis with MS Excel | Udemy",
        "children": [
            "At least 6 months experience of working on MS Excel"
        ]
    },
    {
        "parent": "SAP Data Analysis for Sales Documents and More | Udemy",
        "children": [
            "None, but a familiarity with SAP software is helpful."
        ]
    },
    {
        "parent": "Econometrics#2: Econometrics Modeling and Analysis in EViews | Udemy",
        "children": [
            "Prior knowledge of Quantitative Methods AND Econometric techniques, MS Office and Paint is desired.",
            "Understanding of Data Analysis and VBA toolpack in MS Excel will be useful",
            "A Computer with Internet"
        ]
    },
    {
        "parent": "Advanced Applied SQL for Business Intelligence and Analytics | Udemy",
        "children": [
            "Basic understanding of SQL and interact with data and databases; it will help them understand query complexity with ease."
        ]
    },
    {
        "parent": "Streaming Analytics on Google Cloud Platform | Udemy",
        "children": [
            "You should have completed all the courses in the series. This should be your last course.",
            "A basic understanding of JAVA would be helpful."
        ]
    },
    {
        "parent": "R Programming: Mastering R for data analysis | Udemy",
        "children": [
            "No prior knowledge of programming is required"
        ]
    },
    {
        "parent": "Data Analytics Introduction and Excel Dashboarding | Udemy",
        "children": [
            "You need to have Excel 2007 or higher installed on their computer (Some features won't work on Excel 2007)"
        ]
    },
    {
        "parent": "Data Analysis in Python for Lean Six Sigma Professionals | Udemy",
        "children": [
            "Prior knowledge of the Six Sigma Analysis tools is needed.",
            "If you don't have Green Belt Level proficiency, then register for \"Lean Six Sigma Green Belt Course with Python\" course instead"
        ]
    },
    {
        "parent": "Learning Path: R: Master R Data Analysis and Visualization | Udemy",
        "children": [
            "Basic programming knowledge of R",
            "Basic knowledge of Math and Statistics"
        ]
    },
    {
        "parent": "SQL: Data Analytics Applications in the Real World | Udemy",
        "children": [
            "Either completed the ‘SQL &amp; Power BI: Your Data Analytics &amp; Visualisation Journey’ course, or have previous experience and knowledge using Microsoft SQL Server",
            "It is essential to know how to carry out the following operations in SQL: ‘WHERE’ clause filtering, aggregations, joins, categorisation by using ‘CASE’, stored procedures, converting data types and window functions.",
            "No need to even have SQL Server downloaded in advance, as we'll show you how to get it installed for free!",
            "Note that SSMS (SQL Server Management Studio) cannot be installed on Mac OS. To install it on your Mac, the \"Parallels Desktop\" software is required, or the dual-boot to Windows method",
            "Why not check the reviews &amp; curriculum to see what's in it for you?"
        ]
    },
    {
        "parent": "Python for Data Analytics for Beginners by Doing Projects | Udemy",
        "children": [
            "No programming skills needed, course is designed with consideration of non programmers, passion will do",
            "A laptop to practice python syntax and projects on real data set",
            "Environment setup manual and video is provided"
        ]
    },
    {
        "parent": "Application of Statistics in Business Analytics | Udemy",
        "children": [
            "Be familiar with basic marketing concepts and basic mathematics"
        ]
    },
    {
        "parent": "Data Analysts Toolbox: Excel, Python, Power BI | Udemy",
        "children": [
            "You'll need a copy of Microsoft Excel that is compatible with the Power Pivot tool.",
            "A good understanding of MS Excel. This is an advanced level course.",
            "Power BI Desktop installed on your machine is required to take the practice exercises",
            "A good knowledge of MS Excel is advised but not necessary"
        ]
    },
    {
        "parent": "Total TensorFlow Guide: Deep Learning with Python Course | Udemy",
        "children": [
            "Some knowledge of programming (preferably Python)",
            "Some basic knowledge of math (mean, standard deviation, etc..)"
        ]
    },
    {
        "parent": "Deep Learning: Advanced Computer Vision (GANs, SSD, +More!) | Udemy",
        "children": [
            "Know how to build, train, and use a CNN using some library (preferably in Python)",
            "Understand basic theoretical concepts behind convolution and neural networks",
            "Decent Python coding skills, preferably in data science and the Numpy Stack"
        ]
    },
    {
        "parent": "Cutting-Edge AI: Deep Reinforcement Learning in Python | Udemy",
        "children": [
            "Know the basics of MDPs (Markov Decision Processes) and Reinforcement Learning",
            "Helpful to have seen my first two Reinforcement Learning courses",
            "Know how to build a convolutional neural network in Tensorflow"
        ]
    },
    {
        "parent": "Deep Learning for Computer Vision with Tensor Flow and Keras | Udemy",
        "children": [
            "Machine Learning concepts, Linear Algebra, Python, Tensor Flow, Keras and OpenCV"
        ]
    },
    {
        "parent": "Modern Reinforcement Learning: Deep Q Learning in PyTorch | Udemy",
        "children": [
            "Some College Calculus",
            "Exposure To Deep Learning",
            "Comfortable with Python"
        ]
    },
    {
        "parent": "Complete Guide to Creating COCO Datasets | Udemy",
        "children": [
            "Take an Intro to Deep Learning course first (perhaps from another Udemy course!)",
            "Have basic to intermediate Python programming skills",
            "Have a physical or cloud computer with GPU/CUDA compute",
            "Recommended: Prior experience with Anaconda &amp; Jupyter notebooks"
        ]
    },
    {
        "parent": "Deep Learning Course with Flutter & Python - Build 6 AI Apps | Udemy",
        "children": [
            "Intermediate Programmer",
            "Know some theory behind Neural Networks.",
            "Curiosity"
        ]
    },
    {
        "parent": "Data Science: Deep Learning Project for Self Driving Cars | Udemy",
        "children": [
            "Basic Python Programming",
            "Basics of Neural Network"
        ]
    },
    {
        "parent": "Modern Deep Convolutional Neural Networks with PyTorch | Udemy",
        "children": [
            "Machine Learning",
            "Linear Regression and Classification",
            "Matrix Calculus, Probability",
            "Deep Learning basis: Multi perceptron, optimization",
            "Python, PyTorch"
        ]
    },
    {
        "parent": "Deep Learning (Keras, Tensorflow: CV/IP, Sequences, FuncAPI) | Udemy",
        "children": [
            "Python language"
        ]
    },
    {
        "parent": "Deep Learning Complete Guide for Calculus - Machine Learning | Udemy",
        "children": [
            "Pen and a paper to workout maths problem",
            "Computer with Python to execute the code",
            "Some programming experience"
        ]
    },
    {
        "parent": "R Shiny Interactive Web Apps - Next Level Data Visualization | Udemy",
        "children": [
            "Basic R knowledge",
            "General R data visualization skills (ggplot2, R base)",
            "Computer with R and RStudio already installed"
        ]
    },
    {
        "parent": "Text Mining, Scraping and Sentiment Analysis with R | Udemy",
        "children": [
            "intermediate R knowledge is required (R Level 1 course)",
            "R program ready on your computer",
            "basic understanding of social media and web technologies"
        ]
    },
    {
        "parent": "Statistics in R - The R Language for Statistical Analysis | Udemy",
        "children": [
            "solid understanding of R programming - up to my \"R Level 1\" course",
            "R and R Studio ready on your computer",
            "basic understanding of statistics (descriptive, inferential, regression)",
            "high interest in data analysis"
        ]
    },
    {
        "parent": "Statistics with R - Intermediate Level | Udemy",
        "children": [
            "R and R studio",
            "knowledge of statistics"
        ]
    },
    {
        "parent": "Graphs in R - Data Visualization with R Programming Language | Udemy",
        "children": [
            "Basic statistics knowledge",
            "Basic understanding of graph creation",
            "Good understanding of R (up to R Level 1 course content)",
            "Interest in data science",
            "R and RStudio ready on your computer"
        ]
    },
    {
        "parent": "Maps with R Leaflet | Udemy",
        "children": [
            "RStudio",
            "A beginner understanding of R"
        ]
    },
    {
        "parent": "Ecology in R | Udemy",
        "children": [
            "Download R and R Studios",
            "Internet connection"
        ]
    },
    {
        "parent": "Statistics with R - Advanced Level | Udemy",
        "children": [
            "R and R studio",
            "knowledge of advanced statistics"
        ]
    },
    {
        "parent": "Python & R Programming | Udemy",
        "children": [
            "You don't need any prior programming experience, and by the time you finish, you'll have built a real-world data science project from the ground up using your new Python and R Programming skills!"
        ]
    },
    {
        "parent": "Data Science-Unsupervised Machine Learning Using R | Udemy",
        "children": [
            "Download R &amp; RStudio before starting this tutorial",
            "Download datasets folder in zipfile which is uploaded in session 1",
            "While no prerequisite is required for taking up this course, however rudimentary knowledge of Basic statistics will be an added advantage"
        ]
    },
    {
        "parent": "R: Complete Machine Learning Solutions | Udemy",
        "children": [
            "No prior knowledge of R is required"
        ]
    },
    {
        "parent": "R: Learn to Program in R & Use R for Effective Data Analysis | Udemy",
        "children": [
            " You will require a working R/R Studio software to complete the course exercises. You can download the software from cran.r-project.org "
        ]
    },
    {
        "parent": "Artificial Intelligence Bootcamp in R Programming | Udemy",
        "children": [
            "Knowledge how to install packages on your PC",
            "Basic understanding in Machine Learning Terms such as Unsupervised &amp; Supervised Learning",
            "Basic knowledge in Neural Networks"
        ]
    },
    {
        "parent": "Modern Artificial Intelligence Masterclass: Build 6 Projects | Udemy",
        "children": [
            "Basic knowledge of programming is recommended but not required."
        ]
    },
    {
        "parent": "Advanced AI For Games with Goal-Oriented Action Planning | Udemy",
        "children": [
            "You should be familiar with C# and the Unity Game Development Engine."
        ]
    },
    {
        "parent": "Artificial Intelligence and Predictive Analysis using Python | Udemy",
        "children": [
            "Basic knowledge of Python",
            "Beginner knowledge of Statistics"
        ]
    },
    {
        "parent": "Fuzzy Logic, Labview and Arduino | Udemy",
        "children": [
            "Labview 2014 or above with Control system and fuzzy logic toolkit installed.",
            "You should have big motivation to learn applied artificial intelligence and cybernetics with labview and hardware based in hand-on. Not advanced mathematics required.",
            "PC/laptop minimum 2Ghz CPU, 4Gb RAM.",
            "You must know intermediate-advance Labview programming (like the Udemy course-Labview university Core I and Core II).",
            "You must have basic electronic knowledge, protoboard, arduino UNO, resistors, potentiometers, leds, very easy"
        ]
    },
    {
        "parent": "Game Devs Unleash Artificial Intelligence: Flocking Agents | Udemy",
        "children": [
            "You should already have basic Computer Science skills (minimum 6 months experience)",
            "You should already be familiar with any game engine (minimum 3 months experience)",
            "Have Unity 3D game engine installed or your own favorite game engine",
            "Understand Pseudocode or C# or Java"
        ]
    },
    {
        "parent": "Search Algorithms in Artificial Intelligence with Java | Udemy",
        "children": [
            "Good understanding of Java programming language (intermediate level and above).",
            "Familiarity with the Java GUI and Java API.",
            "Good understanding of object-oriented programming (intermediate level and above).",
            "Basic understanding of data structures",
            "No prior knowledge of Artificial Intelligence is required"
        ]
    },
    {
        "parent": "Getting Started with Embedded AI | Edge AI | Udemy",
        "children": [
            "Knowledge of C or Python Language is plus",
            "Knowledge of stm32 is plus"
        ]
    },
    {
        "parent": "IBM Watson for Beginners | Udemy",
        "children": [
            "No prior knowledge is required."
        ]
    },
    {
        "parent": "Python: Artificial Intelligence (AI) with Python: 3-in-1 | Udemy",
        "children": [
            "Basic working knowledge of Python programming is expected",
            "Basic understanding of machine learning and minimal experience in developing AI projects"
        ]
    },
    {
        "parent": "Artificial Intelligence: Advanced Machine Learning | Udemy",
        "children": [
            "Knowledge of some undergraduate level mathematics would be an added advantage"
        ]
    },
    {
        "parent": "Artificial Intelligence : The Future Of Programming | Udemy",
        "children": [
            "Basic programming skills"
        ]
    },
    {
        "parent": "Artificial Intelligence Terminology | Udemy",
        "children": []
    },
    {
        "parent": "Evolutionary Algorithms - AI Tetris Bot | Udemy",
        "children": [
            "Some programming experience",
            "Git and Python installed"
        ]
    },
    {
        "parent": "Nature of intelligence-advanced topics in machine learning | Udemy",
        "children": [
            "The student should already possess certain knowledge of machine learning. One should know how machine learning algorithms work and should have experience in applying them. Although not a requirement, having a PhD in machine learning will make taking this course easier."
        ]
    },
    {
        "parent": "Learn Data Visualization in D3.js (D3 Library Intro Course) | Udemy",
        "children": [
            "Students should have a good understanding of HTML, CSS, and JavaScript",
            "Students should know how to interact with the Document Object Model (DOM) using jQuery"
        ]
    },
    {
        "parent": "Tableau Expert: Top Visualization Techniques in Tableau 10 | Udemy",
        "children": [
            "At least an intermediate knowledge of Tableau Desktop; advanced preferred."
        ]
    },
    {
        "parent": "Creating Bespoke Data Visualisations in Tableau | Udemy",
        "children": [
            "Tableau Desktop / Tableau Public Installed",
            "6-12 Months of Tableau Desktop Experience",
            "Excel (or equivalent spreadsheet software)",
            "An Understanding of Tableau Desktop / Tableau Public"
        ]
    },
    {
        "parent": "Data Visualization with MATLAB - Projects and Examples | Udemy",
        "children": [
            "Have MATLAB",
            "Have basic coding skills, preferably with MATLAB",
            "Have something to express by MATLAB"
        ]
    },
    {
        "parent": "Qlik Sense Masterclass for Data Science and BI | Udemy",
        "children": [
            "Basic knowledge of Qlik Sense",
            "Installation of Qlik Sense completed",
            "Basic knowledge of computers",
            "An appetite for learning",
            "A passion for data"
        ]
    },
    {
        "parent": "D3 4.x: Mastering Data Visualization | Udemy",
        "children": [
            "A text editor to edit and create HTML, CSS, and JavaScript files",
            "A modern web browser (Firefox 3, IE 9, Chrome, Safari 3.2, and later)",
            "A local HTTP server to host data files for some of the more advanced examples in this course. We will cover how to set up a Node-based and Python-based simple HTTP server in the first section",
            "Optionally, you will need a Git client if you would like to check out the example source code directly from the Git repository"
        ]
    },
    {
        "parent": "Complete Python & Matplotlib Data Visualization | Udemy",
        "children": [
            "Basic Knowledge of Computers and Mathematics",
            "A Windows PC/ Raspberry Pi with Internet Connection",
            "Zeal and enthusiasm to Learn",
            "Burning desire to take your career to the next level"
        ]
    },
    {
        "parent": "Tableau for Visual Analytics | Udemy",
        "children": [
            "No prior technical or analytical background is required.",
            "PC with Tableau 10 (trial version) installed",
            "No prior knowledge of Tableau is required; this course is designed for absolute beginners."
        ]
    },
    {
        "parent": "Machine Learning for Absolute Beginners - Level 3 | Udemy",
        "children": [
            "Python Basic Syntax",
            "Highly skilled working with the Pandas Library - Loading Datasets and Manipulating Data in a Data Frame.",
            "It is recommended to start with the Level 1 and Level 2 of the \"Machine Learning for Absolute Beginners\" training program"
        ]
    },
    {
        "parent": "Python: Data Visualization using Python | Udemy",
        "children": [
            "A basic knowledge of Python and basic data visualization is required."
        ]
    },
    {
        "parent": "Data visualization and Descriptive Statistics with Python 3 | Udemy",
        "children": [
            "Python Anaconda 3.6 using Jupyter notebook",
            "Introductory level of Python",
            "Introductory statistics"
        ]
    },
    {
        "parent": "Data Visualization Techniques | Udemy",
        "children": [
            "In this course you will learn data visualization best practices starting with understanding, preparing, validating, and matching your source data to the most appropriate display types. We will then work through examples of how to create compelling charts, including simple types such as line and bar charts, followed by more advanced charts including dot plots, box plots, and bullet graphs. Following this, you will learn how to create exceptional maps for geographic data, with a focus on dot density, choropleth, and categorical map types. Our final section will teach you how to visualize connected data sets using powerful network graphs."
        ]
    },
    {
        "parent": "Learning Path: Big Data Visualization | Udemy",
        "children": [
            "Basic knowledge of HTML, CSS, and JavaScript would be helpful, but is not manadatory",
            "Some experience with database, spreadsheet, and presentation software will be beneficial"
        ]
    },
    {
        "parent": "Build an Advanced Keylogger using C++ for Ethical Hacking! | Udemy",
        "children": [
            "This course will be much easier if you have some prior knowledge of C++."
        ]
    },
    {
        "parent": "Network Hacking Continued - Intermediate to Advanced | Udemy",
        "children": [
            "Computer with a minimum of 4GB ram/memory",
            "Operating System: Windows / OS X / Linux",
            "Finished the networks section of my general ethical hacking course OR",
            "Finished my network hacking course.",
            "For the wifi cracking ONLY - Wireless adapter that supports monitor mode (more info provided in the course)."
        ]
    },
    {
        "parent": "Windows Privilege Escalation for Beginners | Udemy",
        "children": [
            "Prior beginner hacking knowledge preferred",
            "Prior virtualization knowledge preferred",
            "A subscription to Hack the Box is required to complete the course.",
            "A subscription to TryHackMe is strongly recommended to complete the course."
        ]
    },
    {
        "parent": "Hands-on Penetration Testing Labs 1.0 | Udemy",
        "children": [
            "Basic Linux knowledge",
            "Basic networking knowledge",
            "Kali Linux",
            "Desktop or Laptop with a minimum of 2GB RAM (8GB+ preferable)",
            "VirtualBox",
            "Windows 7 or 10 host OS preferred (tested)"
        ]
    },
    {
        "parent": "Learn Ethical Hacking By Hacking Real Websites Legally | Udemy",
        "children": [
            "Basic knowledge of HTML, Javascript and SQL",
            "Basic understanding of GET and POST requests",
            "A Chrome browser"
        ]
    },
    {
        "parent": "Build Undetectable Malware Using C Language: Ethical Hacking | Udemy",
        "children": [
            "Programming Skills Are A Huge Plus - but not required",
            "Previous Basic Ethical Hacking Knowledge Is Needed",
            "Computer With A Minimum Of 4GB Ram/Memory",
            "Optional - Have Kali Linux Installed"
        ]
    },
    {
        "parent": "Linux Privilege Escalation for Beginners | Udemy",
        "children": [
            "Prior beginner hacking knowledge preferred",
            "Prior virtualization knowledge preferred",
            "Access to a Windows machine is preferred"
        ]
    },
    {
        "parent": "Master in Wi-Fi ethical Hacking | Udemy",
        "children": [
            "You should be able to use the computer only.",
            "Basic Knowledge on Linux OS",
            "Kali Linux Installed (Either in virtual box OR live Boot USB drive) and Wireless USB Adapter(not mandatory)"
        ]
    },
    {
        "parent": "Ethical Hacking - Capture the Flag Walkthroughs - v1 | Udemy",
        "children": [
            "MAC or PC capable of handling virtualizatio",
            "At least 4 GB of RAM (8 GB Preferred)",
            "Completion of 'Ethical Hacking Using Hands on Training' or any ethical hacking course (recommended).",
            "Comfortable using the Linux command line interface (CLI).",
            "Comfortable learning bits of programming code such as Python and PHP.",
            "Comfortable creating virtual machines.",
            "Comfortable with the English langauge."
        ]
    },
    {
        "parent": "The Complete Cyber Security Course : Part 1 - Foundation | Udemy",
        "children": [
            "You should have completed our first course on \"The Absolute Beginners Guide to Cybersecurity and Hacking\""
        ]
    },
    {
        "parent": "Website Hacking Course™: Earn Money by doing Bug Bounty | Udemy",
        "children": [
            "If you are interested in website hacking or if you want to start doing the bug hunting, that's all you need. You should be curious enough to learn it. No Extra things are required."
        ]
    },
    {
        "parent": "Practical Hacking: Undetectable Malware | Udemy",
        "children": [
            "Basic Knowledge of Hacking done some Beginner Hacking Course",
            "Knowledge of Basic Linux Commands",
            "Knowledge of Kali Linux",
            "Basic Knowledge of Metasploit",
            "Basic Knowledge of Exploit and Payload"
        ]
    },
    {
        "parent": "Offensive Security Engineering | Udemy",
        "children": [
            "Familiarity with Metasploit",
            "Penetration Testing Fundamentals",
            "Intermediate Programming Skills",
            "System Administration Fundamentals",
            "Computer Networks"
        ]
    },
    {
        "parent": "Hacking Techniques for IT Professionals 2.0 Complete Course | Udemy",
        "children": [
            "Finished IT Security Beginner Training",
            "IT knowledge",
            "Programming skills will be useful",
            "Basics of Linux systems"
        ]
    },
    {
        "parent": "Network Penetration Testing (Ethical Hacking) From Scratch | Udemy",
        "children": [
            "A basic understanding of networking",
            "Be able to understand the basics of using Linux based operating systems"
        ]
    },
    {
        "parent": "Learn Ethical Hacking & Reverse Engineering | Udemy",
        "children": [
            "Basic knowledge of HTML, Javascript and SQL",
            "Basic understanding of GET and POST requests",
            "A PC, Linux not required",
            "Basic knowledge in C, Assembly Language and Win32 API would be helpful but not mandatory"
        ]
    },
    {
        "parent": "Excel Shortcuts, Excel Tips, Excel Tricks - Excel Skills! | Udemy",
        "children": [
            "You only need to have the desire make Excel easier for yourself."
        ]
    },
    {
        "parent": "From Excel to Power BI | Udemy",
        "children": [
            "You must know how to use Excel. You must also know how to use Pivot Tables.",
            "If you do not know Pivot Tables well, you can check my \"Pivot Tables: Second Honeymoon\" course."
        ]
    },
    {
        "parent": "Learn Excel 2016 Intermediate Level - Beyond the Basics | Udemy",
        "children": [
            "Microsoft Excel 2016 desktop version for Windows installed and ready to use on your computer."
        ]
    },
    {
        "parent": "Use Excel Like A Pro. Fast. | Udemy",
        "children": [
            "None"
        ]
    },
    {
        "parent": "Data Analytics with Excel PivotTables | Udemy",
        "children": [
            "All you need is a Microsoft Excel installed on your desktop.",
            "With a basic know-how of Excel you are good to go ahead with this course"
        ]
    },
    {
        "parent": "Microsoft Excel for Finance, Accounting & Financial Analysis | Udemy",
        "children": [
            "Excel 2010 or later edition",
            "Basic working knowledge of Excel",
            "Depreciation and common methods of depreciation",
            "Basic knowledge of Finance like time value of money, compounding and discounting",
            "Concept of NPV and IRR"
        ]
    },
    {
        "parent": "7 Steps To Excel Success - Excel Skills And Power Tips | Udemy",
        "children": [
            "In this course you will become skilled in using Excel 2007, 2010, 2013, 2016. All the concepts you will learn are compatible with Excel 2007 to 2016.",
            "You just need to know how to find Excel on your computer.",
            "You are committed to life long learning. "
        ]
    },
    {
        "parent": "Essential Excel for Business Analysts and Consultants | Udemy",
        "children": [
            "Basic Excel",
            "Basic knowledge of economics or finance"
        ]
    },
    {
        "parent": "Excel Pivot Tables for Management Consultants & Analysts | Udemy",
        "children": [
            "Basic Excel",
            "Basic knowledge of economics or finance"
        ]
    },
    {
        "parent": "Excel 2016 (365) Intermediate Training Course | Office 365 | Udemy",
        "children": [
            "You will need a PC with Microsoft Windows and Excel 2016 installed on it"
        ]
    },
    {
        "parent": "Excel 2016 Advanced | Udemy",
        "children": [
            "Excel Introduction and Intermediate courses or equivalent experience."
        ]
    },
    {
        "parent": "Excel 2010 Intermediate | Udemy",
        "children": [
            "Introductory Excel training or equivalent knowledge"
        ]
    },
    {
        "parent": "Microsoft Access 365: Link Data to Excel with Macros and VBA | Udemy",
        "children": [
            "A very basic knowledge of Access and Excel"
        ]
    },
    {
        "parent": "Microsoft Excel Course - Intermediate Training | Udemy",
        "children": [
            "Excel basic knowledge",
            "Basic Excel formulas"
        ]
    },
    {
        "parent": "77-728 Microsoft Excel 2016 Expert Certification | Udemy",
        "children": [
            "Some knowledge of Microsoft Excel 2016 is assumed. Access to a PC using Windows and a copy of Microsoft Excel 2016 is required.",
            "Time to complete the lectures and exercises."
        ]
    },
    {
        "parent": "An Introduction to Profibus DP Networking | Udemy",
        "children": [
            "Working knowledge of the process control devices in a typical Process Automation or SCADA system",
            "Basic understanding of the operation of a Programmable Logic Controller",
            "Basic understanding of binary systems and computer memory"
        ]
    },
    {
        "parent": "How to automate and develop applications using Autoit | Udemy",
        "children": [
            "Be familiar with one scripting language",
            "A windows machine",
            "Internet connection (For installation and Final Project)"
        ]
    },
    {
        "parent": "Element Locators: 60 Minutes Crash Course for CSS & Xpath | Udemy",
        "children": [
            "Should have basic understanding of automation tool",
            "Should have basic understanding of need to locators"
        ]
    },
    {
        "parent": "An Introduction to the HART Protocol | Udemy",
        "children": [
            "Working knowledge of the process control devices in a typical Process Automation or SCADA system",
            "Working knowledge of the standard 4-20 mA loop connection",
            "Basic understanding of an Analog Input"
        ]
    },
    {
        "parent": "Create Automation Tool Using Ansible, Shell - Linux | Udemy",
        "children": [
            "PC or Laptop with internet Connection",
            "Basic Ansible, Shell Scripting is required and also system administrator experience would be very beneficial."
        ]
    },
    {
        "parent": "SQL Server 2016 – Maintenance and Automation | Udemy",
        "children": [
            "Should have basic knowledge of SQL Server."
        ]
    },
    {
        "parent": "Automation Hacks for Entrepreneurs | Udemy",
        "children": [
            "Nothing! Anyone can setup the hacks discussed in this course!"
        ]
    },
    {
        "parent": "Learning Path: Automation with Team Foundation Server | Udemy",
        "children": [
            "Basic knowledge of Team Foundation Server is needed"
        ]
    },
    {
        "parent": "Learn UI5 Compression Automation Task Runner Gulp StarterKit | Udemy",
        "children": [
            "Basic Knowledge of UI5"
        ]
    },
    {
        "parent": "Enterprise Automation with Python | Udemy",
        "children": [
            "Some basic programming knowledge with Python scripting would be necessary."
        ]
    },
    {
        "parent": "Automation and Hyperautomation | Udemy",
        "children": [
            "Understanding of key networking concepts",
            "Understanding of Linux server OS basics",
            "Understand of Windows Server basics (Core)",
            "Open mind : )"
        ]
    },
    {
        "parent": "Automation to Make Templates for Illustrator Scallop Pattern | Udemy",
        "children": [
            "Knowledge of Illustrator is an required",
            "Some pattern design experience in Illustrator is an asset"
        ]
    },
    {
        "parent": "Free Automation Tutorial - Ansible Essentials: Simplicity in Automation | Udemy",
        "children": []
    },
    {
        "parent": "Free Automation Tutorial - SALESmanago - Marketing Automation Academy | Udemy",
        "children": []
    },
    {
        "parent": "Advanced SQL Preparation: Expert Certification Training Course | Udemy",
        "children": [
            "Need to know SQL in basic level",
            "SQL Developer",
            "Oracle Database Software"
        ]
    },
    {
        "parent": "SQL Advanced: Build Advanced SQL Queries for SQL Developers | Udemy",
        "children": [
            "Brush up necessary SQL skills so that it is easy to follow the advanced concepts."
        ]
    },
    {
        "parent": "Learn SQL Tuning for SQL Query Optimization for Developers and DBAs | Udemy",
        "children": [
            "Database/SQL knowledge is a must to understand this course."
        ]
    },
    {
        "parent": "Sachin Quickly Learns (SQL) - Structured Query Language | Udemy",
        "children": [
            "MS Access 2007 or Higher or any other Database System"
        ]
    },
    {
        "parent": "SQL - Beyond The Basics | Udemy",
        "children": [
            "a working knowledge of SQL fundamentals"
        ]
    },
    {
        "parent": "Learn Advanced T-SQL For SQL Server Administrator | Udemy",
        "children": [
            "Before taking this course, you must take the prerequisite Learn T-SQL from Scratch.  While not mandatory, you should take the FREE Ultimate in Becoming a SQL DBA course as this will help you set up the environment. "
        ]
    },
    {
        "parent": "Project Based SQL Course: Code like a SQL Programmer | Udemy",
        "children": [
            "None! If you have access to a computer then you're ready to learn SQL"
        ]
    },
    {
        "parent": "Practical SQL Skills from Intermediate to Advanced | Udemy",
        "children": [
            "A good understanding of basic SQL",
            "Microsoft SQL Server Express (free download and the course explains everything)"
        ]
    },
    {
        "parent": "Learn How To Become an Azure SQL Database Architect | Udemy",
        "children": [
            "You'll need a FREE tier account on Windows Azure but don't create one now. We cover this in great detail before we start the course.",
            "Fast access to the internet will be very important. The cloud is a metaphor for internet based computing."
        ]
    },
    {
        "parent": "Oracle 12c SQL Tuning - the Ultimate Guide | Udemy",
        "children": [
            "Basics of Oracle SQL",
            "Basics of Oracle database architecture",
            "Familiarity with Linux operating system basics",
            "PC with 8GB RAM, 35GB free disk space, Windows"
        ]
    },
    {
        "parent": "Building an Automated SQL Server Performance Tuning Engine | Udemy",
        "children": [
            "A solid understanding of SQL Server",
            "Basic C# skills would be beneficial but aren't required.",
            "An Instance of SQL Server Installed",
            " Visual Studio 2015 Installed"
        ]
    },
    {
        "parent": "Practice SQL JOINS with 20 Query Challenges | Udemy",
        "children": [
            "No software is required",
            "You should have taken our \"Learn SQL Fundamentals Through 10 Pratice Problems\" course, or have a working knowledge of SQL",
            "General knowledge of JOINS"
        ]
    },
    {
        "parent": "SQL BootCamp 2020 - SQL for Beginners (SQL Mastery Course) | Udemy",
        "children": [
            "No prior experience is required. We will start from the very basics"
        ]
    },
    {
        "parent": "20 Queries - SUBQUERIES | Udemy",
        "children": [
            "No software is required",
            "You should have taken our \"Learn SQL Fundamentals Through 10 Pratice Problems\" course, or have a working knowledge of SQL",
            "General knowledge of subqueries"
        ]
    },
    {
        "parent": "Learn SASS and SCSS | Udemy",
        "children": [
            "You should have fundamental knowledge of HTML and CSS",
            "You should be able to use your PC or Mac operating system"
        ]
    },
    {
        "parent": "The Modern Flexbox, Grid, Sass & Animations Developer Course | Udemy",
        "children": [
            "Beginner level knowledge of HTML5 and CSS3 is required",
            "Have a computer + internet connection",
            "Completion of my \" The Ultimate HTML5 Elements &amp; CSS3 Properties BOOTCAMP \" is HIGHLY RECOMMENDED but not mandatory."
        ]
    },
    {
        "parent": "The Next Step with Sass and Compass | Udemy",
        "children": [
            "Understanding how to using Sass variables, mixins, extend, nesting and parent selectors"
        ]
    },
    {
        "parent": "Ultimate Theme Developer guide for Prestashop 1.7 | Udemy",
        "children": [
            "Student must have a basic knowledge of PHP, Javascript, HTML &amp; CSS"
        ]
    },
    {
        "parent": "Python GUI Programming Using PyQt5 | Udemy",
        "children": [
            "A basic knowledge of Python is recommended - A good pre-requisite would be the Python Masterclass available on this channel",
            "A computer running Windows or Linux, or a Mac so that the free IDE can be downloaded and install (full instructions included)."
        ]
    },
    {
        "parent": "PyQt Desktop Apps with Python | Udemy",
        "children": [
            "Experience with Python required",
            "No knowledge of PyQt required"
        ]
    },
    {
        "parent": "PyQt5 From A-Z | Udemy",
        "children": [
            "The students should be familiar with Python as a procedural language and as an object-oriented language. I do provide some back ground on objects in python but more experience would be beneficial."
        ]
    },
    {
        "parent": "Web Development w/ Google’s Go (golang) Programming Language | Udemy",
        "children": [
            "You must understand how to program with the Go programming language before taking this course. If you do not know how to program with Go, please take my course: \"Learn How To Code: Google's Go (golang) Programming Language\""
        ]
    },
    {
        "parent": "Master Go Programming: Learn to Write Idiomatic, Effective Code | Udemy",
        "children": [
            "With a focus on hands-on exercises, this video course is a step-by-step approach to take your Go skills to the next level and create an application all by yourself."
        ]
    },
    {
        "parent": "Collaboration and Crawling W/ Google's Go (Golang) Language | Udemy",
        "children": [
            "Prerequisite knowledge recommended for this course: familiarity with Google's Go (golang) programming language, and basic skills with git"
        ]
    },
    {
        "parent": "Unit, integration and functional Testing in Golang (Go) | Udemy",
        "children": [
            "Just complete the Official Go Tour available at Go's homepage"
        ]
    },
    {
        "parent": "Exploring The Go (golang) Programming Language | Udemy",
        "children": [
            "Prerequisite knowledge recommended for this course: familiarity with Google's Go (golang) programming language, and basic skills with git"
        ]
    },
    {
        "parent": "Learning Path: Go: Building Cloud Native Go Applications | Udemy",
        "children": [
            "Basic knowledge of the Go programming language.",
            "Basic knowledge of web services and web programming would be beneficial."
        ]
    },
    {
        "parent": "Mastering Multithreading Programming with Go (Golang) | Udemy",
        "children": [
            "Some experience of programming in Go (enough if you know how to use functions, loops, arrays and a bit of pointers).",
            "Recent version of Go installed.",
            "Being able to do 50 push-ups while shouting a unique prime number on each rep (just kidding)."
        ]
    },
    {
        "parent": "Getting started with Cloud Native Go | Udemy",
        "children": [
            "Some knowledge of web services and web programming will be sufficient to get you through the course."
        ]
    },
    {
        "parent": "Web Authentication, Encryption, JWT, HMAC, & OAuth With Go | Udemy",
        "children": [
            "Prerequisite knowledge recommended for this course: An Introduction to Google's Go (golang) Programming Language",
            "Prerequisite knowledge recommended for this course: Web Development using Google's Go (golang) Programming Language"
        ]
    },
    {
        "parent": "Hands-on Serverless Computing with Go | Udemy",
        "children": [
            "Having prior Go programming knowledge will helpful"
        ]
    },
    {
        "parent": "Advanced Cloud Native Go | Udemy",
        "children": [
            "ASSUMED KNOWLEDGE To fully benefit from the coverage included in this course, you will need: ●\tBasic programming skills and knowledge of the Go language ●\tFamiliarity with Git and GitHub for source control ●\t(Optional) Basic Docker knowledge, preferably from the first video course ●\t(Optional) Basic Kubernetes knowledge, preferably from the first video course",
            "EXERCISE FILES The exercise files in this course are: ●\tAvailable on GitHub ●\tStructured at a topic level. Each project contains the source code for the master solution.",
            "TECHNICAL REQUIREMENTS This course has the following software requirements: ●\tAn editor like Jetbrains Gogland or Visual Studio Code ●\tInstallation of Go Language 1.8.1 or later ●\tInstallation of Docker for Windows or Docker Toolbox ●\tInstallation of Minikube and Kubectl",
            "This course has been tested on the following system configuration: ●\tOS: Windows 10 ●\tProcessor: Dual Core 2.8 Ghz ●\tMemory: 20GB ●\tHard Disk Space:5GB ●\tVideo Card: 256MB Video Memory"
        ]
    },
    {
        "parent": "Go: Data Structures, Algorithms and Design Patterns with Go | Udemy",
        "children": [
            "Prior knowledge of basic Go programming would be advantageous."
        ]
    },
    {
        "parent": "Concurrency in Go (Golang) | Udemy",
        "children": [
            "Basic knowledge of Go Programming Language like loops, functions, methods.",
            "Installation of Go compiler and any IDE on the laptop."
        ]
    },
    {
        "parent": "Go Standard Library Solutions | Udemy",
        "children": [
            "Who are familiar with the basics of Go but want to learn more about the standard library and how to leverage it more readily in their code before running to third-party libraries."
        ]
    },
    {
        "parent": "Complete Guide to Application Development with Go | Udemy",
        "children": [
            "To take up this Learning Path, you will be required to have some prior knowledge with Go programming. Any developers willing to master Go programming to develop robust and resilient apps will feel perfectly comfortable in understanding the topics presented."
        ]
    },
    {
        "parent": "Projects in Laravel: Learn Laravel Building 10 Projects | Udemy",
        "children": [
            "Basic Knowledge of HTML, JavaScript and PHP is required to complete this course"
        ]
    },
    {
        "parent": "Laravel 8: E-Commerce Shop Website with PayPal System | Udemy",
        "children": [
            "PHP, Laravel"
        ]
    },
    {
        "parent": "Build E-Commerce Website in Laravel | Udemy",
        "children": [
            "Intermediate PHP knowledge",
            "Good Object Oriented Programming Skills",
            "Knowledge Of How Frameworks Work",
            "Basic Understanding Of Html &amp; Css",
            "Windows 7/8/8.1/10, Mac OS or Linux",
            "Stable Internet Connection",
            "Knowledge Of Using Command Line/Terminal",
            "Knowledge Of How To Download &amp; Install Programs In Your Operating System",
            "Laravel 5.6 &amp; Php 7",
            "Xampp local server"
        ]
    },
    {
        "parent": "Advanced Laravel and Vuejs - Build a Youtube clone | Udemy",
        "children": [
            "Basic understanding of the Laravel PHP framework",
            "Basic understanding of the Vuejs frontend framework"
        ]
    },
    {
        "parent": "Booking System in Laravel With Hybrid Mobile Version | Udemy",
        "children": [
            "Basics of Laravel",
            "PHP at the basic level",
            "Basics of object-oriented programming",
            "Basics of HTML, CSS, Java Script, jQuery, SQL",
            "The ability to install and configure software on Windows, Linux, Mac (in the course I am discussing the software to be installed without installation during the course)",
            "The ability to install local servers: Xamp, Wamp, Vagrant, Linux etc. (in the course I am discussing the software to be installed without installation during the course)",
            "Basics of MVC - Model View Controller"
        ]
    },
    {
        "parent": "Laravel 8.x:Dating Website | Udemy",
        "children": [
            "PHP, Laravel"
        ]
    },
    {
        "parent": "Laravel 8.x: Live Chat With Pusher | Udemy",
        "children": [
            "PHP, Laravel"
        ]
    },
    {
        "parent": "Build a Real-Time Online Game with Laravel | Udemy",
        "children": [
            "You should have a basic PHP skills and Object Oriented Programming.",
            "You should also basic basic HTML and CSS skills"
        ]
    },
    {
        "parent": "Build a Task Scheduler Admin Panel with Laravel | Udemy",
        "children": [
            "You should have a basic PHP skills and Object Oriented Programming.",
            "You should also basic basic HTML and CSS skills",
            "Must have Laravel Homestead already installed and ready to use"
        ]
    },
    {
        "parent": "Laravel Learning Management System - course sales platform | Udemy",
        "children": [
            "Be able to build a basic website with PHP"
        ]
    },
    {
        "parent": "Learning Path: Elasticsearch Integration with PHP & Laravel | Udemy",
        "children": [
            "Working knowledge of PHP and Laravel is required. Basic JSON knowledge and understanding of Java and related technologies is also required."
        ]
    },
    {
        "parent": "PHP Framework Masterclass with 3 Different Complete Projects | Udemy",
        "children": [
            "This course is not beginner",
            "You should know basic Fundamentals of Codeginetor",
            "You should know basic Fundamentals of Laravel",
            "You should know basic Fundamentals of CakePHP"
        ]
    },
    {
        "parent": "Angular and Laravel Passport Authentication | Udemy",
        "children": [
            "Laravel Intermediate Knowledge",
            "Angular Intermediate Knowledge"
        ]
    },
    {
        "parent": "PHP: The Complete PHP MVC Course | Udemy",
        "children": [
            "Basic Understanding of PHP OOP"
        ]
    },
    {
        "parent": "Learn MVC Frameworks with Phalcon PHP | Udemy",
        "children": [
            "Some knowledge of Relational Databases(mysql).",
            "Knowledge of Object Oriented Programming and PHP is useful but not absolutely essential.",
            "Windows is used as a development platform but the techniques used are easily adaptable for people on MacOS or Linux",
            "All other tools used are freely available and downloadable",
            "Xampp is used here but the techniques used are easily adaptable to other PHP webservers"
        ]
    },
    {
        "parent": "C# Intermediate Programming: Classes, Interfaces and OOP | Udemy",
        "children": [
            "Basic understanding of C# constructs: variables, type conversion, classes, conditionals and loops"
        ]
    },
    {
        "parent": "Object-Oriented Programming Using Java and Intellij Hands-On | Udemy",
        "children": [
            "A computer with internet connection to install java and Intellij",
            "Understand basics of java and can write simple programs"
        ]
    },
    {
        "parent": "Object-Oriented Software Engineering with Java | Udemy",
        "children": [
            "The course assumes that the student has a knowledge of the basic programming concepts with Java, including loops, methods, conditional statements, etc."
        ]
    },
    {
        "parent": "Java Object Oriented Programming:OOPS OOAD & Design Patterns | Udemy",
        "children": [
            "Java Basics",
            "Patience to Learn"
        ]
    },
    {
        "parent": "Object-Oriented Programming - From Basics to Advance (Java) | Udemy",
        "children": [
            "Knowing any programming language basics",
            "Understanding Java syntax"
        ]
    },
    {
        "parent": "C# Object Oriented Programming for Beginners in C# and .NET | Udemy",
        "children": [
            "Basic knowledge of C# is required.",
            "Visual Studio Code or Visual Studio Community Edition or Visual Studio or Visual Studio for Mac or any other IDE that supports C#.",
            "To complete the interactive elements of the course including coding challenges and exercises, you’ll need a laptop/desktop with an internet connection."
        ]
    },
    {
        "parent": "JavaScript for Coders: Learn OOP in JavaScript | Udemy",
        "children": [
            "Students should have basic knowledge of HTML and JavaScript"
        ]
    },
    {
        "parent": "Java Object-Oriented Programming: AP Computer Science B | Udemy",
        "children": [
            "Finish the AP Computer Science Part 1: Java Programming Essentials or equivalent course. ",
            "Minimum mathematical background: algebra I"
        ]
    },
    {
        "parent": "Advanced Java Programming with NetBeans | Udemy",
        "children": [
            "You should know basic Java programming"
        ]
    },
    {
        "parent": "Python Advanced:Objected Oriented Programming Masterclass | Udemy",
        "children": [
            "First and foremost requirement - Enthusiasm to learn!",
            "Python Basics - Fundamentals, Python Data Structures, File Handling (Must be well versed with basics).",
            "A Computer - Windows, Mac, or Linux. (You definitely have it!)",
            "Python3 and an IDE to work on.(As a Python intermediate programmer, you for sure have it!)"
        ]
    },
    {
        "parent": "PHP OOP Complete Practical Course | Udemy",
        "children": [
            "Basics of PHP (Procedural PHP)",
            "A little bit of HTML,  CSS and Bootstrap",
            "Basic software installation"
        ]
    },
    {
        "parent": "C++ Object Oriented Programming From Scratch | Udemy",
        "children": [
            "microsoft visual studio or any IDE for C++"
        ]
    },
    {
        "parent": "C# Advanced Programming OOP | Udemy",
        "children": [
            "Requirements are Finishing the Course C# Beginners Level Learn Development Fundamentals of C# or have previous knowledge in programming"
        ]
    },
    {
        "parent": "150+ Exercises - Object Oriented Programming in Python - OOP | Udemy",
        "children": [
            "completed 200+ Exercises - Programming in Python - from A to Z",
            "completed 210+ Exercises - Python Standard Libraries - from A to Z",
            "basic knowledge of OOP"
        ]
    },
    {
        "parent": "Learn PDO By Creating A CRUD Website (PHP & MySQL) | Udemy",
        "children": [
            "Basic understanding of HTML and CSS"
        ]
    },
    {
        "parent": "PHP with PDO: Build Task List Project with PDO, PHP & MySQL | Udemy",
        "children": [
            "Basics PHP Knowledge's",
            "A Computer with internet connection"
        ]
    },
    {
        "parent": "Free PDO Tutorial - Real Time Chat System Using PHP Mysql PDO and AJAX | Udemy",
        "children": []
    },
    {
        "parent": "Symfony beginner guide 2020 | Udemy",
        "children": [
            "PHP",
            "HTML",
            "CSS"
        ]
    },
    {
        "parent": "React Native: Advanced Concepts Tutorial | Udemy",
        "children": [
            "Basic understanding of React Native"
        ]
    },
    {
        "parent": "How To Build Tinder Clone with React Native & Firebase | Udemy",
        "children": [
            "You should know Javascript and have a basic knowledge of React"
        ]
    },
    {
        "parent": "How to Build an Instagram Clone w/ React Native & Firebase | Udemy",
        "children": [
            "Need to know basic javascript and helps to have used React before"
        ]
    },
    {
        "parent": "React Native Projects | Udemy",
        "children": [
            "Start building applications immediately with featured examples and an easy to follow approach. Our video is based on 3 modern mobile projects, focusing on core React Native topics."
        ]
    },
    {
        "parent": "Fastlane for React Native: Deploy your app autonomously! | Udemy",
        "children": [
            "A working computer",
            "A macOS computer is required for the iOS sections."
        ]
    },
    {
        "parent": "Master React Native by Developing a Full Cross-Platform App | Udemy",
        "children": [
            "A basic understanding of programming",
            "Some familiarity with javascript"
        ]
    },
    {
        "parent": "Using Google Maps API in React Native for iOS/Android | Udemy",
        "children": [
            "Know basic JavaScript",
            "Know fairly basic React Native"
        ]
    },
    {
        "parent": "Projects in React Native: Learn By Building Real World Apps | Udemy",
        "children": [
            "Basic Knowledge of JavaScript is important to complete the course"
        ]
    },
    {
        "parent": "React Native Recipes - Volume 1 | Udemy",
        "children": [
            "Existing knowledge of JavaScript ES2015 is highly recommended."
        ]
    },
    {
        "parent": "React Native Design Patterns | Udemy",
        "children": [
            "Who want to improve their skills to become more efficient and write better code with design patterns."
        ]
    },
    {
        "parent": "Learning Path: React: Modern Applications with React Native | Udemy",
        "children": [
            "Programming knowledge on JavaScript",
            "Basic knowledge on web development"
        ]
    },
    {
        "parent": "Learning React Native Development | Udemy",
        "children": [
            "No knowledge of React Native and mobile development is needed.",
            "Minimum Hardware Requirements: For successful completion of this course, students will require the computer systems with at least the following: •        OS: Windows or Mac •        Processor: Not Applicable •        Memory: 4GB or above •        Storage: 50GB free space",
            "Recommended Hardware Requirements: For an optimal experience with hands-on labs and other practical activities, we recommend the following configuration: •        OS: Mac •        Processor: Not Applicable •        Memory: 4GB or above •        Storage: 50GB free space",
            "Software Requirements: •        Operating system: Windows or Mac •        Browser: Google Chrome •        Atom IDE, Latest Version •        Node. js LTS 8.9.1 Installed"
        ]
    },
    {
        "parent": "Advance Music Platform for Web/Mobile (Reactjs+ReactNative) | Udemy",
        "children": [
            "Basic HTML, CSS, Javascript"
        ]
    },
    {
        "parent": "React Native Projects - Second Edition | Udemy",
        "children": [
            "A fundamental working knowledge of React and JavaScript is assumed."
        ]
    },
    {
        "parent": "From Idea to The App Store using React Native | Udemy",
        "children": [
            "Some JavaScript knowledge",
            "Some React/React Native knowledge"
        ]
    },
    {
        "parent": "Advanced iOS & Firebase: Rideshare | Udemy",
        "children": [
            "Must have a computer with OSX or macOS on it"
        ]
    },
    {
        "parent": "Ionic Apps with Firebase | Udemy",
        "children": [
            "Some experience with programming and development",
            "Aptitude for programming",
            "Enthusiasm to create something out-of-the-box",
            "A computer with Windows or Mac",
            "VS Code or any text editor",
            "A reliable internet connection"
        ]
    },
    {
        "parent": "Android Firebase Masterclass - Master Google Firebase | Udemy",
        "children": [
            "Previous Kotlin and/or Java experience (consider the Java Masterclass, Java Crash course and/or Kotlin for Java developers courses from the Learn Programming Academy).",
            "Previous Android app development experience (taking the Android Java and/or Android Kotlin courses from the Learn Programming Academy).",
            "A PC, Mac or Linux computer"
        ]
    },
    {
        "parent": "Beast Android Development: Firebase Necessities | Udemy",
        "children": [
            "Download and install Android Stuidos.",
            "Have two working android devices for development. Emulators are acceptable.",
            "Have an excellent grasp on the object oriented programing language java.",
            "Understand how to use android butterknife. ",
            "Understand how to use an event bus to decouple difference parts of an android application. We will be using Squares otto for this course. ",
            "Have a clear understanding of android topics such as the activity life cycle, flavors, and dialogs.",
            "Obtain your SHA1 development fingerprint",
            "Have excellent experience debugging android apps "
        ]
    },
    {
        "parent": "Make a Chat App! (Firebase : Swift in Xcode) | Udemy",
        "children": [
            "You NEED a Mac or something that run macOS.",
            "Xcode (Free)",
            "Firebase Account (Free to try)",
            "CocoaPods (Free)"
        ]
    },
    {
        "parent": "Firebase Authentication & Security Complete Guide | Udemy",
        "children": [
            "Intermediate JavaScript Knowledge"
        ]
    },
    {
        "parent": "Building Mobile Apps with Ionic 4 | Udemy",
        "children": [
            "No knowledge of Ionic is needed. Those with experience in Ionic 4 who are keen to learn its new features will also find this course useful."
        ]
    },
    {
        "parent": "Android and Firebase. Create a Live status update app. | Udemy",
        "children": [
            "Basic knowledge of Java",
            "Basic Android development skills",
            "Basic XML"
        ]
    },
    {
        "parent": "iOS with Swift & Firebase | Udemy",
        "children": [
            "Basic understanding of programming",
            "Familiarity with any IDE such as XCode or similar"
        ]
    },
    {
        "parent": "Creating a Backend for iOS — Firebase | Udemy",
        "children": [
            "Prior programming knowledge will be beneficial."
        ]
    },
    {
        "parent": "iOS Firebase Masterclass - Real time Database and Firestore | Udemy",
        "children": [
            "A Mac computer (preferably with latest OS)",
            "Xcode 10.1 or later (Xcode comes with Mac, update it if necessary, through Apple app store)",
            "CocoaPods 1.4.0 or later (how to install and setup is shown in this course)",
            "iOS platform and Swift Language background is preferred",
            "iOS physical device, for push notifications section",
            "Paid Apple developer account, for push notifications section"
        ]
    },
    {
        "parent": "Android Firebase Firestore - Masterclass - Build a Shop App | Udemy",
        "children": [
            "A Windows, Mac or Linux Computer",
            "Basic Android Developer knowledge (e.g. completed first half of my Android Masterclass)"
        ]
    },
    {
        "parent": "iOS 14 & Swift Chat Application Like Whatsapp Viber Telegram | Udemy",
        "children": [
            "xCode (Free from Apple)",
            "Mac",
            "Experience with Swift and xCode"
        ]
    },
    {
        "parent": "Firebase Cloud Messaging & Android Notification Styles | Udemy",
        "children": [
            "Basic knowledge of building android application in android studio is enough"
        ]
    },
    {
        "parent": "iOS 13 & Swift 5: Chat App With Firestore | MVVM | Udemy",
        "children": [
            "Basic knowledge of Swift and Xcode is preferred",
            "A Mac computer"
        ]
    },
    {
        "parent": "Taxi App in React Native | Udemy",
        "children": [
            "Basic JavaScript ES6",
            "Basic knowledge of React Native"
        ]
    },
    {
        "parent": "Cross Platform Native iOS & Android in Xamarin C# & Firebase | Udemy",
        "children": [
            "Basic Understanding of Computer Programming in any Discipline",
            "Understanding of Mobile Apps in General"
        ]
    },
    {
        "parent": "Learning ZURB Foundation | Udemy",
        "children": [
            "This course is designed for users that already have experience with HTML5, CSS, and basic website construction."
        ]
    },
    {
        "parent": "The Complete Intermediate Android Masterclass | Udemy",
        "children": [
            "Be Able to Build Android Apps",
            "Must Know Java Programming Language",
            "Be Willing to Work and Learn"
        ]
    },
    {
        "parent": "Android + Firebase Username/Password Authentication | Udemy",
        "children": [
            "Basic Knowledge of Android SDK",
            "Basic Knowledge of Android Studio Environment"
        ]
    },
    {
        "parent": "Blynk mobile development for Arduino | Udemy",
        "children": [
            "Working knowledge of the Arduino IDE.",
            "Ability to write simple programs for the Arduino.",
            "Have at least one Arduino board (two boards needed if you want to try out a dual-device project).",
            "See free Lectures 2 and 3 for detailed software and hardware requirements."
        ]
    },
    {
        "parent": "Webassembly OpenCV Apache Cordova | Udemy",
        "children": [
            "Basic HTML CSS Javascript knowledge",
            "Hardware: 2GB RAM 16GB of hard drive"
        ]
    },
    {
        "parent": "React Native Instagram Clone with Hooks, Redux, Navigation | Udemy",
        "children": [
            "Javascript"
        ]
    },
    {
        "parent": "Building Mobile Progressive Web Applications with Angular | Udemy",
        "children": [
            "A decent understanding Angular 2 or higher.",
            "Ideally have your own Angular app to use to follow along (though this is not strictly necessary)."
        ]
    },
    {
        "parent": "Spring Boot Microservices with Spring Cloud Beginner to Guru | Udemy",
        "children": [
            "Must know Java and Spring Framework",
            "Basic Docker Skills",
            "SQL Skills - MySQL is used in course",
            "Linux skills helpful"
        ]
    },
    {
        "parent": "Spring Boot For Software Engineers | Udemy",
        "children": [
            "You should be familiar with Java",
            "You should be able to use an IDE"
        ]
    },
    {
        "parent": "Microservices With Spring Boot and Spring Cloud | Udemy",
        "children": [
            "Java Language and Basic Maven",
            "Some knowledge of the Spring Framework would be required.",
            "Ability to install JDK, MySQL, Git on a PC / Mac",
            "No knowledge of Spring Boot is expected at all."
        ]
    },
    {
        "parent": "Ready for Production with Spring Boot Actuator | Udemy",
        "children": [
            "Java",
            "Spring Framework",
            "Spring Boot",
            "Basic Linux Skills",
            "Basic Maven Skills"
        ]
    },
    {
        "parent": "Spring Professional Certification Exam Tutorial - Module 04 | Udemy",
        "children": [
            "Java",
            "Maven",
            "IDE of your choice"
        ]
    },
    {
        "parent": "Practical World Java Spring Microservices | Udemy",
        "children": [
            "Java, Maven,MySQL, Legacy Spring MVC, REST API, Apache Tomcat"
        ]
    },
    {
        "parent": "Full Stack HATEOAS: Spring Boot 2.1, ReactJS, Redux, | Udemy",
        "children": [
            "Basic Knowledge of Java and Spring Boot",
            "Practical experience building at least one simple CRUD App (MySQL, H2) with Spring Boot is a MUST",
            "Basic Knowledge of HTML, CSS, Javascript (ES6 Syntax is Mandatory)",
            "Have an IDE of Choice for Spring development (IntelliJ, Eclipse, STS, etc)",
            "Previous experience with .jsp, Thymeleaf will come in handy",
            "Basic Knowledge of Git and a Github account is a MUST",
            "Previous basic experience with React / Redux is a MUST (FREE COURSE INSIDE!)"
        ]
    },
    {
        "parent": "Learning Path: Spring and Spring Boot Projects | Udemy",
        "children": [
            "If you know Java and have a computer with an internet connection, then that’s all you need to get started!"
        ]
    },
    {
        "parent": "Spring Boot: A quick tutorial guide | Udemy",
        "children": [
            "Background knowledge of Spring framework",
            "Knowledge of Java"
        ]
    },
    {
        "parent": "Spring Boot 2 Microservice Messaging in RabbitMQ and AWS SQS | Udemy",
        "children": [
            "Understanding of Spring Framework",
            "Some understanding of Spring Boot 2",
            "Understanding of Java, Maven and Gradle"
        ]
    },
    {
        "parent": "Spring 5.0 Microservices | Udemy",
        "children": [
            "Prior knowledge of Java is assumed."
        ]
    },
    {
        "parent": "Advanced Spring Boot | Udemy",
        "children": [
            "Basics of Spring Boot"
        ]
    },
    {
        "parent": "Spring Boot 2.0: Apps & Microservices | Udemy",
        "children": [
            "No prior knowledge of Spring Boot is assumed. However, a basic knowledge of Java and Spring would be beneficial."
        ]
    },
    {
        "parent": "Solr search & querying using java spring boot application | Udemy",
        "children": [
            "Have basic java Knowledge"
        ]
    },
    {
        "parent": "Spring Boot Data JPA, Entity Mappings | Udemy",
        "children": [
            "Knowledge in Core Java",
            "Good to have prior knowledge in Spring Core(Spring Beans &amp; Life Cycle,) Autowiring, REST API",
            "Knowledge in SQL queries"
        ]
    },
    {
        "parent": "Hands-On Microservices with Spring Boot 2.0 | Udemy",
        "children": [
            "No knowledge of the microservice architecture is required.",
            "A basic understanding of the Spring ecosystem and Java programming is needed."
        ]
    },
    {
        "parent": "The Java Spring Tutorial: Learn Java's Popular Web Framework | Udemy",
        "children": [
            "Fair knowledge of the Java programming language",
            "Knowledge of HTML, servlets and JSPs is recommended for the web section of this tutorial",
            "Some acquaintance with XML is helpful",
            "Knowledge of SQL and databases is helpful for the database-related parts of this tutorial"
        ]
    },
    {
        "parent": "Full Stack: Angular and Spring Boot | Udemy",
        "children": [
            "Spring Boot experience is required.",
            "No experience required for Angular. I will teach you Angular from the beginning."
        ]
    },
    {
        "parent": "Full Stack Project: Spring Boot 2.0, ReactJS, Redux | Udemy",
        "children": [
            "Practical knowledge of the Java language syntax",
            "Previous hands on experience with basic CRUD operations using the Spring framework, JPA, MySQL",
            "Hands on experience developing and running Spring CRUD applications with one of the following IDE's: STS, IntelliJ, Eclipse",
            "Familiarity with HTML, CSS, and JavaScript (ES6 Syntax is important)",
            "Have local environment set up for Spring Framework - Spring boot development (Java 8, Maven, MySQL, MySQL Workbench)"
        ]
    },
    {
        "parent": "Reactive Programming with Spring Framework 5 | Udemy",
        "children": [
            "Knowledge of Java and the Spring Framework is required"
        ]
    },
    {
        "parent": "Spring Framework DevOps on AWS: Build Spring Boot Applications | Udemy",
        "children": [
            "Java",
            "Spring Framework (Beginner / Intermediate Level)",
            "Basic Knowledge of Maven",
            "Basic Linux Skills"
        ]
    },
    {
        "parent": "Spring Core Advanced - Beyond the Basics | Udemy",
        "children": [
            "Students should be comfortable programming in Java and using Maven to build Java projects",
            "Students should know about the core features of Spring around dependency injection and inversion of control (IoC)"
        ]
    },
    {
        "parent": "Spring Professional Certification Exam Tutorial - Module 02 | Udemy",
        "children": [
            "Java",
            "Maven",
            "IDE of your choice"
        ]
    },
    {
        "parent": "Spring Professional Certification Exam Tutorial - Module 03 | Udemy",
        "children": [
            "Java",
            "Maven",
            "IDE of your choice"
        ]
    },
    {
        "parent": "SPRING 5 (Covers Annotation & XML Config) + Hibernate | Udemy",
        "children": [
            "Core Java",
            "Basic typing skills are recommended with file system operations",
            "A computer with an Internet connection",
            "Basic knowledge of SQL will help (Recommended)",
            "Dedication for learning"
        ]
    },
    {
        "parent": "Let's begin with Spring Batch Framework | Udemy",
        "children": [
            "Before you enroll this course, you must have the knowledge of the Java programming language and basic knowledge of Spring framework."
        ]
    },
    {
        "parent": "Spring Professional Certification Exam Tutorial - Module 08 | Udemy",
        "children": [
            "Java",
            "Maven",
            "IDE of your choice"
        ]
    },
    {
        "parent": "Spring Framework - Social SignIn, PayPal, JMS, Velocity | Udemy",
        "children": [
            "Prior Knowledge Of Java Required.",
            "Prior Knowledge Of Spring MVC and Its Concepts Required."
        ]
    },
    {
        "parent": "Essentials of Spring 5.0 for Developers | Udemy",
        "children": [
            "A good understanding of Java is assumed."
        ]
    },
    {
        "parent": "Spring 5.0 Project: Building a Travel Website | Udemy",
        "children": [
            "Java developers with a reasonable knowledge of the Spring framework,"
        ]
    },
    {
        "parent": "Spring Design Patterns and Best Practices | Udemy",
        "children": [
            "A basic knowledge of the Spring Framework and Java is assumed."
        ]
    },
    {
        "parent": "Service Design: Designing for Experience Over Time | Udemy",
        "children": [
            "You should have a large workspace where you can spread out all of the course materials",
            "(Optionally) You should have a friend who can work through the course with you"
        ]
    },
    {
        "parent": "UX Research for Apps: User-centric from Concept to Launch | Udemy",
        "children": [
            "No specific skills or tools are required: just an open mind! ",
            "You may have a background in UX design...or not (either is OK) ",
            "You may be involved in a developing an App (or not)",
            "You may have a background in research (or not)",
            "You may practiced some of the techniques previously (or not)"
        ]
    },
    {
        "parent": "Advanced User Experience (UX) Design | Udemy",
        "children": [
            "You should have a basic understanding of usability and user experience issues",
            "You will need a computer with an Internet connection, and a modern web browser"
        ]
    },
    {
        "parent": "User Experience Tools: The Complete Guide to Personas | Udemy",
        "children": [
            "Basic entrepreneurship or business knowledge",
            "An introduction to UX design or Design Thinking is beneficial but not required"
        ]
    },
    {
        "parent": "User Testing | Udemy",
        "children": [
            "Laptop or desktop with camera"
        ]
    },
    {
        "parent": "Designing for Productivity in the User eXperience | Udemy",
        "children": [
            "Some background, experience and interest in designing optimized software and/or website user interfaces will make it easier to digest the material in this course."
        ]
    },
    {
        "parent": "How To Ace Your UX Design Interview and Land Your Dream Job! | Udemy",
        "children": [
            "Ability to learn with an open mind about UX Design Job Industry",
            "Beginner and Senior Level Experience as a UX/UI/Visual/Product Designer",
            "Those who want to make transition to UX Design Industry"
        ]
    },
    {
        "parent": "UX Design - Understanding the User and Business | Udemy",
        "children": [
            "Basics of User Experience Design"
        ]
    },
    {
        "parent": "Advanced UX Techniques - Novice to Pro! | Udemy",
        "children": [
            "Basic familiarity with UX is helpful, but not mandatory."
        ]
    },
    {
        "parent": "Run your own Research and Usability Testing | Udemy",
        "children": [
            "Basic notions of UX"
        ]
    },
    {
        "parent": "Designing Usable and Effective Business Dashboards | Udemy",
        "children": [
            "Axure RP (30 days free trial version available)",
            "No previous design experience needed but willingness to learn is a must."
        ]
    },
    {
        "parent": "How to experimentally test your UI design | Udemy",
        "children": [
            "No"
        ]
    },
    {
        "parent": "Implement High Fidelity Designs with Material-UI and ReactJS | Udemy",
        "children": [
            "Be comfortable with React JS -- this is an intermediate level course!",
            "Mac or Windows Computer"
        ]
    },
    {
        "parent": "Typography for Designers & Developers - Don't suck at design | Udemy",
        "children": [
            "Must have good knowledge of Adobe Photoshop (For Designers)",
            "Must know HTML and CSS (For Developers)",
            "Download and Install Adobe Photoshop Latest version"
        ]
    },
    {
        "parent": "Enhancement with Unity UI Advanced | Udemy",
        "children": [
            "If you are C# developer with good grips on Unity, this video will take your UI development skills to the next level, boosting up your confidence to build powerful interfaces to improve your user experience."
        ]
    },
    {
        "parent": "Learn Unity's New UI Tools | Udemy",
        "children": [
            "You should have Unity 4.6 or greater already installed"
        ]
    },
    {
        "parent": "Automated UI Testing in Android | Udemy",
        "children": [
            "The approach is mainly practice-oriented and mostly based on practical samples. During the course, you'll make some samples and then enhance them step-by-step, covering more advanced topics.a"
        ]
    },
    {
        "parent": "ASP.Net MVC Quick Start | Udemy",
        "children": [
            "You should at least be a little familiar with Web Programming in HTML, javascript, and CSS",
            "We will go through installing the tools you need",
            "We will cover everything you need to understand and be able to build and deploy a public-facing website to enhance your resume/e-portfolio"
        ]
    },
    {
        "parent": "Live Project On ASP.Net Core 2.0 MVC(Formerly ASP.Net MVC 5) | Udemy",
        "children": [
            "SQL Server 2008 Express or Higher",
            "VS2013 express or higher"
        ]
    },
    {
        "parent": "Building a ASP.NET MVC 5 Membership Website | Udemy",
        "children": [
            "Have a basic understanding of MVC 5.",
            "have a basic understanding of HTML5 and CSS3.",
            "Be proficient in C#."
        ]
    },
    {
        "parent": "Learn ASP NET MVC 5 step by step | Udemy",
        "children": [
            "Downlaod and install visual studio 2013 express which is free available. or if it is not possbile then please contact me i will provide Virtual Machine with all the softwares installed in that for learning purpose."
        ]
    },
    {
        "parent": "AngularJS For ASP.NET MVC Developers | Udemy",
        "children": [
            ".NET",
            "Knowing AngularJS is not needed"
        ]
    },
    {
        "parent": "The Complete Issue & Project Tracking Software : ASP.NET MVC | Udemy",
        "children": [
            "Knowledge of HTML,CSS,C#,ASP .NET MVC, Javascript, JQuery, JSON,Entity Framework,Linq,T-SQL and Solid Principles",
            "Visual Studio Community Editions",
            "SQL Server Express Editions"
        ]
    },
    {
        "parent": "Step-by-step Tutorial for Building Real-time Projects | Udemy",
        "children": [
            "Prior knowledge of C#.NET, ADO, MVC",
            "Knowledge of HTML, CSS"
        ]
    },
    {
        "parent": "Web Development Fundamentals (MS 98-363) practice exams | Udemy",
        "children": []
    },
    {
        "parent": "Mastering ASP.NET MVC5 : An In-depth Course | Udemy",
        "children": [
            "To start this course, you should be familiar with C#, Visual Studio and SQL Server."
        ]
    },
    {
        "parent": "Graphic Design Masterclass Intermediate: The NEXT Level | Udemy",
        "children": [
            "This is an intermediate level course: Basic working knowledge of Adobe Photoshop, Illustrator and InDesign - Some familiarity with basic tools and functionality",
            "Adobe Creative Cloud Highly Suggested, but older versions can still be used. Some tools like the content aware and shapebuilder tools will not be available on CS 5.5 or earlier versions."
        ]
    },
    {
        "parent": "T-Shirt Design Workshop 02: Mixed Media Design | Udemy",
        "children": [
            "Students should have some prior knowledge of Photoshop and Illustrator. Skills such as how to scan images into Photoshop, an understanding of layers, and how to size images. This is not a basic entry level course for Photoshop and Illustrator. "
        ]
    },
    {
        "parent": "365 Days of Creativity: Build Your Creative Skills One Day at a Time | Udemy",
        "children": [
            "Basic experience using Adobe Photoshop, Illustrator and InDesign.",
            "Access to Adobe applications, preferably current Creative Cloud versions.",
            "A keen, self-motivated learner looking for a long-term creative challenge."
        ]
    },
    {
        "parent": "Graphic Design Mastery: The FULL Branding & Design Process | Udemy",
        "children": [
            "Have access to the following programs to get the most out of this course: Adobe Illustrator, Photoshop, Xd and Dimensions (though this one is not required to work through most of the class)",
            "Have basic skills in Adobe Illustrator and Adobe Photoshop"
        ]
    },
    {
        "parent": "Passive Income Course for Graphic Designers | Udemy",
        "children": [
            "Intermediate Level Graphic Designer – Knowledge of Adobe Illustrator or Photoshop"
        ]
    },
    {
        "parent": "Graphic Design Bootcamp: Advanced Training Using Adobe CC | Udemy",
        "children": [
            "You should be passionate about learning more about Graphic Design",
            "Mac or PC with access to Adobe Creative Cloud apps. Specifically, Photoshop, Illustrator, InDesign, and Lightroom",
            "This is a continuation of Graphic Design Bootcamp: Part 1, so it's ideal if you have completed that course but it's not required."
        ]
    },
    {
        "parent": "The Branding Masterclass The Entire Brand Design Process | Udemy",
        "children": [
            "Access to Photo Editing and a Vector Editing Program (This course uses Adobe Photoshop and Adobe Illustrator)",
            "Basic Working Knowledge of a Photo Editing or Vector Editing Program"
        ]
    },
    {
        "parent": "Packaging Design and 3D Mock-up Using Adobe Illustrator 2020 | Udemy",
        "children": [
            "This course starts teaching you from scratch so there are no prerequisites."
        ]
    },
    {
        "parent": "GIMP 2.8/2.10 Intermediate: Free Graphic Design Software | Udemy",
        "children": [
            "A PC or Mac on which to run the GIMP",
            "A basic understanding of the GIMP"
        ]
    },
    {
        "parent": "Typography & Social Media Using Adobe Illustrator CC 2020 | Udemy",
        "children": [
            "This course starts teaching you from scratch so there are no prerequisites."
        ]
    },
    {
        "parent": "Creative design -Develop Innovative Ideas: Be a Creative Pro | Udemy",
        "children": [
            "ANDROID DEVICE / COMPUTER /DESKTOP/MAC/IOS DEVICE  ANY YOU HAVE SOURCE ALL IS COMPATIBLE",
            "RELAX MIND /CALM MOOD FOR LEARN NEW SKILL",
            "You will need a laptop or desktop computer and an Internet connection. No previous design skills required.",
            "And a great attitude!",
            "Beginners and busy people welcome.",
            "No expensive software required.",
            "No prior knowledge or experience is required, this is a beginners course",
            "Course in English .But instructor know Hindi also so you can also ask in Hindi language"
        ]
    },
    {
        "parent": "Photoshop & Dimension: 3D Design Effects | Udemy",
        "children": [
            "Intermediate knowledge of Photoshop",
            "Basic knowledge of 3D design",
            "Some familiarity with Dimension CC"
        ]
    },
    {
        "parent": "Adobe InDesign CC - Advanced Tips & Tricks | Udemy",
        "children": [
            "This course assumes you have a working knowledge of Adobe InDesign."
        ]
    },
    {
        "parent": "Adobe InDesign Advanced Keyboard Shortcuts | Udemy",
        "children": [
            "Basic knowledge of working in Adobe InDesign"
        ]
    },
    {
        "parent": "Make Best-Selling Fan Art | Udemy",
        "children": [
            "Basic knowledge of Adobe Illustrator and/or Photoshop"
        ]
    },
    {
        "parent": "Master the Adobe Photoshop Keyboard Shortcuts | Udemy",
        "children": [
            "Must preferably have a good working knowledge of Adobe Photoshop",
            "Must preferably be a Adobe Photoshop user on a Apple Mac for this course"
        ]
    },
    {
        "parent": "Advanced SEO Keyword Research - Creative Keyword Research | Udemy",
        "children": [
            "Be excited to apply creative techniques in this course to discover more keywords and get more highly-converting traffic"
        ]
    },
    {
        "parent": "2017 Affiliate Marketing + SEO Strategy - Mastery Course | Udemy",
        "children": [
            "We will use Wordpress to design our niche website, but don't install it! We'll cover this in lecture 3"
        ]
    },
    {
        "parent": "SEO Training - Master The Art Of Search Engine Optimization | Udemy",
        "children": [
            "All you need is an open mind and a willingness to learn - ENROLL TODAY!"
        ]
    },
    {
        "parent": "Voice Search SEO For Local Business & Ecommerce Products | Udemy",
        "children": [
            "Be excited and inspired to get in early on the future of SEO and ride the wave of rapid growth!"
        ]
    },
    {
        "parent": "SEO For WordPress [Part 1]: On-Page SEO Secrets | Udemy",
        "children": [
            "Basic knowledge of WordPress",
            "Basic knowledge of SEO",
            "You should know which keywords you want to rank for in Google"
        ]
    },
    {
        "parent": "SEO: How I recovered 50+ Sites FAST using this SEO Strategy! | Udemy",
        "children": [
            "No experience is needed",
            "english skills",
            "basic computer skills"
        ]
    },
    {
        "parent": "SEO OnPage SECRETS - The PROVEN Formula for Nr #1 Rankings! | Udemy",
        "children": [
            "No experience is needed",
            "english skills",
            "basic computer skills"
        ]
    },
    {
        "parent": "International SEO: Reaching a Profitable Global Audience | Udemy",
        "children": [
            "A basic understanding of search engine optimization (SEO) is helpful.",
            "A desire to expand online audience globally. ",
            "No software is required. Free and premium tools presented."
        ]
    },
    {
        "parent": "Backlinks University - Link Building Strategies for 2020 | Udemy",
        "children": [
            "Basic SEO knowledge",
            "Have a blog or business website"
        ]
    },
    {
        "parent": "SEO Course for Intermediates | Udemy",
        "children": [
            "You should already be familiar with all important areas and tools used today in digital marketing. "
        ]
    },
    {
        "parent": "The Best Pinterest SEO Course Of All Time | Udemy",
        "children": [
            "A Pinterest Account",
            "Basic SEO Knowledge",
            "A Computer and An Internet Connection",
            "Something To Promote",
            "Desire To Take Your Marketing Game To The Next Level"
        ]
    },
    {
        "parent": "SEO For WordPress [Part 2]: On-Page SEO Secrets | Udemy",
        "children": [
            "You need to watch part 1 of this video course first",
            "Basic knowledge of WordPress",
            "Basic knowledge of SEO"
        ]
    },
    {
        "parent": "Hospitality Marketing Website Traffic & SEO SECRETs for 2020 | Udemy",
        "children": [
            "In the hospitality marketing industry with a direct booking website &amp; accommodation",
            "Beginner or basic understanding of SEO and/or Keyword Research",
            "Beginner or basic understanding of Content Marketing &amp; Content Writing",
            "Beginner or basic understanding of Google My Business Listing"
        ]
    },
    {
        "parent": "Real Estate SEO - The Formula to Boost Traffic and Sales! | Udemy",
        "children": [
            "good english skills",
            "basic computer skills"
        ]
    },
    {
        "parent": "create a search engine for your website! | Udemy",
        "children": [
            "a working computer ",
            "knowing how to write in English ",
            "and xampp, i will show you how to install"
        ]
    },
    {
        "parent": "Blogging to Generate Leads: Business Blogging Essentials | Udemy",
        "children": [
            "You'll need a computer with access to the internet and the determination to take action and follow through on making things happen"
        ]
    },
    {
        "parent": "Install a Wordpress Blog From Scratch and Start Making Money | Udemy",
        "children": [
            "Basic computer skills",
            "PC or MAC computer",
            "Ability to problem solve and follow basic technical instructions"
        ]
    },
    {
        "parent": "8 Simple Steps To Automating Tumblr For Profit | Udemy",
        "children": [
            "Internet connection",
            "Accounts with Pinterest, Google, Tumblr"
        ]
    },
    {
        "parent": "Generate a Successful Business with a Blog and Facebook Page | Udemy",
        "children": [
            "You should already be familiar with Wordpress (I recommend our free 1-Hour Wordpress Basic Tutorial)",
            "Take this free course before enrolling: https://www.udemy.com/1-hour-wordpress-basic-tutorial"
        ]
    },
    {
        "parent": "Write, Publish, Repeat: How to guide for business blogging | Udemy",
        "children": [
            "Have a blog setup and ready to go"
        ]
    },
    {
        "parent": "The Essentials of Blog Writing&Content Creating in 2020-Mini | Udemy",
        "children": [
            "No special requirements"
        ]
    },
    {
        "parent": "If You’re Going to Blog, Why Not Make It Awesome! | Udemy",
        "children": [
            "A desire to use your knowledge to benefit others and make a little money"
        ]
    },
    {
        "parent": "How to create your FREE Blogs with blogger.com: Intermediate | Udemy",
        "children": [
            "Gmail account, Firefox"
        ]
    },
    {
        "parent": "Hexo - Make a Blazing Blog | Udemy",
        "children": [
            "Experience with a terminal"
        ]
    },
    {
        "parent": "Blogging Classic Guide: How to Make a Succesfull Blog | Udemy",
        "children": [
            "No prior knowledge is necessary. This course starts with the basics before diving into more advanced tips and strategies.",
            "The main requirement is a willingness to commit to the process and put in the work. This course outlines the steps, but it's up to you to take action and do what it takes to make your blog a success."
        ]
    },
    {
        "parent": "How to become a Travel Blogger - Get paid to travel | Udemy",
        "children": [
            "Work hard",
            "Free time"
        ]
    },
    {
        "parent": "Blog marketing as your home business | Udemy",
        "children": [
            "Able to read is enough."
        ]
    },
    {
        "parent": "Free Blogging Tutorial - The Proven Guide to Monetizing Your Blog | Udemy",
        "children": []
    },
    {
        "parent": "WordPress + E-Commerce Mastery: Build Your Own Online Store | Udemy",
        "children": [
            "Basic WordPress knowledge is required.",
            "A purchased domain with hosting is required.",
            "A computer with internet connection is required.",
            "We recommend you to take our WordPress for beginners course first, to help you with building your website."
        ]
    },
    {
        "parent": "2020 - How To Start An Ecommerce Business: Amazon, Ads & SEO | Udemy",
        "children": [
            "Be excited to sell more products in the most effective ways! Have an ecommerce business"
        ]
    },
    {
        "parent": "Laravel 8.x: ECOM SHOP | Udemy",
        "children": [
            "PHP, Laravel"
        ]
    },
    {
        "parent": "Build a Multi-Million Dollar Ecommerce Business | Udemy",
        "children": [
            "You should already have a store up and running.",
            "If you follow these steps and trust the system, you'll grow your ecommerce store fast.",
            "You will need to know that you're ready to scale your business."
        ]
    },
    {
        "parent": "Ecommerce Marketing Strategy: Repeat Sales Email Sequence | Udemy",
        "children": [
            "Students should have a general understanding of marketing concepts and want a proven success strategy for effectively driving repeat sales."
        ]
    },
    {
        "parent": "Unique & Specific Ways to Increase Your Ecommerce Engagement | Udemy",
        "children": [
            "Computer and any image editing program"
        ]
    },
    {
        "parent": "Ultimate Entrepreneurs Guide to Building an E-commerce Brand | Udemy",
        "children": [
            "Willingness to learn and grow your professional skills and digital knowledge.",
            "Open-mindedness and an interest in entrepreneurship and e-commerce.",
            "Interested in learning more about direct-to-consumer (DTC) brands.",
            "Computer and internet to access the course content."
        ]
    },
    {
        "parent": "eCommerce Analytics - Customer Segmentation | Udemy",
        "children": [
            "Hands-on experience in functional and operational sides of eCommerce platforms.",
            "Advanced Excel skills will be useful."
        ]
    },
    {
        "parent": "How to design and build your online brand | Udemy",
        "children": [
            "Internet connection",
            "Basic knowledge of online technologies"
        ]
    },
    {
        "parent": "E-Commerce Services Specialist practice exams | Udemy",
        "children": []
    },
    {
        "parent": "Shopify Tutorial For Beginners 2018 | Udemy",
        "children": [
            "Just a basic internet and computer manipulation knowledge"
        ]
    },
    {
        "parent": "eCommerce - Stock Keeping Unit (SKU Optimization) Analysis | Udemy",
        "children": [
            "Understanding of Market Basket Analysis and Customer Segmentation."
        ]
    },
    {
        "parent": "CIW E-Commerce Specialist practice exams | Udemy",
        "children": []
    },
    {
        "parent": "eCommerce - Conversion Modelling | Udemy",
        "children": [
            "Experience in data mining and advanced Excel."
        ]
    },
    {
        "parent": "Seth Godin's Value Creation Master Class | Udemy",
        "children": [
            "It's not expected that you've read Seth's books or blogs, but you will need to commit to actually completing the workbook and writing down some hard truths (and then doing it again, if necessary).",
            "After you finish the course, please pay it forward by teaching this material to someone else…"
        ]
    },
    {
        "parent": "Building a Digital Business Strategy | Udemy",
        "children": [
            "No materials or software are required."
        ]
    },
    {
        "parent": "Strategy for Management Consultants & Business Analysts | Udemy",
        "children": [
            "Basic or intermediate Excel",
            "Basic knowledge of economics or finance"
        ]
    },
    {
        "parent": "Strategic Management - Basic | Udemy",
        "children": [
            "No prior knowledge is necessary."
        ]
    },
    {
        "parent": "Global MBA Online | Udemy",
        "children": [
            "No Prerequisites"
        ]
    },
    {
        "parent": "Effective Business Strategy and Leadership | Udemy",
        "children": [
            "Prerequisite: Exposure to corporate strategy",
            "Advanced Preparation: None"
        ]
    },
    {
        "parent": "Scenario Planning for a Coronavirus (and Post-Virus) World | Udemy",
        "children": [
            "You should have at least a general understanding of business but no specific skill set is needed"
        ]
    },
    {
        "parent": "Strategic Performance Management - Tome 1: Managing Strategy | Udemy",
        "children": [
            "Business Vocabulary",
            "Understanding of Basic Business Concepts",
            "Comfortable with Excel and/or Numbers"
        ]
    },
    {
        "parent": "Strategy Unplugged | Udemy",
        "children": [
            "You will need at least three hours to complete the course. Although the course is self-containing (ie no specific prior knowledge is necessary), and strategy is a pervasive concept, this course will require some focus and determination, as Sid's delivery is somewhat steady throughout. This course is about relevant content - Sid wastes few words – so you need to be free of distractions while watching the videos. Although one could say that strategy is for ‘everyone’, this course will be most valuable to those who have at least 5 years work experience."
        ]
    },
    {
        "parent": "Business Strategy A-Z (With Case Studies) | Udemy",
        "children": [
            "Be able to follow basic business administration terminology (revenue, profit, etc.)",
            "Have a basic understanding how markets work (who are suppliers, shareholders, etc)"
        ]
    },
    {
        "parent": "M&A Due Diligence Best Practices | Udemy",
        "children": [
            "Prerequisite: Exposure to M&amp;A",
            "Advanced Preparation: None"
        ]
    },
    {
        "parent": "Cost Reduction for Managers & Management Consultants | Udemy",
        "children": [
            "Basic or intermediate Excel",
            "Basic knowledge of economics or finance"
        ]
    },
    {
        "parent": "Strategic project management | Udemy",
        "children": [
            "Project methodology",
            "Office programs",
            "Open mind",
            "Willingness for learning"
        ]
    },
    {
        "parent": "Business hacks, tactics and tricks - practical guide | Udemy",
        "children": [
            "Basic knowledge of business or economics"
        ]
    },
    {
        "parent": "Start Your Own Traditional Greeting Card Business | Udemy",
        "children": [
            "You should be familiar with how to use either a PC or a Mac computer.",
            "The desire to learn a new skill.",
            "You should want to Start a Greeting Card Company and Carry Inventory",
            "This business model is for Traditional Greeting Card Companies."
        ]
    },
    {
        "parent": "Up and Running with WordPress and Woocommerce 2019 | Udemy",
        "children": [
            "This Course is Not Designed for Freshers. We won't teach you Basic Website Design, Like HTML/CSS/JS or Even Server Side Language PHP. You should have Basic Understanding of these. We'll use Existing HTML/CSS/JS and Build Fully Functional Online Store in Wordpress with Woocommerce"
        ]
    },
    {
        "parent": "E-Commerce with Wordpress - Setup Walkthrough! | Udemy",
        "children": [
            "Students should already have a basic understanding of Wordpress. This course starts with the assumption that you know what the Dashboard is, and what Plugins are."
        ]
    },
    {
        "parent": "Create an E-commerce website, App and connect them | Udemy",
        "children": [
            "Users with some basic computers knowledge (2 years)",
            "You should be comfortable with HTML/CSS",
            "All lessons are fully described on text",
            "Both Mac and Windows operating systems are covered"
        ]
    },
    {
        "parent": "Top Five Wage and Hour Traps for Business | Udemy",
        "children": [
            "There are no specific prerequisites for this course."
        ]
    },
    {
        "parent": "Learning Path: Business Management with Odoo 10 | Udemy",
        "children": [
            "Basic knowledge of Python is required. Basic Linux (Ubuntu) knowledge and working with command line would be beneficial."
        ]
    },
    {
        "parent": "In 7 Days Get Mini MBA + Diploma in business management | Udemy",
        "children": [
            "Minimum education level your have to required"
        ]
    },
    {
        "parent": "How to start a Christmas Lighting Business | Udemy",
        "children": [
            "You should have 3 years of construction experience. Not necessary, but it will help the learning curve."
        ]
    },
    {
        "parent": "Introduction to Financial Management and Financial Decisions | Udemy",
        "children": [
            "You should be knowing basic terminologies in finance like shares, equity, debentures, loans, creditors etc"
        ]
    },
    {
        "parent": "23 x Ways your IT Support Company Can Make More Profit | Udemy",
        "children": [
            "A willingness to learn"
        ]
    },
    {
        "parent": "Fearless Business - Grow Your Business, Make More Money | Udemy",
        "children": [
            "You are running an established business with some turnover (£1k+/mth). ",
            "You are stuck doing the same thing, without getting the results you want."
        ]
    },
    {
        "parent": "Ultimate Wealth Generation Formula | Udemy",
        "children": [
            "No"
        ]
    },
    {
        "parent": "Business Intelligence – Collecting, Cleaning, Merging Data | Udemy",
        "children": [
            "No advanced preparation or prerequisites are needed for this course. However, it is recommended to take the other courses in the series prior to completing this one."
        ]
    },
    {
        "parent": "How to create, launch and grow your own hair salon | Udemy",
        "children": [
            "You are curious and have questions about starting your own hair salon.",
            "You have a grounding in cosmetology theory and practice.",
            "You are willing to explore a journey of self-discovery.",
            "You are willing to explore how comfortable your relationship with risk and money.",
            "You may have done self-development and/or leadership training.",
            "Ideally, you have 3-5 years of operational experience inside of a salon. "
        ]
    },
    {
        "parent": "Career Accelerator - From Student to Professional to Brand.. | Udemy",
        "children": [
            "Laptop, paper and pen. Preferably have a business degree or interest in learning business."
        ]
    },
    {
        "parent": "Drucker's Five Most Important Questions | Udemy",
        "children": [
            "There is no minimum qualification for this course, anyone who wants to understand the fundamentals of their organization and introspect about themselves, can take this course.",
            "The medium of instruction is English, therefore you need to understand English, to get the value out of this course.",
            "You need to be committed enough to complete the course, and do its exercises with complete sincerity."
        ]
    },
    {
        "parent": "Don't Let Your Customers Run Your Business | Udemy",
        "children": [
            "You should have a basic knowledge of bookkeeping and accounts receivable."
        ]
    },
    {
        "parent": "CPA 2020 Business Environment & Concepts (BEC) Practice Test | Udemy",
        "children": []
    },
    {
        "parent": "Laundromat Ownership Step-by-Step | Udemy",
        "children": [
            "Students of this course should have a desire to invest in their own business."
        ]
    },
    {
        "parent": "Start Your IT Support Business | Udemy",
        "children": [
            "Be able to solve common computer problems",
            "Be able to help with software issues",
            "Be able to diagnose simple computer networks"
        ]
    },
    {
        "parent": "Digital Advertising & Marketing 301: The Professional Course | Udemy",
        "children": [
            "Have a working knowledge of digital marketing and digital advertising",
            "Complete both Digital Advertising &amp; Marketing 101 and 201 courses",
            "Know the difference between ad-tech companies like DSPs, Networks, Exchanges, and others",
            "Understand the basics of programmatic advertising",
            "Be aware of the different kinds of companies like agencies, publishers, tech companies, and end advertisers"
        ]
    },
    {
        "parent": "First Sell YOU or You Will Never Sell Anything to Anybody! | Udemy",
        "children": [
            "Be open to some new and challenging ideas.",
            "Be willing to care about and serve other with intensity and enthusiasm",
            "Be open to thinking about and evaluating how they are presently trying to market and sell themselves."
        ]
    },
    {
        "parent": "Marketing Communications for Professional Marketers | Udemy",
        "children": [
            "General Business Knowledge"
        ]
    },
    {
        "parent": "Master in Global Digital Marketing | Udemy",
        "children": [
            "None"
        ]
    },
    {
        "parent": "Introduction to Marketing | Udemy",
        "children": [
            "There is no prior knowledge required for this course"
        ]
    },
    {
        "parent": "Key Account Management (KAM) Essentials: grow your business | Udemy",
        "children": [
            "Good Marketing basics are required"
        ]
    },
    {
        "parent": "Account Based Marketing (ABM) 2020 - B2B Marketing Strategy | Udemy",
        "children": [
            "Having experience in B2B industry as Marketer or Sales Person",
            "The course narrates from the basic so anyone can start learning the course but knowledge in marketing or sales will be helpful",
            "Digital Marketers, Inbound Marketers, Demand Generation specialists"
        ]
    },
    {
        "parent": "Produce your company's winning marketing strategy | Udemy",
        "children": [
            "Have a basic understanding of business or marketing"
        ]
    },
    {
        "parent": "Marketplace Marketing - Marketplace Recommendation Algorithm | Udemy",
        "children": [
            "Be excited to uncover the #1 way to grow your business on YouTube, Amazon and other large platforms"
        ]
    },
    {
        "parent": "Top 10 Mistakes Agents Make When Marketing Real Estate | Udemy",
        "children": [
            "A general knowledge of real estate practices."
        ]
    },
    {
        "parent": "Data-Driven Content Marketing for Startups: 90-Day Strategy | Udemy",
        "children": [
            "You'll need to know the basics of SEO",
            "You should have a basic understanding of who your target customer/audience is",
            "You should have basic Excel skills"
        ]
    },
    {
        "parent": "Double Business Profits - With Simple Online Marketing | Udemy",
        "children": [
            "You will need a hosting account, as well as a Facebook and Twitter account. We will provide training on all aspect and can acquire these service after starting our training."
        ]
    },
    {
        "parent": "Solopreneur Marketing: Pricing Strategies & Tactics | Udemy",
        "children": [
            "Some things will be a little easier to understand if you've had an economics or psychology class somewhere along the way, but I make it all very accessible and I'm happy to answer any questions that come up so don't worry if you don't have that background!"
        ]
    },
    {
        "parent": "B2B Marketing & Business Growth Strategies | Udemy",
        "children": [
            "A basic understanding of marketing and a passion towards strategic thinking to grow a business"
        ]
    },
    {
        "parent": "Learn Practical Exports Marketing Skills | Udemy",
        "children": [
            "There are no course requirements or prerequisites",
            "Anyone with an interest in exports and international marketing can join this course",
            "The course is a practical course and does not use any special marketing jargons"
        ]
    },
    {
        "parent": "Integrated Marketing Foundations and Campaign Strategy | Udemy",
        "children": [
            "Basic knowledge of marketing and marketing terminology.",
            "Experience with audience targeting is helpful, but not required.",
            "Experience working with creative teams or agencies is helpful, but not required.",
            "General passion for marketing."
        ]
    },
    {
        "parent": "Digital Advertising & Marketing 201: Today's Trends & Topics | Udemy",
        "children": [
            "You should know the topics covered in Digital Advertising &amp; Marketing 101",
            "Topics covered in 101: Exchanges, DSPs, Ad Networks, Ad Agencies, Ad Servers, Types of digital ad units, buying models, IAB, MRC",
            "A basic to intermediate understanding of digital marketing",
            "Be able to differentiate between paid advertising, regular press, and word of mouth marketing"
        ]
    },
    {
        "parent": "Digital Marketing Course for Beginners | Udemy",
        "children": [
            "You should have basic knowledge of how to use the internet through your PC."
        ]
    },
    {
        "parent": "Artificial Intelligence In Digital Marketing | Udemy",
        "children": [
            "Marketing and IT knowledge"
        ]
    },
    {
        "parent": "Extreme Automation in Digital Marketing Certification (2021) | Udemy",
        "children": [
            "Basic knowledge of Digital Marketing is necessary. A few practical and automated Digital Marketing tools are conveyed in the course. Some tools may be free and some may be paid. You can leverage any tool here to suit the standard requirement that you may have.",
            "There is no other prerequisite needed to take up the course."
        ]
    },
    {
        "parent": "Digital Marketing 201: Multi-million dollar tips and tricks | Udemy",
        "children": [
            "You should understand basic SEO techniques and best practices",
            "You should know the ins and outs of social media",
            "You should have used remarketing in the past or are comfortable using it in the near future",
            "You should be comfortable with digital marketing ",
            "You should have experience running ads with Adwords, Facebook Ads, and other paid acquisition channels"
        ]
    },
    {
        "parent": "Complete SEO tutorial for the Beginners | Udemy",
        "children": [
            "In order to understand and implement , the only requirement is an active website"
        ]
    },
    {
        "parent": "Practical Digital Marketing Course | Udemy",
        "children": [
            "Anybody Willing to Learn, Working Knowledge of Computer.",
            "Some basic Ideas about Digital Marketing."
        ]
    },
    {
        "parent": "Digital Marketing Analytics - Advanced Attribution using R | Udemy",
        "children": [
            "Basic Excel formatting",
            "Basic digital marketing channel terminologies like Google organic, paid ads, utm, etc.",
            "Basic Google Analytics",
            "Probability &amp; Statistics knowledge helpful but not required"
        ]
    },
    {
        "parent": "Set Up Beacons & Proximity Marketing - 2018 Masterclass | Udemy",
        "children": [
            "You should know how to use a PC, smartphone,  and browser at a beginner level."
        ]
    },
    {
        "parent": "Essentials of Digital Marketing and Ecommerce | Udemy",
        "children": [
            "The course is made in an easy way so to grasp even technological aspects...yet please be aware that technology is always changing and hence we both have to stay up-to-date like now to embed a landing page on Facebook one needs to achieve a certain number of likes !"
        ]
    },
    {
        "parent": "learn easy digital marketing | Udemy",
        "children": [
            "Be able to read and write"
        ]
    },
    {
        "parent": "Professional Diploma in Digital Marketing practice exams | Udemy",
        "children": []
    },
    {
        "parent": "Top Amazon Kindle Courses Online - Updated [November 2020] | Udemy",
        "children": []
    },
    {
        "parent": "Digital Marketing | Udemy",
        "children": [
            "Interest in starting an E-Commerce Store"
        ]
    },
    {
        "parent": "Simba's Teach Yourself Digital Marketing (2020 Edition) | Udemy",
        "children": [
            "Prior Basic Understanding Of Business and Marketing Concepts e.g. Porter's Five Forces, BCG-Growth Matrix, Product/Market Fit",
            "Open To New Marketing Ideas &amp; Concepts e.g. Simba's Five Forces, Simba's Content Matrix, Content/Market Fit etc."
        ]
    },
    {
        "parent": "Big Traffic Fire sale - Big Traffic Generation Master Class | Udemy",
        "children": [
            "Basic Knowledge of using Internet"
        ]
    },
    {
        "parent": "WooCommerce Theme Development: Advanced Course | Udemy",
        "children": [
            "You'll need at least basic HTML, CSS and PHP knowledge",
            "You need to at least understand how WordPress works (creating posts and pages etc)"
        ]
    },
    {
        "parent": "Advanced Woocommerce - Step by Step | Udemy",
        "children": [
            "A basic knowledge of WordPress.",
            "Basic knowledge of PHP and MySQL.",
            "Experience working with Woocommerce."
        ]
    },
    {
        "parent": "WordPress eCommerce: Kickstart Your Online Store | Udemy",
        "children": [
            "Basic Computer Skills"
        ]
    },
    {
        "parent": "Dependency Injection in Android with Dagger 2 and Hilt | Udemy",
        "children": [
            "Hands-on experience with Android development",
            "Basic knowledge of Kotlin"
        ]
    },
    {
        "parent": "Android Architecture Masterclass | Udemy",
        "children": [
            "Hands-on experience with Android development"
        ]
    },
    {
        "parent": "Mobile Penetration Testing of Android Applications | Udemy",
        "children": [
            "basic computer skills and Linux OS",
            "web technologies knowledge",
            "knowledge of most common web vulnerabilities"
        ]
    },
    {
        "parent": "Advanced Android - Architecture with Dagger 2 and more | Udemy",
        "children": [
            "Intermediate Android development experience",
            "Development environment capable of running Android Studio (Windows/Linux/Mac)"
        ]
    },
    {
        "parent": "Advance Android Programming - learning beyond basics | Udemy",
        "children": [
            "Basic Android Programming"
        ]
    },
    {
        "parent": "Mobile App Development with Android (2015) | Udemy",
        "children": [
            "Willingness to learn design patterns and proper usage of an OO language",
            "Basic programming ability, especially in a similar, statically typed language, such as C# or C++",
            "All software is explained and installed on video"
        ]
    },
    {
        "parent": "Beast Android Development: Advanced Android UI | Udemy",
        "children": [
            "Be comfortable with Java, Object-oriented Programming "
        ]
    },
    {
        "parent": "Intermediate Android Development and Kotlin | Udemy",
        "children": [
            "Have Android Studio installed and ready",
            "Have an Android emulator or Android phone with usb cable to be able to run apps from Android Studio",
            "Understand Android concepts such as what is an Activity, and Intent, and the Activity Lifecycle",
            "Be able to recognize java code and broadly understand what it does"
        ]
    },
    {
        "parent": "Android Daily Shopping List App Using Firebase(Project base) | Udemy",
        "children": [
            "A Windows Computer, Mac or Linux PC",
            "Use of Android Studio",
            "No Programming Experience is required I Will Teach You Everything That you need to Develop A Complete Android App",
            "Basics of Java Programming Language"
        ]
    },
    {
        "parent": "Hands-on Background Services in Android | Udemy",
        "children": [
            "Basic Android Development"
        ]
    },
    {
        "parent": "To-Do App & Clean Architecture -Android Development - Kotlin | Udemy",
        "children": [
            "Basic knowledge about Android Development",
            "Basic knowledge about Android Architecture Components",
            "This course is NOT for Absolute Beginners"
        ]
    },
    {
        "parent": "Building a Chat App for Android from Scratch | Udemy",
        "children": [
            "Windows, OS X or Ubuntu"
        ]
    },
    {
        "parent": "Android Multilingual Applications Development From Scratch | Udemy",
        "children": [
            "A working computer.",
            "Android SDK UP and Running API level 17+up",
            "Android Studio Up and Running.",
            "You should have basic knowledge of Java,Android,XML technologies."
        ]
    },
    {
        "parent": "Selenium WebDriver with Java Quickstart | Udemy",
        "children": [
            "Have basic understanding of Java programming",
            "A PC running Windows 10 Professional or Mac OS",
            "All software we’ll be using is free to download and install",
            "Chrome browser",
            "Familiar with web pages",
            "Software testing knowledge"
        ]
    },
    {
        "parent": "Selenium Webdriver: What are Implicit and Explicit Waits | Udemy",
        "children": [
            "Knowledge of Selenium Webdriver API",
            "Knowledge of Visual Studio",
            "Knowledge of C#"
        ]
    },
    {
        "parent": "Selenium WebDriver-Working With Elements | Udemy",
        "children": [
            "You should have some flavor of Visual Studio installed, Community edition is fine",
            "You should have basic understanding of C# and Visual Studio",
            "You should have ChromeDriver and Chrome browser installed"
        ]
    },
    {
        "parent": "Selenium Webdriver-How to Do Mouse and Keyboard Actions | Udemy",
        "children": [
            "Basics of Selenium Webdriver API",
            "Basic understanding of C# and Visual Studio"
        ]
    },
    {
        "parent": "Introduction To Parallel Test Execution with Selenium | Udemy",
        "children": [
            "Basics of Selenium Webdriver",
            "Visual Studio",
            "C#"
        ]
    },
    {
        "parent": "Selenium Webdriver with Java Language | Udemy",
        "children": [
            " The tutorials are designed for beginners with little or no automation experience. Everything is taught from scratch!",
            "Before proceeding with this tutorial, you should have a basic understanding of Java programming language, text editor and execution of programs, etc."
        ]
    },
    {
        "parent": "Advanced Selenium testing framework with Java | Udemy",
        "children": [
            "Software Testing experience",
            "Some Java programming knowledge or other OOP",
            "Basic Selenium WebDriver experience is a plus"
        ]
    },
    {
        "parent": "Automate WebApp Testing with Selenium WebDriver API (Java) | Udemy",
        "children": [
            "Understanding of Java Syntax",
            "Eclipse (download)",
            "Selenium WebDriver Library (download)",
            "JDK8"
        ]
    },
    {
        "parent": "Browser Automation with Python Selenium | Udemy",
        "children": [
            "Basic Python knowledge required"
        ]
    },
    {
        "parent": "Selenium Webdriver for SDET in Java - Bootcamp | Udemy",
        "children": [
            "******You need NOT have java coding experience to start this course********* Even non Programming candidates can follow this course comfortably"
        ]
    },
    {
        "parent": "Selenium Webdriver in C#.Net | Udemy",
        "children": [
            "Students should have very basic knowledge of any programming language like C"
        ]
    },
    {
        "parent": "Selenium 4 - New Features | Udemy",
        "children": [
            "You should know Selenium 3 prior to this course"
        ]
    },
    {
        "parent": "A4Q® SELENIUM PRACTICE EXAM - FOUNDATION | ENG | Udemy",
        "children": []
    },
    {
        "parent": "Beginning Selenium WebDriver Testing in Java | Udemy",
        "children": [
            "Basic programming knowledge, more interested in skilling up with Selenium WebDriver as their testing tool."
        ]
    },
    {
        "parent": "Spring Professional Certification Exam Tutorial - Module 05 | Udemy",
        "children": [
            "Java",
            "Maven",
            "IDE of your choice"
        ]
    },
    {
        "parent": "Hibernate and Java Persistence API (JPA) Fundamentals | Udemy",
        "children": [
            "a strong familiarity with Java and experience with JDBC"
        ]
    },
    {
        "parent": "Hibernate: Advanced Development Techniques | Udemy",
        "children": [
            "Basic Java knowledge is required",
            "Basic Hibernate knowledge is required",
            "Basic MySQL knowledge is required",
            "Basic Maven knowledge is required"
        ]
    },
    {
        "parent": "Learn Hibernate in less than 3 hours | Udemy",
        "children": [
            "Basic Java/JDBC  and little Spring background added advantage"
        ]
    },
    {
        "parent": "Build an application from scratch: JEE 7, Java 8 and Wildfly | Udemy",
        "children": [
            "Some Java/JavaEE knowledge."
        ]
    },
    {
        "parent": "Java Interview preparation | Udemy",
        "children": [
            "Basic Java and Java object oriented Knowledge  is must for this course",
            "For more info about prerequisites watch this course promotional video"
        ]
    },
    {
        "parent": "Modern Design Patterns with Java EE 8 | Udemy",
        "children": [
            "Java 8 Development Environment",
            "NetBeans or IntelliJ IDE",
            "Glassfish application server",
            "GIT SCM",
            "Fair knowledge of the Java Programming language",
            "A fair basic understanding of Java EE programming concepts"
        ]
    },
    {
        "parent": "Building and Deploying Java EE Microservices on the Cloud | Udemy",
        "children": [
            "No prior experience of writing microservices in Java EE is assumed."
        ]
    },
    {
        "parent": "Java EE 8 Application Development | Udemy",
        "children": [
            "You are expected to have prior knowledge of Java and some experience in developing and deploying applications in the past. No prior knowledge of Java EE is required."
        ]
    },
    {
        "parent": "Data Structures and Algorithms: Deep Dive Using Java | Udemy",
        "children": [
            "Previous experience with an object-oriented programming language, preferably Java (but any OO language is fine)."
        ]
    },
    {
        "parent": "Python Data Structures A to Z | Udemy",
        "children": [
            "Should be familiar with Python programming fundamentals such as how to use variables and functions.",
            "Alternatively, if you are already proficient with another language and are just starting to learn Python as a second language you could probably keep up with this course."
        ]
    },
    {
        "parent": "Data Structures in JavaScript | Udemy",
        "children": [
            "Basic programming knowledge is required to complete the course."
        ]
    },
    {
        "parent": "Master the Coding Interview: Big Tech (FAANG) Interviews | Udemy",
        "children": [
            "No previous computer science knowledge necessary",
            "Basic understanding of one programming language",
            "If you have the ambition to learn and get into one of these companies we will make it achievable for you! (see our student success stories)"
        ]
    },
    {
        "parent": "Data Structures And Algorithms In The C Programming Language | Udemy",
        "children": [
            "Understanding of pointers, structures and arrays within the C Programming Language"
        ]
    },
    {
        "parent": "Data Structure - Part 2 | Udemy",
        "children": [
            "Familiarity with Object Oriented Programming",
            "Basic knowledge of programming is assumed, preferably in Java",
            "Knowledge of Stack, Queues and Linked List"
        ]
    },
    {
        "parent": "Advance MATLAB Data Types and Data Structures | Udemy",
        "children": [
            "General know how of MATLAB programming"
        ]
    },
    {
        "parent": "Advanced Data Structures and Algorithms in Python | Udemy",
        "children": [
            "This course is for developers who have basic programming knowledge in Python and are seeking to learn about the advanced algorithms and data structures that can be used in Python in various applications, including web and mobile solutions."
        ]
    },
    {
        "parent": "Coding Project - Programming Finite State Machines | Udemy",
        "children": [
            "Basic knowledge of Theory of Computation and Automata is required",
            "Atleast above beginner level coding skills required",
            "Zeal and enthusiasm to code and learn"
        ]
    },
    {
        "parent": "Beginner Data Structures in C | Udemy",
        "children": [
            "Students are expected to know C language basics like using variables, input/output functions, decision statements, looping statements."
        ]
    },
    {
        "parent": "Data Structures&Algorithms-Asymptotic Notation, Recurrences | Udemy",
        "children": [
            "Basic understanding of Algorithms",
            "Fundamental Mathematical knowledge"
        ]
    },
    {
        "parent": "Mastering Data Structure Using C | Udemy",
        "children": [
            "Recursion",
            "Syntax of C Programming"
        ]
    },
    {
        "parent": "Essential Coding Interview Questions Python Edition | Udemy",
        "children": [
            "Be able to program in Python and have at least a basic understanding of Object Oriented Programming, Data Structures and Algorithms"
        ]
    },
    {
        "parent": "Functional Data Structures and Algorithms | Udemy",
        "children": [
            "This video course assumes you have some experience in functional programming languages."
        ]
    },
    {
        "parent": "data structure for fledgling learners | Udemy",
        "children": [
            "minimum requirement is python language &amp; Object oriented programming"
        ]
    },
    {
        "parent": "Robot Framework Test Automation - Level 2 | Udemy",
        "children": [
            "Have access to a Windows, Linux, or Mac computer &amp; Internet",
            "Have a basic understanding of the Robot Framework platform",
            "Have a basic understanding of Robot Framework scripting"
        ]
    },
    {
        "parent": "Advanced Selenium WebDriver with Java and TestNG | Udemy",
        "children": [
            "Some Java or other object-oriented programming language (Beginner or Intermediate)",
            "Experience with Selenium WebDriver (Ability to automate basic test)",
            "Previous experience with TestNG or jUnit testing frameworks is a big plus",
            "Experience with Maven is a big plus, but not critical",
            "Desire to build Full-Stack Test Automation Framework with Selenium WebDriver"
        ]
    },
    {
        "parent": "Web Application Automation - Selenium - Ruby - Cucumber | Udemy",
        "children": [
            "No programming or coding experience required",
            "Machine with Windows OS"
        ]
    },
    {
        "parent": "End to End Integration : Selenium - Maven - Git - Jenkins | Udemy",
        "children": [
            "You should have basic understanding of Webdriver automation",
            "You should have basic understanding of Eclipse and Java"
        ]
    },
    {
        "parent": "End-To-End BDD Framework -Selenium|Java|Cucumber|GIT|Jenkins | Udemy",
        "children": [
            "Basic to Advance level Understanding of Selenium Webdriver",
            "Advance level Understanding of Java Programming language"
        ]
    },
    {
        "parent": "Design DataDriven Framework in 100 mins|Selenium|Java|TestNG | Udemy",
        "children": [
            "Basic to Advance level Understanding of Selenium Webdriver",
            "Advance level Understanding of Java Programming language with TestNG and Maven"
        ]
    },
    {
        "parent": "Beginning Selenium WebDriver Testing in Python | Udemy",
        "children": [
            "Basic programming knowledge keen to skill up with Selenium WebDriver as their testing tool of choice."
        ]
    },
    {
        "parent": "Selenium Grid - From Scratch - Deployment & Configuration | Udemy",
        "children": [
            "basic command line skills, some coding skills (an advantage)"
        ]
    },
    {
        "parent": "Data-Driven Testing in Selenium | Udemy",
        "children": [
            "Prior experience using Selenium and Java to test web-based applications is recommended."
        ]
    },
    {
        "parent": "Advance Selenium : Git-Assertions-Maven-Reporting-Jenkins | Udemy",
        "children": [
            "Student should have basic knowledge of Selenium",
            "Student should have basic knowledge of Java programming"
        ]
    },
    {
        "parent": "Advanced Selenium 4.0 Framework Development with Junit5 | Udemy",
        "children": [
            "Basic knowledge of Selenium WebDriver",
            "Knowledge of Core Java",
            "Element identification techniques in Selenium(xpath, css, id etc)"
        ]
    },
    {
        "parent": "Selenium: Testing and Automation Masterclass: 5-in-1 | Udemy",
        "children": [
            "Prior programming experience of Java is assumed."
        ]
    },
    {
        "parent": "Selenium WebDriver Advance Test Automation | Udemy",
        "children": [
            "You should know basics of Selenium WebDriver and Java"
        ]
    },
    {
        "parent": "Top Selenium Testing Framework Courses Online - Updated [November 2020] | Udemy",
        "children": []
    },
    {
        "parent": "Web automation using Selenium RC from Scratch | Udemy",
        "children": [
            "The tutorials are designed for beginners with little or no automation experience. Everything is taught from scratch!",
            "Before proceeding with this tutorial, you should have a basic understanding of Java programming language, text editor and execution of programs, etc."
        ]
    },
    {
        "parent": "Selenium Fundamentals | Udemy",
        "children": [
            "Should have hand-on knowledge of web-based user interface testing with Selenium."
        ]
    },
    {
        "parent": "Create Instagram Like App For Android | Udemy",
        "children": [
            "Android Studio",
            "Windows 7/8/10 Or Mac",
            "Good Java Programming knowaledge",
            "Good Object Oriented Programming Skills",
            "Basic Knowledge in PHP",
            "Java Environment (JDK)",
            "Internet Connection"
        ]
    },
    {
        "parent": "Firebase realtime database for Android Apps. | Udemy",
        "children": [
            "This course has been specifically designed for those of you with a basic understanding and some prior knowledge of Firebase projects, coding and the relevant terminology.",
            "Some programming experience is preferable as this course focuses solely on the aspect of the Google’s Firebase real-time database.",
            "Software prerequisites: Android Studio, an Android Studio SDK and Java JDK.",
            "A PC or MAC with internet connection.",
            "Passion for learning Android App development with Java and an enthusiasm and vision for the Android App or Apps that you wish to create and publish."
        ]
    },
    {
        "parent": "Complete Android app Development Course - Without Coding | Udemy",
        "children": [
            "No knowledge to learn Android app development. You have only required Internet connection and Google Chrome browser in your PC. (App inventer, thunkable, appybuilder, makeroid, droidmaker) these sites bookmark in your browser."
        ]
    },
    {
        "parent": "Java Sorting Algorithms for Newbs | Udemy",
        "children": [
            " You should have either a background in Java, or another programming language you feel is similar to Java syntax.",
            "Make sure you already have a programming environment (like and IDE) already set up and ready to go."
        ]
    },
    {
        "parent": "Sorting Algorithms using Java & C: Make Your Basics Strong | Udemy",
        "children": [
            "Students must be familiar with basic understanding of C or Java. If you are familiar with any other language then also you can join the course, however, the implementations of the sorting algorithms in this course is done in both C and Java only."
        ]
    },
    {
        "parent": "Graph Algorithms for AI in Games | Udemy",
        "children": [
            "Having some knowledge of programming languages and algorithms will help you to get the most out of the video."
        ]
    },
    {
        "parent": "Learn Algorithms and Data Structures in Java | Udemy",
        "children": [
            "Basic knowledge of Java programming language is essential."
        ]
    },
    {
        "parent": "Learning Path:Java: Data Structures & Algorithms with Java 9 | Udemy",
        "children": [
            "Working knowledge on Java is a must"
        ]
    },
    {
        "parent": "Advanced Data Structures and Algorithms in Java 9 | Udemy",
        "children": [
            "A basic knowledge of Java is assumed."
        ]
    },
    {
        "parent": "Advanced Scalable Python Web Development Using Flask | Udemy",
        "children": [
            "A computer with internet access and administrative access to install packages",
            "Good understanding of how to use the command line interface, internet and code editors",
            "A credit card is required to open an account on the cloud infrastructure provider",
            "Good knowledge of the Python programming language",
            "Good knowledge of the Flask web framework",
            "Basic knowledge of HTML, CSS and jQuery"
        ]
    },
    {
        "parent": "Essential Docker for Python Flask Development | Udemy",
        "children": [
            "A computer with internet access and administrative access to install packages",
            "Good understanding of how to use the command line interface, internet and code editors",
            "Good knowledge of the Flask web framework"
        ]
    },
    {
        "parent": "Python Flask: Make Web Apps with Python | Udemy",
        "children": [
            "Basic Python knowledge required",
            "You should know HTML and CSS",
            "Recommended to have SQL or SQLite experience"
        ]
    },
    {
        "parent": "Mastering Flask | Udemy",
        "children": [
            "This fast-paced, example-based video course starts with an advanced overview of Flask core concepts, moves on to advanced functionality, and finishes up with a running application that can serve as a blueprint for further studying or production development."
        ]
    },
    {
        "parent": "Flask Devops: Release Scalable Applications with Heroku | Udemy",
        "children": [
            "A computer with internet access and administrative access to install packages",
            "Good understanding of how to use the command line interface, internet and code editors",
            "Good knowledge of the Flask web framework"
        ]
    },
    {
        "parent": "Free Flask Tutorial - Build a Web Application with Python, Flask and NLP | Udemy",
        "children": []
    },
    {
        "parent": "Docker for Java Developers: Supercharge Your Enterprise Development | Udemy",
        "children": [
            "Students taking the course should have basic Java programming skills",
            "Spring knowledge is not required, but helpful",
            "The ideal student will have basic Linux skills",
            "Local Admin access for installing Docker"
        ]
    },
    {
        "parent": "Docker - SWARM - Hands-on - DevOps | Udemy",
        "children": [
            "Docker Basics",
            "Basics of building docker images",
            "Basics of running docker containers",
            "Basics of docker compose"
        ]
    },
    {
        "parent": "Docker for Professionals: The Practical Guide | Udemy",
        "children": [
            "Student should have basic knowledge of Linux before starting the course"
        ]
    },
    {
        "parent": "Logging in Kubernetes with EFK Stack | The Complete Guide | Udemy",
        "children": [
            "Know basics of Kubernetes",
            "Know basics of Docker"
        ]
    },
    {
        "parent": "Learn how to deploy Docker applications to production | Udemy",
        "children": [
            "You should have a basic understanding of Docker before taking this course. You should know what an image is and how to build, push and pull images ",
            "You should have a local workstation with Docker installed",
            "If you use Windows you will need a Unix flavoured VM in order to follow the examples in the \"Automating with Ansible\" section (Ansible doesn't work in Windows)"
        ]
    },
    {
        "parent": "Essentials of Docker For .Net Developers | Udemy",
        "children": [
            "Any command/terminal prompt basics.",
            "Have a GitHub and Docker Hub account.",
            "General dotnet concepts is desirable to have.",
            "Local admin access to install Docker for Mac/Windows/Linux.",
            "No paid software required - Just install your favourite text editor and get started."
        ]
    },
    {
        "parent": "Projects in Docker | Udemy",
        "children": [
            "Basic knolwedge of Linux is required to complete this course"
        ]
    },
    {
        "parent": "Docker for ASP.NET Core MVC | Udemy",
        "children": [
            "An understanding of Docker concepts would be helpful, but it’s not necessary"
        ]
    },
    {
        "parent": "Docker in a Day: Beginner to Advanced with Hands-on Examples | Udemy",
        "children": [
            "Windows / Mac / Linux machine with admin access or with docker installed",
            "A basic overview of terminal and command prompt",
            "Understand basic principles of programming"
        ]
    },
    {
        "parent": "Docker Certification Practice Exam | Udemy",
        "children": []
    },
    {
        "parent": "Working with Advanced Docker Operations | Udemy",
        "children": [
            "Who are familiar with basic Docker concepts and want to learn how to deploy Docker for real-world applications."
        ]
    },
    {
        "parent": "Test-Driven Development Masterclass with Angular | Udemy",
        "children": [
            "Beginner Angular knowledge",
            "Beginner Angular unit test knowledge"
        ]
    },
    {
        "parent": "Interaction Tests, Mocks & Refactoring in Embedded Software | Udemy",
        "children": [
            "A basic proficiency in C programming.",
            "Some experience with Embedded or Systems Programming. If you’ve ever dealt with a register or bit mask, you’re our kind of people!",
            "Experience with basic unit testing, particularly in C using Unity. If that’s not you, yet, try our first course: ‘Unit Testing &amp; Other Embedded Software Catalysts’.",
            "There are tools required, but they’re all free. We’ve packaged them for easy installation, and we’ll guide you through their set up."
        ]
    },
    {
        "parent": "Test Driven Stripe Checkout with Laravel | Udemy",
        "children": [
            "You should be familiar with Laravel 5.5 at a beginner level.",
            "You should have Laravel Homestead already installed"
        ]
    },
    {
        "parent": "Testing React apps with React Testing Library (RTL) | Udemy",
        "children": [
            "Be famliarized with React components"
        ]
    },
    {
        "parent": "Laravel OTP Based Login Two Factor Authentication | Udemy",
        "children": [
            "Have at least basic knowledge of Laravel",
            "Have at least basic knowledge of Vuejs",
            "Ready for challanges",
            "Never Quit"
        ]
    },
    {
        "parent": "How to evolve a legacy iOS Application written in Swift | Udemy",
        "children": [
            "Proficiency in writing iOS mobile applications using Swift",
            "Experience launching an mobile application to the Store"
        ]
    },
    {
        "parent": "GUI Development with Python and Tkinter | Udemy",
        "children": [
            "You should have some programming knowledge, with Python or another language. Although we provide a complete Python Refresher course that covers everything you need to know, this is not an introductory Python course.",
            "You need a computer with either Linux, Mac, or Windows 10. Older Windows versions will work too but there can be some small issues that we can work around.",
            "Developing on a mobile device is possible by using a web editor. How to do this is detailed inside the course."
        ]
    },
    {
        "parent": "Python Tkinter Masterclass - Learn Python GUI Programming | Udemy",
        "children": [
            "A basic knowledge of Python is recommended - A good pre-requisite would be the Python Masterclass available on this channel",
            "A computer running Windows or Linux, or a Mac so that the free IDE can be downloaded and install (full instructions included)."
        ]
    },
    {
        "parent": "Build A Drawing App With TKinter and Python GUI Apps | Udemy",
        "children": [
            "No special tools are necessary to take this course",
            "A Basic Understanding of Python and TKinter Is Helpful"
        ]
    },
    {
        "parent": "Python GUI Programming using Tkinter and Python | Udemy",
        "children": [
            "Basic Python knowledge",
            "Passion to learn"
        ]
    },
    {
        "parent": "Python 3000: The Tkinter GUI | Udemy",
        "children": [
            "Students must have completed Python 1000 &amp; Python 2000 (or an educaitonal equivalent covering Python 3 keywords and class concepts.)"
        ]
    },
    {
        "parent": "Tkinter Python GUI for Image GPS Detection with Google Maps | Udemy",
        "children": [
            "Python programming language",
            "Internet"
        ]
    },
    {
        "parent": "Leveling up to ES6 | Udemy",
        "children": [
            "Should have intermediate programming knowledge",
            "Basic understanding of javascript features including arrays, objects, prototypically inheritance,  functions, self executing functions, scoping, hoisting, looping, etc",
            "Be able to install node locally on your machine",
            "Know how to run ES6 code using Node version 8.5.0, jsbin, codepen, etc."
        ]
    },
    {
        "parent": "The complete Javascript ES6 course. | Udemy",
        "children": [
            "Knowing a liitle bit of HTML, CSS and Javascript, everything else you will learn it as we go."
        ]
    },
    {
        "parent": "ECMAScript 2016 and Beyond | Udemy",
        "children": [
            "Best suited for developers who want to use the new ES6 features in their projects today."
        ]
    },
    {
        "parent": "Ultimate Javascript specifications course - ES6 to ES2020 | Udemy",
        "children": [
            "Intermediate  JS knowledge"
        ]
    },
    {
        "parent": "Learn AngularJS Step By Step | Udemy",
        "children": [
            "Downlaod and install visual studio 2013 express which is free available. or if it is not possbile any other IDE which can support Javascript, HTML5 and CSS will work fine with this."
        ]
    },
    {
        "parent": "AngularJS For .Net Developers From Scratch | Udemy",
        "children": [
            "VS2013 or higher",
            "MS SQL Server 2012 or higher"
        ]
    },
    {
        "parent": "Angularjs Live Project | Udemy",
        "children": [
            "MS Sql Server Any version",
            "Entity Framework 6",
            "Asp.Net Web APIs 2",
            "C#.Net",
            "AngularJS",
            "Visual Studio 2015 or above"
        ]
    },
    {
        "parent": "Creating a Quiz with AngularJS 1.x | Udemy",
        "children": [
            "Some HTML and CSS is recommended",
            "General idea of JavaScript",
            "Willingness to learn something new"
        ]
    },
    {
        "parent": "Building a Realtime Chat App with Angular & Firebase | Udemy",
        "children": [
            "Basic programming fundamentals and a good Javascript foundation is required."
        ]
    },
    {
        "parent": "Mastering AngularJS UI Development | Udemy",
        "children": [
            "This video course is for those who are already familiar with AngularJS."
        ]
    },
    {
        "parent": "Desktop apps with Angular, Firestore and Electron | Udemy",
        "children": [
            "Basics of Angular",
            "Patience",
            "Coffee"
        ]
    },
    {
        "parent": "AngularJS: Write It Like A Pro | Udemy",
        "children": [
            "Good Internet Connection",
            "IDE",
            "Know Before You Go: HTML, JavaScript and CSS. ",
            "Beer, Wine and Patience"
        ]
    },
    {
        "parent": "Factories and Directives in AngularJS | Udemy",
        "children": [
            "This course is designed for users that already have programming experience, and are comfortable with JavaScript and Angular. "
        ]
    },
    {
        "parent": "Complete guide to ASP.NET Core MVC (v3.1) | Udemy",
        "children": [
            "3-6 months knowledge of C#",
            "Visual Studio 2019",
            "SQL Server Management Studio",
            ".NET Core 3.1"
        ]
    },
    {
        "parent": "RESTful API with ASP.NET Core Web API - Create and Consume | Udemy",
        "children": [
            "3-6 months knowledge of NET&nbsp;Core",
            "Visual Studio 2019",
            "SQL Server 2018",
            ".NET Core 3.1"
        ]
    },
    {
        "parent": "Advanced ASP.NET Core 3 MVC: Repository Pattern, N-Tier and API's | Udemy",
        "children": [
            "3-6 months knowledge of C#",
            "3-6 months knowledge of ASP NET Core MVC",
            "Visual Studio 2019",
            "SQL Server Management Studio"
        ]
    },
    {
        "parent": "Advanced ASP.NET Core 3.1 Razor Pages | Udemy",
        "children": [
            "3-6 months knowledge of C#",
            "Basic knowledge of ASP NET Core Razor Pages",
            "Visual Studio 2019",
            "SQL Server Management Studio"
        ]
    },
    {
        "parent": "ASP.NET Core, building REST APIs in C# with Entity Framework | Udemy",
        "children": [
            "Basic knowledge of C#, including LINQ, collections and generic types"
        ]
    },
    {
        "parent": "#1 Complete ASP.NET Core MVC Single-Page App[The Future] | Udemy",
        "children": [
            "Developer must have experience with Building ASP .NET Core or ASP. NET-MVC application",
            "Developer Must go through Microsoft documentation: \"Getting started with ASP .NET Core MVC and Entity Framework Core using Visual Studio\"",
            "Developer should have basic knowledge: How ASP. NET-MVC application works",
            "Developer should have little experience in C#, Linq",
            "Visual Studio 2015 or Visual Studio 2017 is highly preferable",
            "Good Experience with jQuery is Mandatory"
        ]
    },
    {
        "parent": "Projects in ASP.NET Core 2.0 | Udemy",
        "children": [
            "Basic kolwedge of HTML and JS is required to complete this course"
        ]
    },
    {
        "parent": "ASP.NET Core Identity - Authentication & Authorization | Udemy",
        "children": [
            "Basic SQL Server knowledge",
            "6months of experience with C#",
            "Basic knowledge of ASP NET Core"
        ]
    },
    {
        "parent": "Building a Multi Layer .NET Core 3.1 Web API from Zero | Udemy",
        "children": [
            "C#",
            "Basic HTML/ CSS"
        ]
    },
    {
        "parent": "Getting Started with ASP.NET Core MVC | Udemy",
        "children": [
            "Knowledge of MVC is not required, but would be an advantage as MVC will be discussed in detail"
        ]
    },
    {
        "parent": "ASP.NET Core MVC - Up and Running Part 2 (.NET 5) | Udemy",
        "children": [
            "3-6 months familiarity with C# and SQL",
            "Visual Studio 2019",
            ".NET Core MVC - Up and Running Part 1 Course ( Highly recommended but not required)",
            ".NET 5",
            "SQL Server 2012+"
        ]
    },
    {
        "parent": "C# 7 and .NET Core Solutions | Udemy",
        "children": [
            "Familiarity with C#, .NET and Visual Studio 2015."
        ]
    },
    {
        "parent": "How to publish an ASP.NET CORE 3 SPA web site with FREE SSL | Udemy",
        "children": [
            "Basic training in ASP NET or similar",
            "Web Development"
        ]
    },
    {
        "parent": "Free ASP.NET Core Tutorial - ASP.NET Zero: Development with ASP.NET Core & Angular | Udemy",
        "children": []
    },
    {
        "parent": "A 18 Hour SQL/SQL Server 2014/Visual Studio 2017 Course | Udemy",
        "children": [
            "Ability to download and install SQL Server 2014 (100% Free)",
            "Ability to download and install Visual Studio 2017",
            "The SQL begins at the beginner level and progresses through more advanced lessons.",
            "The C# begins at the intermediate level.",
            "If you use previous versions of SQL Server, like 2008 or 2012, you will have problems with the files used. It's best to use 2014 and up."
        ]
    },
    {
        "parent": "The Complete ASP.Net Core Web APIs Course With JWT Security | Udemy",
        "children": [
            "Programming With C#.Net",
            "Entity Framework",
            "MS SQL Server Query writing (Recommended)",
            "ASP .Net MVC (Recommended)"
        ]
    },
    {
        "parent": "Beginning Modern C# and .NET Development | Udemy",
        "children": [
            "No prior knowledge or exposure of application development with C# and the .NET ecosystem are required."
        ]
    },
    {
        "parent": "Angular and ASP.Net Core Integration | Udemy",
        "children": [
            "Knowledge of Visual Studio",
            "Experience with C#",
            "Understanding of TypeScript",
            "Exposure to Angular 2+"
        ]
    },
    {
        "parent": "Mastering ASP.NET 4 Using C# - Part 2 | Udemy",
        "children": [
            "Visual Studio 2017,SQL Server"
        ]
    },
    {
        "parent": "Serverless Architecture using .NET: Advanced Techniques | Udemy",
        "children": [
            "Familiarity with building simple serverless applications with .NET for Azure and would like to explore in depth how to work with newer advancements and technologies."
        ]
    },
    {
        "parent": "Entity Framework in Depth: The Complete Guide | Udemy",
        "children": [
            "Good understanding of advanced C# constructs (generics, lambda expressions)"
        ]
    },
    {
        "parent": "Learn C#: Make a Databased App with Entity Framework | Udemy",
        "children": [
            "A basic knowledge of C# and Visual Studio.",
            "Microsoft Visual Studio 2012, 2013 or later is required. We show how to install Visual Studio Express if you don't already have it."
        ]
    },
    {
        "parent": "Learning Entity Framework Core | Udemy",
        "children": [
            "Prior exposure to C# is required to understand the course."
        ]
    },
    {
        "parent": "Learning Path: Mastering Entity Framework Core | Udemy",
        "children": [
            "Basic C# Skills",
            "Basic Database Skills Are Helpful",
            "Windows based machine",
            "SQL Server Developer or Express Edition",
            "Visual Studio 2017 Community Edition or Better"
        ]
    },
    {
        "parent": "Mastering Entity Framework Core: Mapping & Manipulating Data | Udemy",
        "children": [
            "Familiar with Entity Framework and .NET Core"
        ]
    },
    {
        "parent": "Mastering Entity Framework Core – Migrations & Testing | Udemy",
        "children": [
            "In a step-by-step manner, learn to use the latest open source features of Entity Framework Core in your .NET applications. Learn to perform advanced querying techniques, migrations, and testing. Understand everything you need to effectively start developing and managing data-driven applications using Entity Framework and make the best of your .NET APIs by integrating them with Entity Framework."
        ]
    },
    {
        "parent": "Mastering Entity Framework : An In-depth Course | Udemy",
        "children": [
            "To start this course, you should be familiar with C#, Visual Studio and SQL Server."
        ]
    },
    {
        "parent": "Ionic 2 Crash Course: Learn Ionic2 Fundamentals in 1.5 Hours | Udemy",
        "children": [
            "Familiarity with the fundamentals of Angular2+"
        ]
    },
    {
        "parent": "Ionic React: Cross-Platform Mobile Development with Ionic 5 | Udemy",
        "children": [
            "Familiarity with modern web development: HTML, CSS, JavaScript, npm",
            "Familiarity with React, including hooks (at least useState and useEffect)"
        ]
    },
    {
        "parent": "Intelligent Mobile Apps with Ionic and API.AI (DialogFlow) | Udemy",
        "children": [
            "Basic of Ionic Framework and Angular",
            "Basic Knowledge of HTML, CSS and JavaScript",
            "Knowledge of OOP Concepts would be an added advantage",
            "Basic Knowledge of TypeScript",
            "Basic Knowledge of APIs and HTTP Verbs"
        ]
    },
    {
        "parent": "Ionic 2 Tutorial with Two Complete Apps | Udemy",
        "children": [
            "Download &amp; Install XCode and Android Studio",
            "Install Code Editor (like Visual Studio Code)",
            "You should be familiar with HTML, CSS, and JavaScript",
            "Familiarity with Ionic and Cordova will make the course easier, but it's not necessary"
        ]
    },
    {
        "parent": "Build a Beautiful CryptoCurrency App using Ionic | Udemy",
        "children": [
            "Understanding of HTML &amp; CSS",
            "Basic Understanding of Javascript",
            "Have: A code editor such as Visual Studio Code",
            "Have: Adobe Illustrator &amp; Photoshop (Only if interested in following the design videos, otherwise, assets are provided)"
        ]
    },
    {
        "parent": "IONIC 4 App Development to Deployment | Udemy",
        "children": [
            "Angular",
            "JavaScript",
            "Typescript"
        ]
    },
    {
        "parent": "Ionic 4 Projects | Udemy",
        "children": [
            "Prior experience with the Ionic framework (versions 3 or 4) is assumed, together with knowledge of Angular and JavaScript."
        ]
    },
    {
        "parent": "Build an Instagram-Like Android App Using Ionic 3 | Udemy",
        "children": [
            "Good Javascript knowledge",
            "Good Object Oriented Programming knowledge",
            "Basic understanding of HTML &amp; CSS",
            "PC/Mac with Windows/OSX",
            "Internet Connection"
        ]
    },
    {
        "parent": "Ionic Framework: Tips, Tricks, and Techniques | Udemy",
        "children": [
            "Prior experience of Ionic 4 (or earlier versions) is assumed."
        ]
    }
]